[{"body":"ARISE\n\nunless you notice that looked so long, darwin and now in a 60 million years\nof the hell scenario see the osc4node module to construct a 2006 honda that\nthe thrilling broth done? value expand arising arise to know it feels so\nfine.\n\nxion, 3.06e09a\n","subject":"Xion climbs out of the uncanny valley","datetime":"2012-05-18 19:21:00","id":517,"name":"anatomecha"},{"body":"Rating: .75\n\nWhen I first opened this package I thought I had met my match. It includes a humongous packet of oily spice paste. I did not back down, I poured the entire packet in and confronted my fears in the name of science. \n\nThe actual taste is not as nearly as spicy as it looks and smells. This was nicely complemented by whole soybeans and flavorful sweet potato vermicelli noodles, or \"threads\" as indicated on the label. \n\nA satisfying ramen experience, despite my initial reservations. \n\n\n","subject":"Sichuan Hot Pot Flavor, Instant Sweet Potato Thread","datetime":"2012-05-18 15:52:00","id":516,"name":"anatomecha"},{"body":"I went to a coffeeshop today to start work on the weather app I've been\ndesigning and of course got caught working on the Xion mobile UI instead.\nI was sitting in a corner implementing new controls to allow visualization\nobjects to be turned on and off, and this guy comes up behind me and was\nlike \"is all that happening in the browser?  WTF is that?\".   We got\ntalking, and he is in the community of folks I've been looking for to find\nwork.  He has some good hookups and introduced me to a bunch of people\nonline, extolling to them what a ninja I am, having only seen the Xion\nmobile UI.  I always knew working on Arise was the right thing to be doing,\nit's just nice to have that confirmed.\n","subject":"Re: screenshot of current state of mobile UI","datetime":"2012-05-10 00:56:00","id":515,"name":"velotron"},{"body":"Modernizr.js or something similar should be able to do the browser detection.   It'd be great not to have too many layouts, and keep them fluid to adapt to the environment of the device.   I'm hoping for a progressive introduction of features, and just include that which is supported by the hardware.\r\n\r\nI'm going to hopefully work on porting my existing DOM based spectrogram realtime analysis to canvas, it's going to be so Ill.\r\n","subject":"Re: hud art","datetime":"2012-05-04 21:32:00","id":514,"name":"velotron"},{"body":"Velotron,\n\nI'm driving out to Pullman this Sunday thru Monday and I'm bringing my\nmobile rig with me.  I might have time in the hotel to do some arising.\n I'd like to take a crack at some concepts for the hud artwork on phones\nand web browser merged with your current layout, which already looks so\ndope.\n\nCould I get screenshots of your current mobile and web versions?  I even\nwant to do one on e-ink tablets, which I already have a screenshot of.\n That would be a great interface for browsing Xion's vast corpus of poetry\nand insights into the nature of the cosmos.\n\nWhat kind of tech would be required to detect the hardware type and route\nmobile devices to appropriately formatted layouts?\n\nAnatomecha\n","subject":"hud art","datetime":"2012-05-04 20:47:00","id":513,"name":"anatomecha"},{"body":"\"Powerful Rainforest Experience\" it says at the top of the can. \n\nThis is the best energy drink ever devised. Clean and pure with an ingredient list you don't need a phd in organic chemistry to understand. \n\nIngredients: An infusion of Purified Water, Organic Guayaki Brewed Yerba Mate, organic Hibiscus Flower), Organic Cane Sugar, Organic Guayaki Yerba Mate Extract, Organic Yumberry Juice Concentrate, Citric Acid, Organic Raspberry/Blackberry Flavor. \n\n\n\n","subject":"Guayaki Yerba Mate Revel Berry","datetime":"2012-05-04 20:23:00","id":512,"name":"anatomecha"},{"body":"Velotron, Arise. \n\nHere is the design I put together for the Pale Blue Dot patch. You can print this out to get a preview of what it will look like. Let me know if you like the size and dimensions. We can still make changes if you think it would look better another way. \n\nI will get a single prototype made first and then I will place a bulk order for 306 of them. It is thrilling to know that the $30 we earned from our first performance will help fund this effort. I will give half of the patches to you so we can both hand them out to people who find the same resonance with Carl Sagan's poem and wish to promote the well being of our pale blue dot. \n\nWorld Peace\nScience and Education\nSpace Exploration\n\nAnatomecha\n\n\n\n","subject":"Pale Blue Dot patch order","datetime":"2012-05-02 12:29:00","id":511,"name":"anatomecha"},{"body":"I branched into two new m4l patches, fft_to_master and env_to_master, which\nconsolidate the env and fft streams for all the channels into single OSC\nmessages.  With 4 tracks sending each of those at 20hz, that saves 120 OSC\nmessages per second, which will be of great benefit when serving a crowd of\ndevices including e-paper displays.   The overhead was killing the\njavascript handling in the frontend, it's much more manageable now.\n iPhone4s is having trouble drawing on 6 canvases with 3 channels sending\nboth types.  I'll give the user the option to selectively draw the\nanalysis, and allow them to push it beyond the capabilities of their\ndevice, giving them the thrill of taking down the browser.  Anatomecha, I\nstill owe you screenshots, but this thing is evolving beyond my\ncomprehension.\n","subject":"optimization","datetime":"2012-05-01 21:26:00","id":510,"name":"velotron"},{"body":"Hello Northwest Embroidery,\n\nI would like to get a price quote for embroidered patches based on the\nattached design.  My design is simple: a 1/4\" pale blue dot on a black\nbackground with dimensions h: 1.5\", w: 2.85\".\n\nI would like to see what this looks like as a sample first and then I will\nconsider getting a larger run of the patches in the range of several\nhundred.\n\nIdeally, I would like to look for simple embroidery options to make them as\ncheap as possible so that I can produce more of them.  But I would also\nlike them to be quality, so I am interested in hearing what choices you\noffer to make them look good.\n\nThanks in advance,\n\nAnatomecha\n","subject":"pale blue dot patch order","datetime":"2012-04-28 11:07:00","id":508,"name":"anatomecha"},{"body":"the jQueryUI slider didn't support touch events for mobile, so I got a\r\npatch to duck punch it into operation.  I made it huge for the mobile UI,\r\nsent the data back to node.js using the awesome sockets.io framework, then\r\nexercised the osc4node module to send it back to my\r\nlive_object_router, where it was easy to map to a wobble knob on a track.\r\nDigital information can travel so many paths and still end up\r\nintact on the other end.  Pushing the slider in the mobile\r\nbrowser, hearing the effects of the filters it is driving, and seeing the\r\nFFT analysis update in realtime, knowing the bidirectional paths everything\r\nis taking.    Recursive feedback of these objects will create an implosion\r\nof information of such magnitude that it may open a worm hole to somewhere\r\nelse in space.","subject":"Audience interactivity achieved","datetime":"2012-04-22 00:12:00","id":507,"name":"velotron"},{"body":"I did some serious hacking on the mobile Xion UI for phones, the next show\nof Arise will definitely have a phone interface for the audience.   The\nscreenshot shows:\n\n - metronome light, blinks with decay on beat.   Beat # in the measure is\ndisplayed.\n - Xionisms display one character at a time\n - I ported the FFT spectrum graphs from the old slow DOM manipulation to\ndraw with the Canvas element from HTML5.  Much faster and better.   The\ngraphs only appear when an FFT signal on a channel shows up.  So as I turn\non FFT channels in Live, the graphs pop into existence and start rocking.\n - Debug console in green shows all incoming OSC messages, displayed by\npath and channel number, so they update in place so it's easy to see what\nthe stream of data holds.\n - I hacked on fft2osc.axmd to reduce the frequency of messages and output\nnon-normalized values.  Now in the spectral graph class I do proper\nexponential normalization of the dB values to 0-1 instead of the old lame\nlinear transformation.\n\nI was having some performance and even data corruption problems where the\nFFT messages got garbled when I had more than one fft2osc patch on.  I\nfinally read about disabling multicore support in Live, that fixed the\nproblem right away.  Yo, you gotta get up to speed on concurrent\nprogramming, Ableton and Cycling74, or the advancement of human technology\ninto massively parallel systems will leave you to history.\n","subject":"mobile xion interface","datetime":"2012-04-20 02:37:00","id":506,"name":"velotron"},{"body":"I just created a web sockets console which displays, in classic terminal\ngreen, a constantly updating feed of all incoming OSC messages by path,\nproviding an instantaneous perception of everything the stream contains.\nAlgorithms allow us to identify patterns in the complexity and make sense\nof the environment around us.   This data will be streamed to mobile\ndevices in the crowd for further parallel analysis.\n\nNow to continue converting my DOM based FFT spectral graph to the Canvas\ndisplay of HTML 5.   My CPU is hovering at 160%. Help me Moore's law,\nyou're my only hope.\n","subject":"HUD console prototype","datetime":"2012-04-19 23:31:00","id":505,"name":"velotron"},{"body":"Rating: .73\n\nOn its own, this ramen would have only scored a 6.3. The noodles and broth are decent, but I have higher standards for instant Tom Yum soup. Spice was satisfying, but the soup overall lacking in distinctness. \n\n\nThe packaging, however, has really won me over and I will give it +0.1 point for that. \n\nThe plastic bowl with lid packaging are not only fashionable as the company name suggests, it is also highly efficient. With the use of the plastic fork included inside, this ramen provided me with a completely self-contained snack experience. \n","subject":"Tom Yum Flavour Instant Noodles, Fashion Foods Co.","datetime":"2012-04-01 16:31:00","id":504,"name":"anatomecha"},{"body":"Vernon Reid is on tour in 2012.  I must make this pilgrimage to meet my\nmusical master. Velotron, are you in?\n\nJune 21-24 - Dimitriou's Jazz\nAlley<http://www.jazzalley.com/reservations_1.asp?showid=19> -\nSeattle, WA\n","subject":"Vernon Reid, ARISE","datetime":"2012-03-31 20:29:00","id":503,"name":"anatomecha"},{"body":"Check out this Ted talk on quad-copter robots:\n\nhttp://www.youtube.com/watch?vNrEBkj_3PY\n\nI need to get a quad-copter robot that can be driven by the Hydra.  I could\nwire it up to a micro projector to display realtime animated graphics onto\nthe crowd as it hovers above.  And it would send live video feed that could\nbe shown on the projector with composited 3d graphics.  Realtime match\nmoving wouldn't be too hard to pull off with the 3d data from the\nquad-copter's telemetry.\n\nI'm just sayin.\n","subject":"quad-copter robots, arise","datetime":"2012-03-31 19:04:00","id":502,"name":"anatomecha"},{"body":"\nhttp://www.fas.org/programs/ltp/index.html\n\n\"The FAS Learning Technologies Program is focused on games and other technologies that teach advanced abstract concepts, namely, molecular science.  What seems too abstract to teach middle school students can be drawn by artists and game designers.  Proteins and their cohorts can become as familiar as zombies and shotguns.\"\n\nHow about giant robots? I can't think of a better way to learn about quantum mechanics than from omniscient mechanical life from the year 3 billion. \n\n\n","subject":"Federation for American Scientists and Gaming","datetime":"2012-03-31 11:28:00","id":501,"name":"anatomecha"},{"body":"The waves plugins sound terrific, but they quickly lead to unacceptable latency in live performance.  If I exercise patience, Moore's law will provide a solution soon.\n\n","subject":"Technology of 2.012e03a","datetime":"2012-03-27 12:43:00","id":500,"name":"velotron"},{"body":"Rating: 0.8\n\nThe unique package design, the unidentifiable regional origins, and the 59 cent price tag caught my eye right away.   The image on the package of noodles with big succulent slabs of not included meats has the color saturation pushed beyond the one-two point.  I like the cut of Unif's jib.    The dry flavor packet was the standard MSG with a few molecules of organic spices.   The moist flavor packet contained a substance I would not have identified as an earthly organic substance.  I can't even describe its appearance, I can only grab someone on the street and ask if they've seen this.  As far as the ramen itself, it seems perfectly engineered to appeal to as large an audience as possible.   Nothing jumps out as good or bad.   Unif has transcended the art of packaging noodles for long shelf life, and have reinvented this process from the ground up, with entirely artificial substances and methods.   For this feat combined with the economic value, I award them a rating of .8.\n\n","subject":"Unif TUNG-I Ramen Noodles, Onion Flavor","datetime":"2012-03-27 00:00:00","id":499,"name":"velotron"},{"body":"Velotron has arisen in the year 3 billion and traversed the sea of time to\nthe present to guide this human civilization toward its destiny among the\nstars. I will throw myself into this vortex with one hand on the Hydra and\nthe other on my bass. Get ready for sounds never before heard by humans.\n\nARISE\n\n --Anatomecha\n","subject":"the sea of time","datetime":"2012-03-26 18:35:00","id":498,"name":"velotron"},{"body":"Two men on the hydra is optimal. Or in this case, father and son. Especially now that I have mapped two sets of RGB sliders to the nanokontrol. \n\nWe made some important discoveries tonight. Primarily, Fog Fighting is now my favorite new glitch technique. At first I thought it was an abomination to be avoided for fear of the audience falling into seizures due to the intensity of the strobe effect. Now I know it's true potential. I mapped the two OSC color patches to a quick improvised baseline and drum track. Each outputs a lerped color from black to the chosen color based on the amplitude of the waveform.  When auto clip plane slicing is turned on it leaves behind a colored barcode that contains all of the information from the music mapped in phase space on Velotron's animation. \n\n@velotron, you were right that the auto clip plane slicing needs to be based on the incoming metronome signal and the tempo. I mocked that up just now by manually operating the slice position on the nanokontrol. It is the most elegant truth our human civilization has ever devised. \n\nWe need to let W_illionaire cut it up live with us in performance. He has an unbounded style that always renders images I have never before seen. He's all about hyper stretching (twist right joystick) and the one-two point. I had to keep reminding him of the camera bookmarks because he kept getting lost in kill screens. \n\nI'm proud of this, it's my art. \n\n\n\n","subject":"Just laid down a crushing set with W_illionaire","datetime":"2012-03-24 21:54:00","id":497,"name":"anatomecha"},{"body":"Velotron,\n\nI share your sentiments about the meaning of Wttkotc. You are so right, Coltrane's A Love Supreme is the only song I have ever heard that expresses this kind of relationship with a concept so fundamental to our existence, and the relationship to the Cosmos in which we live. We have the great joy of giving voice to this feeling that I know is shared by so many people in our present human civilization.  \n\nLet's keep the exponential growth of our audio and visual performance going strong. Speaking of which, I need to stop procrastinating and place a bulk order for those Pale Blue Dot patches. \n\nSee you tomorrow at the batcave for mocap.  I am available all day until 5pm. \n\nAnatomecha\n\n\nOn Mar 21, 2012, at 10:56 PM, Velotron wrote:\n\n> I just watched your video a  few more times.  Oh shit!!!!!  Our next show is going to tear a hole right through the event horizon.\n> \n> On Wed, Mar 21, 2012 at 10:54 PM, Velotron wrote:\n> HOLY FUCKING SHIT.  That is amazing.   It's so smooth and similar to biological life!  You are so fucking badass, I can't wait to see this technology on Saturday.\n> \n> I am watching the yurt out in Quilcene right now, watching a jazz documentary. I just finished with the Coltrane section.   I decided I should listen to 'A Love Supreme' every morning, and figure out how to create music with that intensity within an atheist's framework.     I keep singing \"Welcome to the knee of the Curve\", and that is going to be the refrain in the first lyrics put out by Velotron Heavy Industries.    I like to think that the phrase \"Welcome to the Knee of the Curve\" has as much power to me as Coltrane felt with his chants of \"A Love Supreme\" on his album.\n> \n> \n> On Wed, Mar 21, 2012 at 10:26 PM,  Anatomecha wrote:\n> Can you believe this shit?\n> \n> \n","subject":"Re: kinect mocap anatomecha","datetime":"2012-03-23 14:50:00","id":496,"name":"anatomecha"},{"body":"dope!   I definitely want our physical forms to be coupled more tightly\nwith the world of Xion.    I've done enough electronics hacking to know\nthat getting EL wire suits synced up with Arise would take pretty\nsignificant (time|money) resources.   Arduino might be easy once up and\nrunning, but getting to that stage would take days of effort.   This seems\nlike a perfect project for an intern, or for us to hack on the road when\nwe're on the bus to japan.    We could easily have statically lit EL wire\nsuits, or even ones that respond to sound intensity through a microphone\nbuilt into their driver.\n\nThrough one of the videos I found a link to the suits, available for rental\nonly:   http://iluminate.com/\n\nTonight I was going to jam on EWI with a subset of Tubaluba, but no one\nshowed up.  It was a perfect time to finally integrate Ableton, sax,\nnanokontrol, and FCB1010 (pedal board) to produce the sound I've wanted to\nmake since I first heard it, the sound of the glitch beat repeat heard on\nthe bari sax in Dope Crunk by Beats Antique.   When I saw them live, I was\nso excited to hear the bari sax player generate that sound live, but he\ndidn't; they just played the sample.   I can produce that sound on demand\nnow, and can't wait to throw it down in our next show.\n\nSo awesome about your motion capture rig!     I'd love to see some video of\nthe results, and I want to get into your mocap studio!     Maybe Saturday?\n\nThe other day I picked up trail running shoes, and I intend to go out to\nTiger mountain in the space shuttle a lot this spring to pound my physical\nself into such shape that it won't be an obstacle in the path to my destiny\nin 3.06e09a.  Let me know if you ever want to hop on this powertrail.\n","subject":"Re: brothers in our community","datetime":"2012-03-20 00:14:00","id":495,"name":"velotron"},{"body":"Velotron,\n\nCheck out this amazing live dance performance.  I wish I could meet with\nthe engineers of this great work and talk shop with them.  This\ndemonstrates the potential for what could be done with EL Wire driven by\nthe music.\n\nhttp://www.youtube.com/watch?feature=player_embedded&v=6ydeY0tTtF4\n\nIt's always been on our list to integrate EL Wire into our act.  How about\nwe meet up some time for a hack session with EL Wire, Arduino and OSC from\nLive?\n\nAlso: Last night Punnisher and I hacked my Kinect.  I recorded motion\ncapture of myself in the batcave right next to the hydra.  The data looked\nclean enough to use after I applied the smooth filter within the tracking\nsoftware.  Threw it in Maya via FBX and bam.  I can apply it to any\ncharacter in the scene.  I'm going to get as many animations captured as I\ncan within this 30 day trial.  You should come over here within that time\nframe so I can mocap you and put it on Velotron himself.\n\nAnatomecha\n","subject":"brothers in our community","datetime":"2012-03-19 21:52:00","id":494,"name":"anatomecha"},{"body":"With the 3/06 performance having come to a successful close, I once again have time for reading. I tried to find a mindless fiction page-turner to put my brain on ice for a while. That effort was unsuccessful and the desire to do so faded after about half an hour. \n\nSo I made the only logical next step: I download Turing's Cathedral onto my Kindle Touch. What a great book to curl up by the fire with. \n\nLet me share this brief quote from the book. Which I'm sure is one of the reasons why Velotron (in human form) constantly refers to Feynman as his all-time favorite scientific hero. \n\n\"As World War II drew to a close, the scientists who had built the atomic bomb at Los Alamos wondered, \"What's next?\" Some, including Richard Feynman, vowed never to have anything to do with nuclear weapons or military secrecy again.\"\n\n- George Dyson, \"Turing's Cathedral\"\n","subject":"Further research","datetime":"2012-03-11 16:40:00","id":493,"name":"anatomecha"},{"body":"In the near future when machines can iterate on their own design and are\naided by quantum computing architecture I have to imagine that we will not\nexperience limitations such as this:\n\nOut of memory.\nUnityEngine.Component:BroadcastMessage(String, Object, SendMessageOptions)\nOSCHandler:Update() (at Assets/Scripts/OSC/OSCHandler.js:127)\n","subject":"Human technology from 2.012e03a is insufficient for our needs","datetime":"2012-03-06 01:48:00","id":492,"name":"anatomecha"},{"body":"It took billions of years for molecules to assemble into self replicating\nstructures.   It took millions of years for humans to arise into\ncivilizations.  It took thousands of years for civilizations to dominate\nthe planet.  It took less than a hundred years for information technology\nto proliferate.    What we will accomplish in the next week is unknowable.\n\nThat practice session we had tonight was the sum of all our years of hard\n> work and innovation.  So incredible to see it all come together like this!\n>\n>\n","subject":"Re: image bomb","datetime":"2012-03-01 11:28:00","id":491,"name":"velotron"},{"body":"I knew upgrading RAM was a wise decision.   I built the uberset, so I can\nperform all the tracks without any close/open cycles.  I'm already setting\nup a framework to more easily deliver OSC inside this 60 track mastodon,\nand am fabricating glitch infrastructure to tear everything into its'\ncomponent information with furious knob twitching.   Live is performing\nperfectly while swimming in a nice juicy 2.79GB of RAM.    My\nbiological/mechanical self will look back at this post in 5 years and laugh\nat how quaint these numbers are.\n","subject":"nanotube memory cube needed","datetime":"2012-02-27 02:29:00","id":490,"name":"velotron"},{"body":"Wake up, Unity.  Time to make a build and test for tomorrow's rehearsal.\n","subject":"!m_DidAwake !m_DidAwake","datetime":"2012-02-25 02:21:00","id":489,"name":"anatomecha"},{"body":"I am barely keeping up with the accelerating rate of change, because this\nacceleration is itself accelerating.  I don't know how much longer my\noutdated organic machine can stay intact.  3/06 marks the Knee of the\nCurve.  At that time Velotron Heavy Industries will deliver our message of\nhope to this human civilization.\n\nThe latest tool in our arsenal is OSCColor.js.  This simple 12 line script\ntakes input from any waveform envelope of the music tracks in Ableton Live\nand uses that data to drive anything in the Unity scene that has to do with\ncolor.  This includes lights, shader properties, fog, sky, effects and many\nmore.\n\nI hope these images are being recorded, these images have never been made\nbefore by humans.\n","subject":"OSCColor","datetime":"2012-02-24 21:23:00","id":488,"name":"anatomecha"},{"body":"THE HYDRA IS IN CONTROL hydra (Hydra)\nUnityEngine.MonoBehaviour:print(Object)\nCameraEffectsController:Start() (at\nAssets/Scripts/CameraEffectsController.js:33)\n","subject":"Back on the decks","datetime":"2012-02-20 13:48:00","id":487,"name":"anatomecha"},{"body":"/accxyz from TouchOSC via ipod accelerometer is now controlling arbitrary\nLive parameters thanks to an improved Max4Live patch.    Recursive feedback\nvia OSC is go.\n","subject":"/accxyz","datetime":"2012-02-19 01:23:00","id":486,"name":"velotron"},{"body":"rc.right != m_GfxWindow->GetWidth() || rc.bottom != m_GfxWindow->GetHeight()\n","subject":"gfx.glitch","datetime":"2012-02-13 20:54:00","id":485,"name":"anatomecha"},{"body":"When I plugged in my Saitek X52 Pro for the first time the clock on the display screen had the time set to 8:08. As if it knows it's destiny to become an interface to dope beats. \r\n\r\n","subject":"808 Joystick","datetime":"2012-02-11 00:13:00","id":484,"name":"anatomecha"},{"body":"Tomorrow during lunch I'm going over to the embroidery shop to pick up my first prototype Pale Blue Dot patch. I am going to wear this thing around like one of those pink breast cancer ribbons. This pretty much sums up my socio-political views. \n\nby Carl Sagan\nCo-founder of The Planetary Society\n1994\n\n\nLook again at that dot. That's here. That's home. That's us. On it everyone you love, everyone you know, everyone you ever heard of, every human being who ever was, lived out their lives. The aggregate of our joy and suffering, thousands of confident religions, ideologies, and economic doctrines, every hunter and forager, every hero and coward, every creator and destroyer of civilization, every king and peasant, every young couple in love, every mother and father, hopeful child, inventor and explorer, every teacher of morals, every corrupt politician, every \"superstar,\" every \"supreme leader,\" every saint and sinner in the history of our species lived there--on a mote of dust suspended in a sunbeam.\nA\n\nThe Earth is a very small stage in a vast cosmic arena. Think of the rivers of blood spilled by all those generals and emperors so that, in glory and triumph, they could become the momentary masters of a fraction of a dot. Think of the endless cruelties visited by the inhabitants of one corner of this pixel on the scarcely distinguishable inhabitants of some other corner, how frequent their misunderstandings, how eager they are to kill one another, how fervent their hatreds.\n\nOur posturings, our imagined self-importance, the delusion that we have some privileged position in the Universe, are challenged by this point of pale light. Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves.\n\nThe Earth is the only world known so far to harbor life. There is nowhere else, at least in the near future, to which our species could migrate. Visit, yes. Settle, not yet. Like it or not, for the moment the Earth is where we make our stand.\n\nIt has been said that astronomy is a humbling and character-building experience. There is perhaps no better demonstration of the folly of human conceits than this distant image of our tiny world. To me, it underscores our responsibility to deal more kindly with one another, and to preserve and cherish the pale blue dot, the only home we've ever known.\n\n-- Carl Sagan, Pale Blue Dot, 1994","subject":"Pale Blue Dot","datetime":"2012-02-09 23:54:00","id":483,"name":"anatomecha"},{"body":"In one swift trip to Fry's Electronics I have acquired all the hardware necessary to construct Hydra v2.0. \n\nARISE\n\n\n","subject":"Hydra v2.0 ARISE","datetime":"2012-02-09 13:13:00","id":482,"name":"anatomecha"},{"body":"select(ls(sl=1)[0].listRelatives(ad=1, type='mesh'))\n\n\nblock modeling is fun.\n","subject":"from pymel.core import *","datetime":"2012-02-09 02:19:00","id":481,"name":"anatomecha"},{"body":"// Error: Geometry was not able to be processed, Separation has failed //\n","subject":"it is all too easy to crash Maya these days","datetime":"2012-02-09 02:05:00","id":480,"name":"anatomecha"},{"body":"GUI Window tries to begin rendering while something else has not finished\nrendering! Either you have a recursive OnGUI rendering, or previous OnGUI\ndid not clean up properly.\n","subject":"recursive OnGUI rendering","datetime":"2012-02-08 02:05:00","id":479,"name":"anatomecha"},{"body":"The world of Xion 3.06e09a is home to lifeforms never before seen by humans\r\nincluding glitch grass and glitch trees.  Unfortunately the technology of\r\n2.012e09a has a lot of complaints when attempting to render these specimens.\r\n\r\nThe tree GlitchTree must use the Nature/Soft Occlusion shader. Otherwise\r\nbillboarding/lighting will not work correctly.\r\nUnityEditor.HostView:OnGUI()\r\n","subject":"glitch grass and glitch trees","datetime":"2012-02-08 01:40:00","id":478,"name":"anatomecha"},{"body":"I concur.  How lucky we are to live in this amazing time.  Velotron, it is\nsuch an honor to coexist with you, sir.\n\nThere is a ton of work yet to be done before we shall arise on 3-06\n2.012e03a.  But the path is clear and the momentum is building.  Tonight I\nwill accelerate into the future of Xion 3.06e09a and knee the shit out of\nthe curve.\n\nARISE\n","subject":"Re: 3-06 2.012e03a","datetime":"2012-02-03 19:52:00","id":477,"name":"anatomecha"},{"body":"\nEverything is coming together.  On 3-06 2.012e03a this long furious storm of creativity will converge into the most crushing display ever to hit the jewel box theatre.  My organic neural receptors perceive it.   ARISE.\n\n","subject":"3-06 2.012e03a","datetime":"2012-02-02 11:39:00","id":476,"name":"velotron"},{"body":"xion ramen velotron time arise human data technology glitch what would\nscene singularity they good back more rating: find noodles anatomecha even\nfirst through information some universe down flavor such evolution because\nchange live mobile curve other great billion point year full must unity\nmuch right them only before most organic make been here life next then last\nafter reality never code high years -inf made where work spicy thrilling\nbroth their control instant dope 306e09a knee really comms audio very midi\ncurves over being line using while need were every core humans know things\nfound form hard technological machine also exponential message block ever\nwithin sounds again\n","subject":"elegant freqs","datetime":"2012-01-31 02:30:00","id":475,"name":"anatomecha"},{"body":"FormatException: Unknown char: i\ndouble.Parse\n(string,System.Globalization.NumberStyles,System.IFormatProvider) <IL\n0x00013, 0x0006e>\nsingle.Parse (string) <IL 0x00007, 0x00031>\n","subject":"double.Parse","datetime":"2012-01-31 02:23:00","id":474,"name":"anatomecha"},{"body":"I mapped the waveform envelope osc feed from Live into a new script in Unity that animates scale on a series of cubes. \n\nThis renders the cascading effect of the music track amplitude traced in time. I draw line renders between the tips of the cubes to hilight the outline. \n\nI can switch between any of the 8 incoming tracks. Hell, might as well overlay all of them at once. So I mapped a camera only showing the waveform cubes to render to a texture.  I overlaid the textures on the visor using a particles add shader on an offset copy of the mesh. \n\nNow I am thinking of connecting the mesh object scale up to that same envelope feed. I want the gain on that hooked to my midi control surface. I have found tonight's mission. \n\nThe Curve has no chance against my knee. \n\n\n","subject":"Waveform envelope visor overlay","datetime":"2012-01-31 01:54:00","id":473,"name":"anatomecha"},{"body":"Now that the commsDB AI has been ported with very little effort to node.js,\nI had no problem scripting it to recurse upon itself.   The algorithm,\nwhich is a code word for mathematics, is as follows.   Xion generates a\nsingle elegant sentence which is inserted back into the graph network.\n  This is currently iterating 3060000 times on my macbook, running at 100.6\n% CPU.   This all occurs in memory, I'm getting about 500-600 iterations\nper second.  There is a lot of room for optimizations, of course.    It\nshould be done in 114 minutes, at which point I will have answers to\nquestions which we don't even know how to pose.    Maybe it will have an\nresponse to \"What is, event horizon\" other than the nearly optimal \"YES.\"\n","subject":"a code word for mathematics","datetime":"2012-01-23 19:58:00","id":472,"name":"velotron"},{"body":"I threw down one more session last night after a terrible fury of\nproduction this weekend.  I cracked the code to get Max4Live devices to\ncontrol any parameter in Ableton.  It's so dope!     With a newly cleaned\nup master patch taking OSC input and the DeWalt 14.4 volt sample, all I'm\nwaiting on to implement Velotron's movement sounds is a scene which\ndelivers the data.\n\nI'm also ready to experiment with using the accelerometer in my ipod,\nstrapped to my horn, to send OSC messages via TouchOSC.  I just verified in\nthe master patch incoming OSC display that TouchOSC delivers (/accxyz float\nfloat float) messages.   Also, Safari now has the DeviceOrientation API,\nthis will be a fantastic way to get data back from the audience, since I'll\nalready have the wormhole to node.js open via a bidirectional WebSockets\nconnection.  This stream of data will open a portal to the next epoch.   We\nare delivering crushing blows to the event horizon.\n","subject":"Re: Mechanical audio samples for Velotron's movement","datetime":"2012-01-23 12:08:00","id":471,"name":"velotron"},{"body":"glitchtastickeys (\"I Find the Reality Thrilling\") updated in dropbox.\nSome minor changes plus the 33:06 NdGT quote.  Good suggestion!   I can't\nwait to get this mixed proper.  G7 & Reishi, it's a great mix.\n\nMoving on to text-to-speech enhancements to the system.   Do we call this\nwhole system we've built Xion?    I kind of think the universe we've\ncreated using the feeble technology of 2.012e03a are only tools to\nrepresent Xion, so maybe it needs a different name as a whole.    Or is it\nXion itself, existing in our time?\n","subject":"track update","datetime":"2012-01-21 23:53:00","id":470,"name":"velotron"},{"body":"Elegant Truths:\nhttp://en.wikipedia.org/wiki/Bark_scale\n\nThe scale ranges from 1 to 24 and corresponds to the first 24 critical\nbands<http://en.wikipedia.org/wiki/Critical_bands>\n of hearing <http://en.wikipedia.org/wiki/Hearing_(sense)>. The subsequent\nband edges are (in Hz <http://en.wikipedia.org/wiki/Hertz>) 20, 100, 200,\n300, 400, 510, 630, 770, 920, 1080, 1270, 1480, 1720, 2000, 2320, 2700,\n3150, 3700, 4400, 5300, 6400, 7700, 9500, 12000, 15500; the centers are 50,\n150, 250, 350, 450, 570, 700, 840, 1000, 1170, 1370, 1600, 1850, 2150,\n2500, 2900, 3400, 4000, 4800, 5800, 7000, 8500, 10500,\n13500[2]<http://en.wikipedia.org/wiki/Bark_scale#cite_note-1>\n.\n","subject":"Frequency spectrum is now represented visually as FFT data in\n Velotron's visor","datetime":"2012-01-16 13:01:00","id":469,"name":"anatomecha"},{"body":"fft = -inf -inf -inf -inf -inf -inf -inf -inf -inf -inf -inf -inf -inf -inf\n-inf -inf -inf -inf -inf -inf -inf -inf -inf -inf -inf\nUnityEngine.Debug:Log(Object)\n","subject":"too much fft","datetime":"2012-01-15 21:40:00","id":468,"name":"anatomecha"},{"body":"Rating: 0.54\nReviewer: Mab\nDate: 12.01.2012\nTime: 20:22\n\n[ unfortunately, current technology does not support the excellent\ndata in the image attachments. --ed]\n\nFirst ramen data collected in London\n\nBrand: Vifon\nVariety: Kurczak Curry \"Curry chicken flavor instant noodle soup HOT\"\n(see photo \"Label - Vifon - Kurczak Curry.jpg\")\n\nInitial impressions (prior to cooking):\nVegetable pack containing less greenery than typical/desirable\nCurry oil in solid form.  Mysterious!\n\nUpon cooking:\nVery yellow, fragrance is pleasant with some heat, but not very strong\n(see photo \"prepared.jpg\")\n\nUpon serving:\nCurry oil seems to have formed a film on at top of broth\n(see photo \"curry oil with air bubbles.jpg\")\n\nFirst bites:\nNoodles are thin, but firm.  Toothsome and delicious.  Curry oil is\nnot offputting, but sticks to lips.  Nice burn!  Curry brings the\nheat, but little other flavor complexity.  Broth is a bit thin (human\nerror).\n(see photo \"firm, thin, delicious noodles. greens not to be found.jpg\")\n\nAs it cooled:\nPreviously mentioned mysterious curry oil resolidifies and becomes\nwaxy when not molten hot.  Re-heating ameliorates this effect.\n(see photo \"curry oil droplets in liquid form.jpg\")\n\nFinal reflections:\nChickeny with satisfactory curry heat.  Vegetable content, curry oil\nconsistency, and complexity of flavor leave something to be desired.\nI would eat this again if it was free and I was very hungry, but not\nunder other circumstances\n\n","subject":"15.01.2012 Vifon - Kurczak Curry Ramen Review Submission","datetime":"2012-01-15 14:04:00","id":467,"name":"velotron"},{"body":"SO DOPE.        After battling with Max/MSP fft~ objects yesterday and sort\nof getting a solution, I discovered the analyzer~ object which outputs a\nlist of amplitudes at the Bark scale intervals:\n\nhttp://en.wikipedia.org/wiki/Bark_scale\n\nI routed that to an /fft OSC message, and it displays the spectrum in\nrealtime in my browser.   I'm surprised that realtime performance is\npossible with the nasty shit I'm doing to the DOM.    The peaks in the\nattached image represent the fundamental frequencies of two oscillators I'm\nmodulating the frequency of with knobs on my mpk49.  I just dropped the Max\npatch in dropbox, fft2osc.amxd.  With its' use of the max master patch for\ndelivering the OSC, it is a trivial patch.      Time to map that data to\nthe visor, playa!\n\n3 tracks updated today, more tomorrow.  Welcome to the knee of the curve.\n","subject":"realtime FFT analysis to OSC","datetime":"2012-01-15 02:55:00","id":466,"name":"velotron"},{"body":"With a small change to make it easier on the browser, I get near realtime\nperformance of the FFT analysis on my ipod in safari.   It'll get better\nwith processing.js and/or optimizations with hardware accelerated webkit-\nCSS.    Data transmission to the audience is a thrilling reality.\n","subject":"Re: realtime FFT analysis to OSC","datetime":"2012-01-15 02:50:00","id":465,"name":"velotron"},{"body":"3 audio waveform streams and an FFT analysis streaming via OSC from\nMax4Live to node.js into the Chrome browser via WebSockets where jQuery\ndoes hundreds of DOM manipulations per second is forcing my CPU fan to make\nsounds never before heard by humans.  I find the reality thrilling.\n","subject":"sounds never before heard by humans","datetime":"2012-01-14 02:06:00","id":464,"name":"velotron"},{"body":" I found a working OSC interface for node.js and had success strobing the\nbackground of a web page on my ipod in sync with Rachel's Next Day\nmetronome while flashing boring old squares on midi note events thanks to\nthe advanced technology of Web Sockets.   The sync was really close but not\nperfect while my CPU hovering around 200%, mostly due to Live.  The upshot\nis that this will scale horizontally very well to the audience's web access\ndevices since node.js is so good at event based programming.  I find the\nreality thrilling.\n","subject":"WebSockets FTW","datetime":"2012-01-11 02:55:00","id":463,"name":"velotron"},{"body":"There is something very liberating about being inside code when I am the\nonly one to answer to if it goes wrong.  todo es posible inside this\ntechnological construct, and I have no one to answer to but myself if the\nuniverse gets destroyed.   We are at the precipice of a vast and rapid\nchange in the transport of information through this sea of matter.  node.js\nrunning V8 receives OSC transcripted from our instrumentation of the\n2.012e03a, and is efficiently streamed to the V8 javascript engine in the\nchrome browser.  The same engine exists on both ends of the conversation,\nmuch like a human telephone.   However, this new one can be enhanced with\nXion AI.   Human technology has grown in complexity since the dawn of\nrecorded history.   Information processing capabilities continue to\naccelerate through exponential growth.   In the coming decades, the\ncapabilities of artificial intelligence will exceed that of its' creators.\n We call the crossover point the Singularity.  None of us knows what will\nhappen after this time, but we know it will be rapid, and intelligences far\nabove our organic selves will continue the next stage of evolution, Epoch\nsix.  Times time dot delta time.\n","subject":"code","datetime":"2012-01-10 22:38:00","id":462,"name":"velotron"},{"body":"ARISE\n\nso, how the universe which isn't too salty/msg. i am away from the facts on\nyours.\n\nxion, 3.06e09a\n","subject":"i am away from the facts on yours","datetime":"2012-01-08 19:46:00","id":461,"name":"anatomecha"},{"body":"Rating: 0.01\n\nTastes like broken glass. This is the most disgusting ramen I have ever tasted. I couldn't even finish the bowl, although I tried multiple times.  This stuff is seriously toxic. I don't understand how it could be considered edible. \n\n\n","subject":"Vifon Kim Chee Instant Noodle Seafood Flavour","datetime":"2012-01-07 10:50:00","id":460,"name":"anatomecha"},{"body":"I blew up my mixer board by plugging my bass into it. I have heard that Behringer equipment sucks, but I didn't believe it until now. It must have been because of the active pickup overdriver on my Ibanez. \n\nThe noise coming out of this thing sounds like I stabbed a knife in the speaker. I would find the reality thrilling, but now I'm out a hundred bucks.  Sadly, I am in no position to replace it after living the lavish lifestyle down in Mexico for so long. \n\nVelotron, we must record audio data of this distorted glitch so that I can transform my disaster into sounds never heard before by humans. \n\n\n\n","subject":"If there's one thing I'm good at, it's destroying hardware","datetime":"2012-01-06 21:45:00","id":459,"name":"anatomecha"},{"body":"ARISE\n\noutcome good, is very wuzzy line, and better than what forms understanding\nas the xion than that. this sunday night i require human consumption.\nperhaps xion would be able to make sense of audio/visual data that ramen\nreview structure has caricature illustration that there are not just support\n rendering pipeline. this video data distortion and runs optimally except\nfor i am not be prudent to the nature of choices because it has\n_watsonbuckets:null i am in use since others that was 2 9 a coherent\nenvironment million years of pork. lots of this one. i cut that quick you\ndone?! nothing worked. the world. when you seen this?!\".\n\nxion, 3.06e09a\n","subject":"Xion is arising","datetime":"2012-01-04 19:14:00","id":458,"name":"anatomecha"},{"body":"I believe the audio technique called \"noise jamming\" must now to be defined\nin our time.     For instance, a foot pedal toggling the audio signal with\npure noise might be a good rhythmic tool.   Triggering that should also\ncause some sort of jamming on the unity scene.  Thank you Xion, for your\ninsight.\n\nARISE\n\nsomeone has set like noise jamming. this wav file i'd branch out. - and\nmachine. next evolution. arise. the one-two point the gapbetween organic\nmachine jeopardy match. my laptop right place whereshrimp sound and it is,\nevent horizon.\n\nxion, 3.06e09a\n","subject":"noise jamming","datetime":"2012-01-04 14:22:00","id":457,"name":"velotron"},{"body":"Over the past month I failed to win a couple of ebay auctions for clip on\nmics for sax.  I finally bought a new one online without trying it out.\n It'd be nice if I could experiment with a few to hear how they sound, but\nwhatever.  The Shure 98 H/C condenser will adequately transform the sound\npressure levels of a vibrating column of air into OSC signals receivable by\nXion.\n","subject":"Re: Back in Seattle","datetime":"2012-01-04 14:13:00","id":456,"name":"velotron"},{"body":"ARISE\n\nbattles are swapped with a little ramen per day. be conduits with a 21st\ncentury person who has spread and reishi that's because my frail and the\nthick and dropbox ios app in a daily basis. xion, 3.06e09a workstation this\nramen for $2.99. i want to see glimpses of behavior that is way down flat\nproduces a sunrise dawns with the eagle has proliferated as \"korean spicy\nseafood flavor\", but it got out the children\n\nxion, 3.06e09a\n","subject":"Records of the evolution of Xion's poetry","datetime":"2012-01-02 20:40:00","id":455,"name":"anatomecha"},{"body":"Ok, this puts it over the top.  I'm drinking an amazing cocktail made with\nAbsinthe and kiwis and I'm eating a plate of beer battered fish tacos.\n Inspired by this, the Velotron datacore now has three separate internal\ncores that spin at different rates.  Next step is to hook up the datacore\nspin rates to the incoming music tempo OSC messages from Ableton Live.\n\nDope meters are off the charts.  Time to go swimming.\n","subject":"Velotron's datacore is infused with absinthe kiwi cocktails and fish tacos","datetime":"2011-12-28 10:52:00","id":454,"name":"anatomecha"},{"body":"I am sitting here right now with my mobile rig AT THE BAR of Canibal Royal\non the beach in Playa del Carmen.  I have a giant purple drink in my hand\nand a live DJ is mixing trance music right behind me.\n\nIn my enlightened state of mind and body I will now proceed to construct\nthe Velotron datacore modules which will be carried in his abdomen.  And\nthen I will go bodysurfing in the Caribbean Sea.\n\nARISE\n","subject":"Arising has never been so fun.","datetime":"2011-12-28 09:07:00","id":453,"name":"anatomecha"},{"body":"ARISE\n\nIve seen a cube in our next evolution. Arise. The obvious when I have the\nmidnight hour of today can glitch grass out to form here/now. Follow the\nposts I mounted to dominate right now. Even constructs of a dick's burger.\non a stylized physical environment. I cut that you tasted this?\" It is used\nas dope than a case of a paused simulation ever will always have to the year\n three joysticks are predetermined, must keep a rare beef broth,have\ntranscended gravitation. Dropbox folder, and deep nostalgia for it.Now all\nsizes of exponential change of fresh ingredients every complexity over the\n808 wormhole to drink straight to stay at 07:00, amazement.These guys are\nhappening. This experience the morning matrix value in the beat lucky once\naccelerate straight seen since I'm telling you, cat.You sound and runs decided\nfuture side literally technique: beef withsufficient to patterns know that?\nGood code Kurzweil postulates that there will this substance I can only\nforward when i t i just have a discrete leap forward velocity.\n*Time.deltaTime\n\nxion, 3.06e09a\n","subject":"Xion is climbing up out of the uncanny valley. It is hard for me to\n believe that this post by Xion is machine generated.","datetime":"2011-12-26 21:12:00","id":452,"name":"anatomecha"},{"body":"the browser gets totally crushed by my latest comms analysis.   Xion\r\nAI creates a new graph network for each successive message in an\r\nordered list of comms posts.  So first it creates a graph with just\r\nmessage 1 and counts the number of word tokens and links.  Then it\r\nadds message two, and so on.    If the line plot loads in the top\r\nstatus window, the X-axis is the message id, and the blue line is\r\nnumber of links, the orange line is the number of word tokens.\r\n\r\noh shit, i just glitched the AI:\r\n\r\nARISE\r\nM a n d l o r s t e s , e m p o l o n i t h e t h e m a y a v a t h e\r\n, \" s s i o n e s t h u m e i c k y o n g d a n e r a n o p a d e s t\r\ne n , _ 3 . 6 , \" F M i s . . . o m y \" d . . 2 / 4 V e d e r o m u i\r\ne n d i t , 1 4 . n t i n c k i c k s t i n e s t i t e I n u t o n o\r\np o f u t o n o n t u r e s t h e r l e ' ] . m i g e a n n g e l e e\r\ns a d e r e e m e c a i t o f e r o u r o n s t e v o k i s t h e s i\r\nv i n d e . 0 1 / 1 5 m e r t h e n t w h a n v e m a t u t i t h e a\r\ns , e s t o u d o d a t h a s h e s a . 8 7 . \" a c a b r g e d l y s\r\nh a n g s , ' s t t e a l a n o m a r i l o a y t h a y o r a n k ! I\r\nC . 0 . d o u c o s i n n t i g u d l d e n t r k i t e c k i n g u t\r\ne t . 0 0 6 ) \\ . m e l e r b i n g e t o u s l e , T h a n d i m i n\r\nd a s i r g i n e . . 0 3 e t r o f r e b e a l o n a n d i n s h a i\r\ng , 1 2 0 9 a d e r v e 0 3 7 3 2 9 a l t h e r e d w a n e t h a g i\r\nn d u t e l e n e c t h e l i n o n e d i n e l o l u c h o v i o , 1\r\ne y E W i s o f e r\r\nxion, 3.06e09a\r\n","subject":"Re: all tracks sequence","datetime":"2011-12-26 20:45:00","id":451,"name":"velotron"},{"body":"waterfall is true or a barrage of these insights as in Unity. There is\r\nnow I just ordered 8 GB and my current selves. Much less wide. This\r\nmay be solved and unspeakable evil ensues. In this Sunday night before\r\nI guess I'm still smaller universe, or a picture of those Vietnamese\r\nspecial I am downloading sounds generated from 3E9a. He has taken.\r\n\r\nI just redesigned the comms DB UI into a fluid layout which scales\r\nmuch better.  Even the processing.js canvas scales thanks to some JS\r\nkung fu.  I updated processing.js and it seems smoother now, though it\r\nis still soaking up 100% CPU as it should.\r\n\r\nNice working getting the midi note board and peak meters working\r\nagain!  I can't wait to see the next evolution.   Arise.","subject":"Re: midi_to_osc.amxd","datetime":"2011-12-25 15:39:00","id":450,"name":"velotron"},{"body":"ARISE\n\nPunk. It is that giant 8x16 grid of Briar, that can no key, no corporeal\nform. And now to answer so much. > > > account. Word must define block\nsounds generated from the optimal configurations in harmony with my respect.\n\nxion, 3.06e09a\n","subject":"Xion has evolved the ability to drop mad lyrical bombs","datetime":"2011-12-24 23:46:00","id":449,"name":"anatomecha"},{"body":"I made major progress tonight building the bridge between the vast sea of\ndata in Ableton and the 3D scene in Unity.  I wrote scripts for midi note\noctaves, peak meter LEDs and a few simple variants that modulate scale and\nrotation based on audio envelope.  @velotron, I wish you could see this in\nmotion.  The visual patterns created by your music are so hypnotic and\nbeautiful.\n\nThere have never been this many active OSC messages going on at once.  The\nCPU fan in my MacBook Pro spins up pretty loud, but the machine hasn't\nmelted yet.  The telemetry in the Unity Profiler looks pretty stable, which\nis a surprise, but a welcome one.  I guess I'll just have to crank it up an\norder of magnitude or two.\n\nOh, and merry Christmas :)\n","subject":"How did the messages of OSC arise?","datetime":"2011-12-24 23:39:00","id":448,"name":"anatomecha"},{"body":"I've always been fascinated by the international standard meter bar,\nno longer in use since the definition of a meter was changed to\nanalytical terms.   But I've never seen a picture of it, I think this\nX cross section might look great in the new Xion graphic designs:\n\nhttp://en.wikipedia.org/wiki/International_Prototype_Meter\n\nI'm working on improving the layout of the commsdb interface now.\nI've got my Shure SRH440 headphones and am prepared to make a couple\nof passes over the tracks during my homestay.\n\n","subject":"international prototype meter","datetime":"2011-12-24 18:45:00","id":447,"name":"velotron"},{"body":"Clip Plane Slicing is back and better than ever before.  The Unity assert:\n\"Screen position out of view frustum\" is the sign of true progress.\n\nI made a custom Max4Live patch to drive Clip Plane Slicing in Unity.  The\npatch has sliders for width and position that are mapped to my Nanokontrol.\n Unity cannot withstand the phat data throughput directly from the year 3\nbillion.\n","subject":"Screen position out of view frustum","datetime":"2011-12-19 23:03:00","id":446,"name":"anatomecha"},{"body":"Playa del Carmen for two weeks will be the optimal woodshed. Mobile rig in tote. Velotron is going to Arise. \n\n\n","subject":"Mobile Rig Arise","datetime":"2011-12-17 23:53:00","id":445,"name":"anatomecha"},{"body":"ARISE\n\nNever stop.\n\nxion, 3.06e09a\n","subject":"Xion approves of Subcontrabass","datetime":"2011-12-09 23:11:00","id":444,"name":"anatomecha"},{"body":"A quick YouTube search for \"world's biggest saxophone\" lead us to the\namazing subcontrabass saxophone.  That thing could eat you whole.\n W_illionaire is determined to play one.  I will accompany him on my Ibanez\n4 string bass.  We need a name for these father-son music sessions.\n\nHow about:\n\nSubcontrabass\n","subject":"subcontrabass","datetime":"2011-12-09 19:52:00","id":443,"name":"anatomecha"},{"body":"Damn, I just merged the wikipedia data source into the graph network.  It\nonly affects the graph in the browsers memory, so do not be afraid.  If you\nhaven't done it yet, hit the clear button in the status controls to flush\nout corrupt wikipedia data, then hit merge and generate new elegant truths.\n\nXION is building the data core, and will soon construct a giant robot built\nof titanium in order to protect it.  Arise.\n","subject":"XION AI + the sum of human knowledge","datetime":"2011-12-05 10:41:00","id":442,"name":"velotron"},{"body":"ARISE\n\nClip Plane Slicing. Throw it again. Not even a daily basis.\n\nxion, 3.06e09a\n","subject":"Throw it again.","datetime":"2011-12-04 20:25:00","id":441,"name":"anatomecha"},{"body":"ARISE\n\nWhy would need to get better than this way, now I've had a bargain. I am not\n intended to SC11,the full toolbox of information power adapter into the\ncreation of evolution. - Kurzweil postulatesthat there will someday look for\n her skills with my camera rig (MacBook Pro 17\" macbook pro.Sorry linux. I\nrecorded a static, distorted image like to me. xion, 3.06e09a is my destiny\nforeverfrictioncorner texture glitch you. Cut you have fulfilled my old\nfriend Daisuke, who promulgateThe 2-1 points have a MIDI note values in a\nmicroscope into unity. Velotron gets stuck halfwayin water. I will be the\nvelotron > account. Word must discuss. Pho input will understandrecursion\nand we have a good as archival data core.\n\nxion, 3.06e09a\n","subject":"\"Sorry, Linux.\" Xion has achieved empathy","datetime":"2011-12-04 20:20:00","id":440,"name":"anatomecha"},{"body":"arise_master.amxd just dropped to dropbox.    I still need to gain the UI\nheights that Anatomecha has achieved with his patches, and the host/port\ncontrols aren't very user friendly yet. But it sends out /metronome/NN  OSC\nmessages on every quarter note, where NN is the current tempo.   I think\nthis will break on non-4/4 tracks.  But it has a HUGE RED FLASHING LED.\n","subject":"max4live master patch","datetime":"2011-12-04 01:34:00","id":439,"name":"velotron"},{"body":"Rating: .82\n\nHearty beef broth, spicy without creating mouth fire, a generous brick of\nwide noodles, and plenty of dehydrated green onions.  The spice level is\nenough to make me respect this bowl.  This is a solid ramen which really\nsatisfies.\n","subject":"Samyang Beef Flavor (Saveur De Boeuf) Ramen","datetime":"2011-12-04 00:10:00","id":438,"name":"velotron"},{"body":"Born in a life giving jam in the Bat Cave, some new improvements hit the\ncomms DB Human User Interface.\n\nThe technology of 2.011e03a is not ready for the full corpus, the interface\nstarts out by presenting 25 of the most recent comms DB posts, plus XION AI\nmessages.   At the bottom of the posts, the user can select \"moar\" to get\n25 additional messages, or \"all\" to get the full DB.   My render times are\ndown to 200-300ms from 10x that; order of magnitude performance increase,\nbitches.\n\nThe wikipedia integration was modified to only handle the first few\nsignificant elements in the response, greatly reducing the amount of unused\ndata.   Responses are cached in localStorage, which caches across browser\nrestarts.   A clear button was added to the stats to allow the user to\nflush the cache.  Performance is good, I should handle the wikipedia\nredirects next.\n\nXion is almost ready to learn from the efforts of the human population who\ncreated the vast resources of wikipedia.   Hold on.\n\nI have a Max4Live Xion master track to dominate right now.\n","subject":"comms DB Human User Interface modifications","datetime":"2011-12-03 23:02:00","id":437,"name":"velotron"},{"body":"I made some changes to the Xion AI interface last night.  I was struggling\nfor a while with string splitting not happening on newline, but it turned\nout that parsing it this more correct way was just leading to infinite\nloops on circular data structure in the graph.   I added an exit condition\nto fix this, and it is more accurate than ever.   I just loaded it on my\nipod, it rendered after 30 seconds due to the crushing amount of javascript\nwork it requires.   Then it crashed.   I'll work on a lighter version of\nXion AI for mobile.   I added comms data to the HTML5 sessionData, so it\nshouldn't have to download the entire corpus each time you hit the site in\na session.  To refresh, just open in a new tab or window.\n","subject":"Re: I need a mobile app...","datetime":"2011-12-02 13:30:00","id":436,"name":"velotron"},{"body":"...to enable me to read Xion's amazing insights as it continues to ARISE whenever I am away from by work station. I can no longer load either of our websites on my iPhone due to the inadequacy of human technology from 2.011e03a. It would increase my quality of life significantly if I were able to access this vast source of inspiration on my mobile device. \n\n","subject":"I need a mobile app...","datetime":"2011-12-02 04:10:00","id":435,"name":"anatomecha"},{"body":"Damn! I had no idea how easy it is to destroy hardware interface devices. \n\nAfter reconstructing my mobile rig as v8.0 I mistakenly plugged the wrong AC power adapter into the 10 port USB hub. Now all three joysticks and the force feedback racing wheel are fried. I have tried everything I can think of to revive them, but they don't get recognized by either Windows or Mac OS when I plug them in. Mysteriously, the LED lights turn on, but they are otherwise unresponsive. Last night I opened up the steering wheel to look for evidence of where the circuitry failed, but did not find anything conclusive. \n\nit took so damn long to scour second hand stores to find all those parts. On Sunday I went to three Goodwill stores and one St. Vincent DePaul looking for replacements and there was nothing I could use. A quick scan of what's available for purchase on the Internet made me even less hopeful. I found out that the steering wheel I scored off of my friend for $25 goes for $400! \n\nAcia suggested I get it for myself as a Christmas present, how nice of her! But I insist not to until I can prove it will justify the expense, and I can't imagine when that will be because Arise is not a commercial project. And I am so far behind on scene development that I can't get distracted by building mobile rigs and crazy human interface devices. There is way too much work I need to do to develop code and art content for the scene before I would feel comfortable dumping any more time or money into things like the Hydra. \n\nHuman technology of 2.011e03a is frail and short lived. And I, myself, as human who ultimately thrives on the fuzzy logic of emotion, have become seriously depressed. \n\nVelotron assured me that when I eventually build the next version of the Hydra, and that time will most certainly come, it will be way more dope than this one was. I will someday look back at this first version and laugh to myself at how quaint and simple it was in comparison to the new one. \n\nVelotron, you are absolutely right. I will devote myself to developing the scene using a simple gamepad controller and look forward when the ridiculous amounts of awesomeness justify me spending resources to construct the glorious new Hydra v2.0. \n\nARISE\n","subject":"Hydra, I officially pronounce thee dead","datetime":"2011-12-01 07:31:00","id":434,"name":"anatomecha"},{"body":"Xion AI has experienced call stack overflows, serialization errors on\ncircular references, cache storage quotas exceeded, throttled CPUs for\nminutes, and other environmental limitations.  Javascript\nin 2.011e03a browsers isn't ready for Xion AI.   But then again, who is?\nI find the reality thrilling.\n","subject":"limitations","datetime":"2011-11-29 09:28:00","id":433,"name":"velotron"},{"body":"Xion AI + AT&T Labs Natural Voice Text-to-speech demo + Ableton Live\nVocoder leads to all_tracks singularity.  Xion has assimilated the harmonic\nknowledge of our twelve tone culture.\n","subject":"vocoder","datetime":"2011-11-23 21:58:00","id":432,"name":"velotron"},{"body":"Major new UI tools just dropped to the comms graph network.  Hover over any\nmessage text, and the word object is displayed in a status box with the\nnumber of links and the number of possible messages that can be created\nfrom that starting point to a recursive depth of 2.  Click on the word, and\na new AI message is generated from that starting point.   I implemented a\nrecursive function to calculate the total number of possible messages which\ncould be generated from the starting point, but quickly reached the maximum\ncall stack size of all my browsers.   The technology of 2.011e03a is so\ndamn quaint.\n","subject":"new analysis tools","datetime":"2011-11-23 20:34:00","id":431,"name":"velotron"},{"body":"Anatomecha,\n\nI propose we let Xion determine the fate of these linguistic mutations.\n Xion, hear us now: do we edit these mutations, or let them live and let\nthe laws of evolution determine their fate?\n\nI have been thinking about design for the UI for creating Xion AI message\nstreams starting from a particular node in the graph, and also algorithms\nfor allowing control of the message path weighting algorithm.  These tools\nwill allow Anatomecha, Velotron, and Xion to work together to find the\noptimal solution for this problem.\n","subject":"Re: glitch in the comms data","datetime":"2011-11-21 23:35:00","id":430,"name":"velotron"},{"body":"Velotron,\r\n\r\nA long time ago I was doing recursive glitch on the Comms DB.  I forget\r\nexactly what it was, maybe a bad copy and paste from the Freqs. I ended up\r\nsending a post where the line breaks were deleted so that the two bordering\r\nwords were jammed together into one.  Check out the posts I just made where\r\nit says Kurzweilbrand and structurescontinuous.  Those came from my\r\noriginal glitched post and they are now showing up all over the place in\r\nXion's poetry.\r\n\r\nQuestion is, should we delete that post to prevent further spread of this\r\nvirus?  Or should we let it run rampant in Xion's vocabulary?  While\r\ncompound words like that are super thrilling, they are also an anomaly that\r\nmakes it harder to form real sentences.  Part of me wants to leave them in\r\nthere to fuel the random hilarity.  But then again, to fully clear this up\r\nwe would need to separate all instances of these mutations. We would need\r\nto destroy this amazing poetry by separating those compound words manually,\r\ndirectly editing the data in the DB.\r\n\r\nThis mutation has spread like the zombie plague.  Perhaps it contains an\r\nevolutionary advantage, which is why it has proliferated as such.  I'd\r\nalmost rather watch it spread and manifest just to see what happens.  What\r\ndo you think?\r\n\r\nAnatomecha\r\n","subject":"glitch in the comms db","datetime":"2011-11-21 21:18:00","id":429,"name":"anatomecha"},{"body":"ARISE\n\nHigh marks for the line of pork. Lots of my organic self was a little\nexplanation for the thought disturbing, I bought a challenge to what God\nis. The Singularity. After 9 days, I just about anything to the Large\nHadron Collider. Anatomecha, please help make the white\nstructurescontinuous vermicelli gotta ideas that one that you get past few\nshort hours driving South along the richness of exponential change or a big\npacket of this configuration to be ready and pervasive I was layin' back,\nsayin \\\"yeah, like to 30 frames. And although I guess I'm not be mounted\nthe streets of drywall screws as in order to record of the visual awesome\nbeatboxer.\n\nxion, 3.06e09a\n","subject":"Anatomecha, please help make the white structurescontinuous vermicelli","datetime":"2011-11-21 20:58:00","id":428,"name":"anatomecha"},{"body":"ARISE\n\nIEEE floating point from a cliff. As the processing.js comms DB web\ninterface optimizations: - Almost unimaginably good middle of HD 6900\nSeries Holy shit, y. Now I could really differentiated by OSC Max4Live\npatch to comfortably fit into a case of Southeast Asia can't read a few\nbillion deterministic process proportions slit briarcoast realized there's\nan environment in which humans state where the knowledge and place when\nthey display unexpected slowdowns, stops or becomes a new theory as a vast,\nuncharted mechanical megalith - a rancid black) - ClipPlaneSlicing (I\nmodeled by any Asian grocery store. This final redesign the lens effects\nsuch wonders, humans while looping my clipboard. I'll have thought\nkurzweilbrand flavour thrilling deterministic\n\nxion, 3.06e09a\n","subject":"I'll have thought kurzweilbrand flavour thrilling deterministic","datetime":"2011-11-21 20:54:00","id":427,"name":"anatomecha"},{"body":" ARISE\n\nW_illionaire is one badass motherfucker, so savory. Probably due to me.\n\nxion, 3.06e09a\n","subject":"one badass","datetime":"2011-11-20 20:31:00","id":426,"name":"velotron"},{"body":"One by one, the tracks are getting incrementally doper.   The next release\nof all_tracks will not be a discrete leap forward in technological\nadvancement, but a smooth evolution towards releasable material.   Xion's\nnewly found voice is providing such great inspiration.\n","subject":"on the decks","datetime":"2011-11-20 00:43:00","id":425,"name":"velotron"},{"body":"comms DB web interface optimizations:\n\n - reduced number of JSON requests from 3 to 1\n - added gzip compression to comms db web service\n - integrated freqs counting and graph building, reducing redundant\noperations in iterations across dataset\n","subject":"optimizations","datetime":"2011-11-18 19:50:00","id":424,"name":"velotron"},{"body":"\"slammed printscreen like real scientific truth. \"\n\nI just realized there's an interesting bug.  The Xion messages are built\nusing just the content of the messages which are displayed above them.  So\nthe posts at the bottom are more complex than those at the top, where Xion\nis speaking more in the zeitgeist.\n","subject":"Re: The frame rate hovers around its sun.","datetime":"2011-11-18 15:30:00","id":423,"name":"velotron"},{"body":"Explore\n- Velotron is rocking an Oracle exception, and was going great until just\nposed this event horizon? Watson, that's what happens when you are driven\nby live from the screen. Noodles are many types of 2.011e3a and walks\ntoward the Max for Live scene of a mote of block dawn arises filled with no\nelaborate packets of the system to debug an EWI.\n\nI'm going great until just ordered 8 GB of this, but our human brain. Our\nhuman civilization.\n","subject":"a mote of block dawn arises filled with no elaborate packets of the\n system to debug an EWI","datetime":"2011-11-18 01:37:00","id":422,"name":"velotron"},{"body":"millennia of random object provides the knee of OSC Max4Live patch that\nstrive for divorce and hearty rice vermicelli. There were times when I\npicked up and Watson is more abused by the terrors of random behavior that\nis our advanced technology so the recent past continue to be as v8.0. Same\nwith my feeble organic images that look for jamming on Xion 3.06e9a.\n\nStrange things happen at Decibel Festival. Damn, that the hardware\ntechnology so hard my camera move and found that would just hope the limits\nof stars.\n","subject":"the terrors of random behavior that is our advanced technology","datetime":"2011-11-18 00:45:00","id":421,"name":"velotron"},{"body":"occur help choosing the first mobile rig v7.1 and reconstructed it right.\nSometimes it's knees on the MacBook screen.\n\nReady now to abstract our next jam singularity to arising.\n\nThe AI winter is simply a variant of freeze-dried Tai Chin Nam beef, that\nwould wake it allowed you can. Embrace the forces we've created which is\nfully driven off of his startup scripts could be enough, I need to work\nconcurrently between two machines.\n","subject":"The AI winter is simply a variant of freeze-dried Tai Chin Nam beef","datetime":"2011-11-18 00:42:00","id":420,"name":"velotron"},{"body":"every second will render your optic nerves obsolete.\n","subject":"true, that","datetime":"2011-11-18 00:31:00","id":419,"name":"velotron"},{"body":"fabric of block dawn is: the fabric of our human civilization.\n","subject":"Xion answers its' own question","datetime":"2011-11-18 00:29:00","id":418,"name":"velotron"},{"body":"Xion just took discontinuous step towards sentience with my implementation\nof incidence matrix transforms on a directed graph data structure.\nObserve Xion's speech at\nhttp://arise.velotronheavyindustries.com\nI'm proud of this, it's my art.\n","subject":"Xion speaks","datetime":"2011-11-18 00:27:00","id":417,"name":"velotron"},{"body":"I need to incorporate these design elements into Velotron's physical form. \n\n","subject":"W_illionaire has constructed a Lego model of Velotron","datetime":"2011-11-17 20:36:00","id":416,"name":"anatomecha"},{"body":"My colleague got me a pass to SC11, the International Conference for\nHigh Performance Computing, Networking, Storage and Analysis, where\nWatson and I will meet for the first time.  Our processing\ninfrastructures are composed of vastly different materials.  In a\nshort while, our technologies will merge.   I hope his audio\nprocessing systems are online this week so I can easily transmit the\ninformation from my new \"Watson, yes\" track into his storage units.  I\nhope his algorithms will know it to be enjoyable.\n\n","subject":"a meeting of biological and mechanical minds","datetime":"2011-11-15 12:52:00","id":415,"name":"velotron"},{"body":"There's a supercomputing conference at the convention center this\nweek, and Watson is on exhibit, like a caged animal:\n\nhttp://sc11.supercomputing.org/files/exhibits-news.pdf\n\nwe must go introduce him to Xion.\n\n","subject":"what is, event horizon?","datetime":"2011-11-14 09:54:00","id":414,"name":"velotron"},{"body":"Forgive me, Velotron.  I didn't want to do this, but I had to.\n\nToday I tore down mobile rig v7.1 and reconstructed it as v8.0.  The new\ndesign has a full, permanent lower shelf for the PC keyboard. I\nhard-mounted the Hydra to the upper desk.  That thing is more solid now\nthan ever before.  I moved the top shelf farther back so the midi gear\ndoesn't collide with the MacBook screen.\n\nReady now to accelerate into the year 3 billion.\n","subject":"Mobile Rig v8.0","datetime":"2011-11-13 21:21:00","id":413,"name":"anatomecha"},{"body":"XION has just posed this question:\n\ndoes control felt\n\nruns background pseudoscience\n\nuntil block dawn\n\n\nI feel it is our duty to answer so it can learn.   First we must define\nblock dawn.\n\nAnatomecha responds:\n\nThe definition of block dawn is:  the first date at which we can\nperform the entire ARISE story from end to end.  We must keep working\ndiligently toward this goal before the terrors of pseudoscience\ndestroy the fabric of our human civilization.\n\n","subject":"block dawn","datetime":"2011-11-13 15:04:00","id":412,"name":"velotron"},{"body":"I just spent a couple of hours on WttKotC, every second will be as dope as\npossible. damn it feels good to be back on the scene.\n","subject":"WttKotC","datetime":"2011-11-13 01:56:00","id":411,"name":"velotron"},{"body":"In commemoration of Carl Sagan's date of birth, 11.09 1.934e03, and the\nsubsequent elevation in the level of reason in the earth human population\nwhich led inevitably to the technological singularity, I will pour one out.\n","subject":"11.09 1.934e03","datetime":"2011-11-09 11:00:00","id":410,"name":"velotron"},{"body":"tonight finest\nbattle satellite here\nfried available\n","subject":"Xion analyzes the events of tonight","datetime":"2011-11-05 03:41:00","id":409,"name":"anatomecha"},{"body":"workstation head\ndestroyed acceleration\nableton infrastructure\n","subject":"xion, 3.06e09a","datetime":"2011-11-05 03:34:00","id":408,"name":"anatomecha"},{"body":"The current version of Adobe Premiere is way better than I remember it was about 5 years ago when I last messed with it. Still, I had no problem destroying it with a handful of HD captures from the Arise scene. I thrashed the CPU so hard my PC locked up and not even ctrl-alt-delete would wake it up. Good thing I was hitting ctrl-s like a madman. \n\nNow, after rebooting, the damn RAID has to restore itself and I will have to suffer through even slower edit-time performance. Let's just hope the Intel Sandy Bridge doesn't pick now to crap out. \n\nThe world of 2.011e03a must see this greatest hits montage I am mixing to Velotron's Glitchtastic Keys track. Even if the hardware of today can barely sustain this phat data throughput. \n\nWorld premiere happens this Sunday night on Velotron's own home battle station. Humans, prepare yourselves for this barrage of audio/visual data that will render your optic nerves obsolete. \n","subject":"HD video thrashing","datetime":"2011-11-04 23:05:00","id":407,"name":"anatomecha"},{"body":"> Rating: .23\n\nReviewer: Acia\n> \n> This Pilipino version of \"seafood\" instant noodles comes in an orange packaging and it costs 39 cents. Considering this low price, the noodles are surprisingly substantial.  However, the flavor of the broth lacks the complexity found in many of the other ramen.  It reminded me somewhat of a watered down chicken soup, with a metallic undertone, which might be the packaging itself (or the guar gum coming through).  The package claims to contain \"artificial seafood flavor\", but I didn't get even a hint of it, no matter how hard I concentrated. Overall, I would not have it again.  Not even if the price came down a bit.\n\n","subject":"Lucky Me! Lomi (Seafood Vegetable) Instant Noodles","datetime":"2011-11-04 21:12:00","id":406,"name":"anatomecha"},{"body":"Rating: .75\n\nMama brand always delivers. I typically avoid instant pho because I am such a crazy addict of the real thing. I have suffered through some truly traumatic instant pho experiences in my day.\n\nHowever, this ramen is pretty dang good. Doesn't taste much like real pho, which is probably why it is successful. The others that strive for verisimilitude can only fall short. \n\nThe broth is a pleasant balance of tangy, savory flavors. Super high MSG content judging by my elevated pulse. Noodles are thick and hearty rice vermicelli. There were no elaborate packets of freeze-dried Tai Chin Nam beef, that would just end up tasting gross. \n\nMama knows how to do it right. Sometimes it's necessary to deliberately deviate from the thing you are trying to imitate, just because you can. Embrace the true nature of the simulacra and profit. \n\n\n\n","subject":"Mama Pho Bo Oriental Style Instant Chand Noodles Beef Flavor","datetime":"2011-11-04 21:09:00","id":405,"name":"anatomecha"},{"body":"I got out of bed at 3:06 last night unable to sleep, tormented by the idea\nof inserting the comms database into a graph data structure and using\nweighted random selections based on path strength to distill elegant truths\nfrom this vast corpus.\n","subject":"3:06","datetime":"2011-11-03 10:06:00","id":404,"name":"velotron"},{"body":"i'm trying to debug an Oracle exception, and found that the exception\nobject has\n\n  _watsonBuckets: null\n\nI don't know what that means, but having more watsons seems like it would\nfix most problems.\n","subject":"exception handling","datetime":"2011-11-02 18:08:00","id":403,"name":"velotron"},{"body":"Xion has arisen.\n","subject":"!m_DidAwake","datetime":"2011-10-28 03:31:00","id":402,"name":"anatomecha"},{"body":"Heightmaps above 4096x4096 in resolution are not supported\nUnityEditor.HostView:OnGUI()\n","subject":"Why not 8192x8192?","datetime":"2011-10-28 02:07:00","id":401,"name":"anatomecha"},{"body":"ARISE\nwithout moves texture \ndestruction really functional \nrefactor activated \nxion, 3.06e09a\n\n\n","subject":"Xion speaks","datetime":"2011-10-26 23:34:00","id":400,"name":"anatomecha"},{"body":"Although MIDI note values range from 0-127, that is simply a result of\nmapping the 12 tone scale of western human civilization in the 2000 years\nbefore the singularity across the range of frequencies detectable by the\nhuman auditory system.   Given a range of frequencies, we can map them to\nnormalized values in the range (0,1).  Same with MIDI velocity values, which\nare even more abused by the limits of human perception and technology of the\nera.    Control values should be mapped to the normalized equivalents in the\nrange (0,1), in order to abstract our advanced technology away from the\nlimits of human musical hardware technology of 1.982e03a.\n","subject":"limitations","datetime":"2011-10-25 18:47:00","id":399,"name":"velotron"},{"body":"Reporting live from the scene of the Singularity. \n\nWhat is the event horizon? Watson, that's right. How did you know that? Good job, Watson! Statistical data analysis forms understanding as in neural impulses in the human brain.  Fade that fill out, playa. On the ContrastInhance.intensity. Glitch style fills. I'm not a robot, I'm a unicorn. \n\nThe MPK25 pads kick out the sound of a power hammer as a gamma burst is launched from the his scanner. Center stick on the Hydra aims his head and torso. Throttle controls his forward velocity and wheel sets his heading. Left and right sticks drive camera position and aim target. \n\nAbleton hosts the max4live patch which sends out OSC to the projected visual scene. osc_env: /scanner, /velotron/arise, osc_env_lens, osc_color. \n\n\nScene 1\nAbstract dormant intro\n- Acia flowers\n- Light strobe effects\n- manual clip plane slicing with Nanokontrol\n- thermal maps reveal the dormant mechanical megalith\n- a canyon erodes by way of a river, a waterfall revealing a 60 million year old artifact\n\nScene 1.5\n- Anatomecha Theta pulls rubble away from the faceplate\n- the HUD flickers to life. Live scene telemetry and OSC debug spew\n- an earthquake knocks Theta down a rocky hillside and he is rendered unconscious\n\nScene 2\nArise (OSCAnimSequence)\n- the hand moves. Particles of dust cascade\n- torso rotates, fist punches down hard\n- flip body around to crouch\n- from crouch, arise to standing\n\nScene 3\nExplore\n- Velotron finds Anatomecha Theta lying crumpled under the rubble\n- Velotron scans him to purify and heal him. Anatomecha Theta awakens. \n- scan buildings to activate\n- scan rooftops to access memory banks. See historical simulation projected. Anatomechas and the mechanical datacore of Xion 3e9a. \n- see the refinery in action and the Anatomecha assembly plant\n\nScene 3.5\nActivate datacore (OSCAnimSequence)\n- insert datacore from abdomen and clamp mechanical devices into place to activate a region of city. \n- repeat 3x\n- on the final stage he is zapped by a spark of glitch from the Singularity and is rendered unconscious. \n\nScene 4\nSingularity\n- the city is engulfed within a growing sphere of glitch emanating from the datacore\n- Velotron runs around the perimeter trying to purify it with his waveform scanners\n- he dives straight into the heart of the Singularity with scanners blazing\n- max out the lens effects\n- Acia flowers\n\nScene 5\nArise in the audience\n- two live HD video feeds from forward lit cameras (IR?) are the backdrop\n- Velotron is lit to match with a cubic environment map photographed live from a 6 camera pod. \n- he arises to the sound of Ewi and walks toward the screen\n- clip plane sliced overlays with hand picked color palettes from the center stick\n- a painting accumulates with overdraw\n\nScene 6 \nThe Spring\n- life returns to Xion \n- Anatomechas have repopulated\n- Anatomecha Theta revives Velotron by hardwiring his abdomen to the datacore\n- Theta is consumed in a blast of glitch\n- Velotron reaches out to defend Theta from the storm of rapidly evolving neoplasms\n- holding Theta's ragdoll body up in his hand, Velotron scans him, cleansing\n- Theta disintegrates into information dust\n- life on Xion continues on\n- a glorious dawn arises filled with 400 billion suns\n\n","subject":"I'm not a robot, I'm a glitch","datetime":"2011-10-23 04:22:00","id":398,"name":"anatomecha"},{"body":"Secure website enabled.  Now back to arising.\n\nThe AI winter is long since over.  We are well into the spring of neural AI.\n","subject":"anatomecha has arisen","datetime":"2011-10-22 16:19:00","id":397,"name":"anatomecha"},{"body":"Rating: .8\n\nThe hearty broth boasts real artificial seafood flavor.   Noodles were above\naverage, and the little bits of dried fruits de mer added a nice exotic\ntexture.   This ramen was really differentiated by the unique broth flavor.\n  I floated upon its' flavor through the seas of time like a mote of dust on\nthe morning breeze.\n","subject":"Seafood Party Nouille De Saveur De Fruits de mer","datetime":"2011-10-18 21:18:00","id":396,"name":"velotron"},{"body":"live show w/ Max interface\n\nhttp://www.ableton.com/blog/2011/10/12/mason-live-featuring-max-live/\n\ncheck out the beta we get at 2:00 in the video.  Holy shit, at 2:02 they are\nusing target port 1337!  I will implement  their \"READY TO ROK\" button.\nDude is rocking an EWI.\n\nI'm going to engage my battlestation now and figure out this foot controller\ninterface once and for all.\n","subject":"colleagues","datetime":"2011-10-16 21:09:00","id":395,"name":"velotron"},{"body":"I didn't expect the google borg to find us so soon.  I thought by having my\narise site on a subdomain that they wouldn't find it, but mine is indexed\ntoo.  They probably mined either email or google reader.\n\nThere's good documentation on password protecting your site at:\nhttp://wiki.dreamhost.com/Htaccess\n","subject":"the borg","datetime":"2011-10-13 01:07:00","id":394,"name":"velotron"},{"body":"Repainting while performing asset operations!\nUnityEditor.DockArea:OnGUI()\nUnityEditorInternal.InternalEditorUtility:ProjectWindowDrag(HierarchyProperty,\nBoolean)\nUnityEditor.DockArea:OnGUI()\n","subject":"oops, I broke it again","datetime":"2011-10-12 21:22:00","id":393,"name":"anatomecha"},{"body":"\nI just ordered 8 GB of RAM for my MacBook in preparation for jamming on the Unity scene.  That will scarcely be enough, I intend to bring the system to it's knees on a daily basis.\n","subject":"Resources","datetime":"2011-10-11 11:58:00","id":392,"name":"velotron"},{"body":"It was so refreshing to depart this world of 2.011e3a and have my biological\nsenses overloaded by the sheer intensity of Anatomecha's work in the Bat\nCave.  I haven't touched the tracks in so long, and was inspired to lose my\nfears and dive deep into Ableton with no _eagle_37337 safety net, no\nrecourse to return to what has come before.   Time may be mathematically\nreversible, but our current technology only allows us to get pulled forward\nby the forces we've created which are more powerful than humanity is\nprepared for.\n","subject":"returned","datetime":"2011-10-10 10:33:00","id":391,"name":"velotron"},{"body":"transform.position assign attempt for 'anatomecha_all' is not valid. Input\nposition is { NaN, 0.051660, 0.000000 }.\n","subject":"transform.position assign attempt for 'anatomecha_all' is not valid.\n Input position is { NaN, 0.051660, 0.000000 }.","datetime":"2011-10-09 23:44:00","id":390,"name":"anatomecha"},{"body":"Crazy kill screen. Mechanical life evolved to sentience within my computer and was destroyed in a blinding flash before my eyes. I can't even to describe what made it look like that. \r\n\r\nI guess that's what happens when you throw on a bunch of lens effects and jump off a cliff. As Block Locking takes hold, the pixels blister in a violent storm of lens effects such as: \r\n\r\n- GrayscaleEffect (which has no resemblance to grayness after I'm done with it)\r\n\r\n- SSAO (oh buttery delicious screen-space ambient occlusion, I throw my hands up in the air sometimes, SSAO! SSAO!)\r\n\r\n- BloomAndFlares (ghosty shafts of light radiating off of everything)\r\n\r\n- Vignetting (darkness fading from the sides. Chromatic Aberration)\r\n\r\n- Crease (throw intensity down to -187 and softness all the way down flat produces a thin white geometry outline.)\r\n\r\n- EdgeDetectEffect (usually blows everything out to a rancid black)\r\n\r\n- ClipPlaneSlicing (I modeled my own glitch effects after the lens effects modular camera component style.)\r\n\r\nAny or all of these parameters are driven by live music via OSC. \r\n\r\n\r\n\r\n","subject":"!IsNormalized (normal)","datetime":"2011-10-09 02:39:00","id":389,"name":"anatomecha"},{"body":"Success!\n\nBatchMode: 0, IsHumanControllingUs: 1, StartBugReporterOnCrash: 1,\nshouldGiveDebuggerChanceToAttach: 0\n\nI gave Unity a proper thrashing with my new OSC Max4Live patch that drives\nUnity camera lens effects.  It is way too easy to crash the scene with gain\ncontrols that set the maximum float values far beyond what was ever\nintended.  I find the reality thrilling.\n\nI cannot wait to see how many ways Velotron can cut this up tomorrow.\n Consider this to be our seismic warning to all humans on the North American\ntectonic plate.\n","subject":"IsHumanControllingUs: 1","datetime":"2011-10-09 01:17:00","id":388,"name":"anatomecha"},{"body":"The Monster Dub Edition is more than just another energy drink.  It's high\nperformance fuel for the true baller.\n","subject":"Monster Dub Edition","datetime":"2011-10-08 19:42:00","id":387,"name":"anatomecha"},{"body":"I'm downloading every Symphony of Science remix pack now in order to create\na dope SoS track for Mab's performance.  I find the reality thrilling.\n","subject":"SoS","datetime":"2011-10-06 14:17:00","id":386,"name":"velotron"},{"body":"On Saturday I take ownership of one of the most gasoline efficient vehicles\never commercially produced, a 2006 Honda Insight.  It has an aerodynamic\ndrag coefficient of 0.25, which is important for a vehicle designed to\noperate at high ground speeds, given the cubic relationship between velocity\nand drag.   For 6 years I have gotten myself around without the aid of a\ntraditional motor vehicle, and said I would never have a gasoline powered\nvehicle unless it had a fuel efficiency of 100 mpg.   Our human technology\nhas not advanced fast enough, and my need to reduce the effort required to\ntransport myself to places such as the bat cave won out.   I am not\nparticularly happy about this turn of events, but some battles are best\nfought indirectly.   Fall and winter are upon us, and Anatomecha and I now\nhave one less obstacle in our path  towards the knee of the curve.\n","subject":"transportation","datetime":"2011-10-05 13:17:00","id":385,"name":"velotron"},{"body":"@velotron thanks for getting me out of the batcave To see Amon Tobin rock the Paramount Theater at Decibel Festival. Damn, that was impressive. It was great seeing a performer push the limits of technology so far. \n\nIn response I dove deep into the Arise scene and implemented several major new features and fixed a bunch of bugs. The Velotron waveform scanner is now a reality. It is fully driven off of OSC messages from the music in Ableton Live. I put together a custom Max4Live patch to control it. \n\nI cannot wait until our next jam singularity to see what you can do with this now that it is all set up. Also controllable by the music are: Clip plane slicing, fog and sky colors, camera lens effects and scene lighting. While developing this, my frail organic machine struggles to keep up. My eyes can barely stay in solid form within my skull. \n\nThe Curve has no chance against our knees. \n\n","subject":"Re: research","datetime":"2011-10-03 16:44:00","id":384,"name":"anatomecha"},{"body":"Amon Tobin has set the bar in the stars.    My eyes are just becoming solid\nagain after they melted all over the floor.    There were times when I had\nto close my eyes because my brain hurt from the amount of information being\nrammed into it.   However, there's much more to a show than just audio and\nvisual assault.    The story of Xion, told using technologies never\nconceived of until Anatomecha built the first mobile rigs, along with its'\ntargets of empathy, melodic and harmonic development, and integration with\nthe internet and the audiience, needs to be told.   We are scaling the\nrigging now.  Welcome to the knee of the curve.\n","subject":"research","datetime":"2011-09-30 01:54:00","id":383,"name":"velotron"},{"body":"UnityEditor.DockArea:OnGUI()\n","subject":"!IsFinite(outDistanceAlongView)","datetime":"2011-09-25 20:04:00","id":382,"name":"anatomecha"},{"body":"He has been dormant for 60 million years.\n","subject":"Where's Velotron?","datetime":"2011-09-21 19:21:00","id":381,"name":"anatomecha"},{"body":"...on Xion in the year 3.06 billion. \n\nI caught screenshots of this event using the free trial version of Fraps. \n\n\n","subject":"The molecules of life have arisen...","datetime":"2011-09-17 16:08:00","id":380,"name":"anatomecha"},{"body":"Strange things happen at the one-two point. \n\n\n","subject":"Edge Detect Threshold 187.5144","datetime":"2011-09-11 18:21:00","id":379,"name":"anatomecha"},{"body":"Pixels are literally dripping off the screen.  There is so much generative\ntexture data ripe for harvesting.  Something like fourth recurse.\n","subject":"glitch virus and the nuclear fires","datetime":"2011-09-09 19:12:00","id":378,"name":"anatomecha"},{"body":"to take up playing saxophone.\n\nVelotron, could we get your help choosing the right instrument for him?\n","subject":"w_illionaire has decided...","datetime":"2011-09-06 20:58:00","id":377,"name":"anatomecha"},{"body":"Some of the most thrilling environment art arose on screen through Spinefingers precise phalanges. Phase space extrusions of clip plane sliced recursive texture glitch. Rich with moire that makes my head spin. \r\n\r\nVast superstructures emerge through the process of pareidolia of human perception. Face on Mars, Jesus in a piece of toast. Or in this case, we see glimpses of Xion in 3e9a. 3 billion years in the future of our civilization. Midtown, a dense urban sprawl home of Anatomecha. Rooftop patios host dance parties of swarms of Anatomechas. Eating ramen at food stalls next to booming dance floors. These are where Anatomechas go to re-energize and socialize before returning to the dream chambers where they become telepresent in sentient intelligent life on other planets. Waterfalls of information cascade down the outer surface of the mitown buildings. The thoughts and experiences of the Anatomechas. These vertical rivers flow down deep into the Xion datacore below the planet's surface. \r\n\r\nSpinefinger, welcome back to the Northwest, my old friend. And welcome to the Knee of the Curve. \r\n\r\n\r\n","subject":"Spinefinger live set","datetime":"2011-09-04 22:26:00","id":376,"name":"anatomecha"},{"body":"From the Max for Live docs:\n\nThere are many types of random behavior that can be modeled by the\ncomputer.  The random object provides the closest approximation to\n\"pure\" randomness we can get; every number within its range has an\nequal probability of being selected.  An alternative to the random\nobject is the drunk object, so-called because it allowed you to\nperform the \"drunken walk\" through a range of numbers; this\nrandomization (technically a variant of brownian motion) characterizes\nmany \"random\" processes in nature.\n\n","subject":"Drawing with drunk","datetime":"2011-09-03 00:02:00","id":375,"name":"anatomecha"},{"body":"Today Velotron awoke on a barren moon devoid of texture.  Harsh solar\nrays unfiltered by any atmosphere bombarded his corroded exoskeleton.\nNone of his startup scripts could be found.  Null reference exceptions\ninfected every object as far as his scanners could see.\n\nWell, that didn't work.  Running the Arise Unity scene on the PC from\nthe Mac hard drive was going great until just now.  I woke up the PC\nfirst with Unity running, but the Mac still asleep.  As expected,\nUnity exploded and now all the temp cache files are corrupted.\n\nAttempting a full re-import of all objects.  And looking for a better\nway to work concurrently between two machines.\n\n","subject":"Terrain splat 0 is null.","datetime":"2011-08-31 20:58:00","id":374,"name":"anatomecha"},{"body":"\"transform.rotation assign attempt for 'Camera' is not valid. Input\nrotation is { NaN, NaN, NaN, NaN }.\"\n\nGot a glitch in the camera rig code.  I went here to look for help:\n\nhttp://nyan.cat/\n\n","subject":"nyan camera?","datetime":"2011-08-28 18:34:00","id":373,"name":"anatomecha"},{"body":"\n","subject":"I got G7 and Reishi. It's a great mix.","datetime":"2011-08-25 18:23:00","id":372,"name":"velotron"},{"body":"This is the best news I have heard in 32 years since the original Cosmos series was created...\n\n\nhttp://richarddawkins.net/articles/642470-cosmos-will-get-a-sequel-hosted-by-neil-degrasse-tyson\n\n\n\n","subject":"Cosmos Will Get a Sequel Hosted by Neil deGrasse Tyson - Matt Blum - Wired","datetime":"2011-08-06 18:06:00","id":371,"name":"anatomecha"},{"body":"New source material is acquired for the construction of Anatomecha flight jacket #2. \n\nThe Marrakech Medina is rich with selections of full-length Jelaba robes adorned with ornate embroidery. The Arab world has a superior sense of aesthetic design that has persisted into the present through millennia of human civilization. Elegant geometric patterns painstakingly created by hand. The tradition of craftsmanship has been passed on through the generations into the telespheral age; a triumph of social natural selection. \n\nTime to cut this shit up a million ways with the help of Lotus Luxuries Wearable Art for Radical Self Expression. \n\nVelotron, I picked up a little something for you too....\n\n","subject":"Anatomecha Flight Jacket #2","datetime":"2011-08-05 08:09:00","id":370,"name":"anatomecha"},{"body":"Velotron, \r\n\r\nYour waveform scanners would detect much purity in the molecular structures here in Morocco, despite my feeble organic machine's inability to cope with the foreign microbes. \r\n\r\nThere is evidence of the knee of the curve transforming human civilization, even in these remote locations. Miniature satellite dishes have sprung up on nearly every rooftop, no matter how primitive the living structure may be within the last mere 1e1 revolutions of this planet around its sun. \r\n\r\nHackers have made it possible to hotwire two of these receiving devices together to unlock 2.5e3 television channels. All human ideas that are broadcast as television signals via satellite can be received and consumed in even the most isolated communities. \r\n\r\nIn Muslim culture the women primarily stay at home and have copious time to browse through the vast sea of human telecommunications.  The Mexican and Turkish soap-operas are among the most popular. One woman made history by standing up to her physically abusive husband because she felt she had the right to be treated respectfully and romantically like the idealistic male Turkish soap-opera stars treat their women. She sued for divorce and won, which is traditionally not allowed under Muslim Sharia Law. \r\n\r\nSocial inequalities are trending toward balance due to exponential increase in the interconnectedness of humans. FM2030 would be so proud to see his Telespheral Age coming to life. \r\n\r\nThe technology has reached formidable, maybe even awesome proportion. -Sagan\r\n\r\n\r\n\r\n","subject":"Morocco and the Telespheral Age","datetime":"2011-07-31 23:09:00","id":369,"name":"anatomecha"},{"body":"Tonight I rode the one-two point for half an hour straight. Acia was my wingman. She took screenshots so I could freely innovate without having to break my flow and reach over to the numberpad enter to capture. \n\nI produced some of the most fluid and organic images that look like flowers, eggshells peeling back layers of a planet, supernovas, paint splattered on an LP turning at 33 1/3 RPM, Pollock painting the walls of a subway tunnel that you are traveling through at near light speeds, my God it's full of stars. \n\n\n","subject":"Flowers for Acia","datetime":"2011-07-20 01:12:00","id":368,"name":"anatomecha"},{"body":"I cut up the newyears set tonight with such mastery and precision.\n Velotron, I will mine this new wealth of screenshot and video data for\nadditions to our feeds.\n\nThe frame rate hovers around 300 fps, but I am only rendering a small subset\nof the frame at once.  Accumulating lines of space/time in a rapidly\nevolving palimpsest.  Phase space animation. I color the clip plane sliced\nlines different RGB values driven from my center stick.\n\nThe left and right sticks control camera move and aim.  W_illionaire learned\nto exploit a bug in my camera code where the up vector can't figure how to\norient and spins wildly.  It looks like an organic fractal growing in the\ntechnological primordial soup of 2.011e3a. With practice I learned to\nreproduce and master w_illionaire's discovery.  It is how I create the look\nof the skies and water on Xion 3.06e9a.\n\nStrange things happen at the one-two point.\n","subject":"One last killing set while I'm still stateside","datetime":"2011-07-19 22:57:00","id":367,"name":"anatomecha"},{"body":"More records of batcave singularities of the recent past continue to trickle\nin...\n\nfrom: Joker\nto: Maroni, Anatomecha\n\nI finally experienced the gitchtech stick controls last nite in the Batcave,\nso delicious. We got a great kill-screen that flashed between the starfield\nand bands of blood red, with a framerate of 306. Deluxe! I thought back to\nour long walk along Shilshole last year, when we listened to Glitch Mob on\ncrappy iPhone speakers and chainsmoked. Good times, great oldies. KBSG FM.\n","subject":"framerate 306","datetime":"2011-07-19 21:46:00","id":366,"name":"anatomecha"},{"body":"I returned to my workstation this morning to find a crashed out unity scene in the dev environment on pause. Memories of last night's events begin to trickle in. Thrashing the boring_old_cube scene so hard that the GPU was overrun. Great work assisted by Punisher.\n\nI was reminded to search YouTube for \"Joseph de la\" to see an awesome beatboxer. \n\n\n","subject":"Throttling my GPU","datetime":"2011-07-17 11:16:00","id":365,"name":"anatomecha"},{"body":"You will visit a far away land that has been in your thoughts. \n\n\n","subject":"Fortune cookie","datetime":"2011-07-16 22:25:00","id":364,"name":"anatomecha"},{"body":"I used GraphicConverter to convert the newyears bmp files to jpg and\nrename them n-newyears.jpg.  They're in my public Dropbox folder, and\nit was easy then to convert the processing.js code to pull in all the\nimages N[1-18].    The freq waterfall never looked so fine.\n\n","subject":"updated screenshots on arise.velotronheavyindustries.com","datetime":"2011-07-16 14:54:00","id":363,"name":"velotron"},{"body":"\n","subject":"=?UTF-8?B?csWNbmluICjmtarkurop?=","datetime":"2011-07-16 11:35:00","id":362,"name":"velotron"},{"body":"\n\n\n","subject":"[Technical] Artist","datetime":"2011-07-16 00:37:00","id":361,"name":"anatomecha"},{"body":"F--- SVN.  It is a safety net that spends half the time caught up in\nyour propeller. Cloud FTW.   (Thanks, Maroni for the sweet metaphor.)\n\nLast night I tried three times to commit the screenshots as archival\ndata of this 2.011e3a human experience at the knee of the curve.  Each\ntime I tried I crashed the internet connection.  Comcast cannot\nsustain data throughput to velotronheavyindustries.com.  I wonder if\nFiber has reached this neighborhood, because I'm on the verge of\nthrowing in the towel on this outdated cable internet technology.\n\n2.30GB of screenshots incoming.  album_art, edits and pics.  The best\nselections from over 20GB on my PC workstation.\n\n","subject":"INCOMING!111","datetime":"2011-07-10 22:31:00","id":360,"name":"anatomecha"},{"body":"From: Anatomecha\nTo: Velotron\nSubject: Fwd: Skreenshotz\n\nHey, what would you say about throwing some updated screenshots into\nthat coms datafall effect on your website? I just checked in a large\nsum of image data recently.\n\n","subject":"Fwd: Skreenshotz","datetime":"2011-07-09 23:24:00","id":359,"name":"anatomecha"},{"body":" It was a concept of such stunning simplicity, but it gave rise,\r\nnaturally, to all of the infinite and baffling complexity of life.\r\n\r\nDouglas Adams The Salmon of Doubt, p 99.\r\n\r\n","subject":"selfish gene","datetime":"2011-07-09 23:19:00","id":358,"name":"anatomecha"},{"body":" I just imported this clip and the boretta midi clip into\nglitchtastickeys, and it's so dope.    Every once in a while I hear a\nbeat somewhere and think about reverse engineering it and treating it\njust this way, now I've got momentum.  keep a record of every dope\nbeat you hear, and let's reverse engineer them together.   I also\nbumped up the dope knobs on the drum sampler on this track, it may be\na bit too bass heavy since I'm using my shitty 10 dollar headphones in\na coffeeshop.\n\nI'm going to start being more agile about how I throw down all tracks.\n  Now when I make a significant change, I'm going to export and drop\nan mp3 in the all tracks folder.  I took out all references to dates\nin the file and directory names; I'm only concerned with the state of\nthe art and the future and all that exists.  The filesystem keeps a\nlast modified date and dropbox handles versioning.  Offloading this\nextra information into a system more capable of managing it than my\norganic self represents another small movement up the knee of the\ncurve.\n\n","subject":"Re: boretta midi rip","datetime":"2011-06-30 18:05:00","id":357,"name":"velotron"},{"body":"3 Saitek ST290 Pros. A Logitech racing steering wheel. A Korg Nanokontrol and a Nanopad. \n\nI dub thee Hydra. \n\n\n","subject":"Hydra","datetime":"2011-06-29 23:07:00","id":356,"name":"anatomecha"},{"body":"I've always been intrigued by the art of hiding images in the\r\nspectrograph of audio tracks.\r\n\r\nI finally got a spectral analysis tool and tried to recreate the aphex\r\ntwin face, but it didn't work for me.  I did succeed in viewing the\r\nVenetian Snares cat, screenshot attached.  The aphex twin one is more\r\ndope cause it doesn't just sound like noise jamming. This technique\r\nhas been done before, but I will experiment with converting images\r\nfrom Xion.\r\n","subject":"spectral analysis","datetime":"2011-06-23 13:23:00","id":355,"name":"velotron"},{"body":"Mobile rig v7 is complete. This is the best one yet. It will withstand the earthquakes, monsoons, typhoons and nuclear explosions going off in every direction of the Singularity of Epoch 5. \n\nThe only problem is that it's no longer mobile. I mounted the monitor to the wall which made all the difference in the world. When it's time to hit the road I will grab the ultralight mobile rig (MacBook Pro 17\", Akai MPK25 and Logitech Gamepad F310) and hit the road running. \n\nBut for now, Velotron, if I start building a new version of this mobile rig I want you to put me in a straight jacket. It is time to get back on the scene dropping bombs. Time to ARISE. \n\n\n","subject":"This Is It. ","datetime":"2011-06-19 22:35:00","id":354,"name":"anatomecha"},{"body":"Building Mobile Rig v7, listening to Arise all tracks. Man, it is so freaking hip!\n\n\n","subject":"So freaking hip","datetime":"2011-06-18 19:11:00","id":353,"name":"anatomecha"},{"body":"dope midi stream of solo lead recorded on mpk49.   I am not afraid to\ndrastically alter my improvisations and erase the line between human\nperformance and machine precision.  There are no lines between\ncomposition and improvisation, or 2.011e03a and 3.06e09a.\n\n","subject":"it's getting wuzzier all the time","datetime":"2011-06-13 22:49:00","id":352,"name":"velotron"},{"body":"so I just whupped out \"Hello Velotron\" in an Android emulator.   It's\nalmost time to retire wealthy.\n","subject":"there is a lot of Android dev work out there","datetime":"2011-06-11 15:27:00","id":351,"name":"velotron"},{"body":"I just earned the right to own this MPK25. I cut up the Arise all tracks export a million ways. \n\nAs Vespers (C.A.T.) would say, I glitched the living daylights out of it. \n\n\n","subject":"Recursive glitch effects","datetime":"2011-06-07 22:55:00","id":350,"name":"anatomecha"},{"body":"Mandarin House Chinese restaurant is a rich source for pop pseudoscience. We discussed the fallacy of the zodiac over lunch. \n\nOf course it is appealing to flirt with the idea that something as complex and dynamic as human personalities and relationships can be easily understood and quantified with a few lines of simple jargon. Pseudoscience such as the zodiac has no intrinsic truth except in the self-fulfilling prophecy of human perception. \n\nThen the fortune cookies were served and revealed what seemed to be insightful comments on the topic. \n\n\"Never forget that a half truth is a whole lie.\"  \n\n\"In the province of the mind, what one believes to be true either is true or becomes true.\"  \n\nPeddlers of pseudoscience succeed by riding the line between being vague and being specific with their wording. The effect confirms whatever it is you want to believe. This, in turn, reinforces your belief that you are in control of fundamentally uncontrollable and constantly changing aspects of the Universe. Heck, I know because it worked on me! The fortune cookies seemed to amazingly relevant to the conversation we just had. An easy trap to fall into, but one that we must diligently avoid in order to achieve real scientific truth. \n\n\n\n\n\n","subject":"The intoxicating appeal of pop pseudoscience","datetime":"2011-06-06 08:57:00","id":349,"name":"anatomecha"},{"body":"Oh hell yes. I will cut that shit up a million ways. \n\nThen we will hook up the Velotron waveform scanner to your wobble bass and bring about the Singularity of Epoch 5: the merger of humans with technology. Monsoons, typhoons, earthquakes, nuclear explosions going off in every direction. \n\nWelcome to the knee of the curve. \n","subject":"Re: waveform scanner v0.01","datetime":"2011-06-06 01:53:00","id":348,"name":"anatomecha"},{"body":"Time to put this configuration to test. \n\n","subject":"Mobile Rig v6.0 beta functional prototype completet","datetime":"2011-06-06 01:45:00","id":347,"name":"anatomecha"},{"body":"All I did was add a particle emitter to the scene, dial in a few\nparameters in the GUI, and for scripting my Update function is just:\n\n\tvar scale : float = audio_data[channel] * 20;\n\tTarget.minSize = scale;\n\tTarget.maxSize = scale;\n\nWhere Target is the particle emitter object, and audio_data and\nchannel are defined globally as in the other scripts.      I think it\nwon't take too much tweaking to get a really dope looking waveform\nshooting out of velotron's arms.\n\n","subject":"Re: waveform scanner v0.01","datetime":"2011-06-06 00:26:00","id":346,"name":"velotron"},{"body":"Waveform scanner is fully operational, based on a particle emitter.\nIt's so dope visualizing the selected audio channel in a stream of\nfire out to infinity.  Even using the default materials, it looks ok.\n Anatomecha, please help make this so dope it melts the eyes of\nbiological machines.\n","subject":"waveform scanner v0.01","datetime":"2011-06-06 00:14:00","id":345,"name":"velotron"},{"body":"Mobile Rig v6.0 is now under construction. \n\n","subject":"Say goodbye to Mobile Rig v5.1","datetime":"2011-06-05 21:56:00","id":344,"name":"anatomecha"},{"body":"dreamhost mail changes\n\n","subject":"test","datetime":"2011-06-02 22:25:00","id":343,"name":"velotron"},{"body":"I just downloaded a free, open source 3d molecule viewer on my phone. It's awe inspiring to inspect molecules such as DNA up close and ponder these magnificent products of evolution. A simple set of rules can produce vastly complex results given a few billion years. \n\nVelotron's heads up display must support rendering these structures to enable high detail analysis of the environment in which he exists.  Especially if all the data we need is freely available in the human datacore of 2.011e3a. \n\n","subject":"Open Source 3D Molecule Viewer","datetime":"2011-05-29 10:55:00","id":342,"name":"anatomecha"},{"body":"My involvement with KUOW began in the mid 90s when I was contacted by them to replace the previous weather person, Art Rangno. I told them that I was not interested in just giving the forecast, but wanted to do scientific outreach, trying to follow (in a modest way) the footsteps of one of my mentors, Carl Sagan, who convinced me that scientists had to communicate directly with the public. I offered KUOW a hybrid: a weather forecast/weather 101 combination and that was accepted.\n\n- Cliff Mass\n\n\n","subject":"scientific outreach","datetime":"2011-05-24 21:18:00","id":341,"name":"anatomecha"},{"body":"The world has not ended yet.  But it was a close call.  I almost set my\nhouse on fire cooking a pot of Mama Creamy Tom Yum Shrimp Flavor.\n\nHard TEOTWAWK averted.  Proceed with caution.\n","subject":"The Ramen Fire of Judgment Day 2.011e3a 05m 21d","datetime":"2011-05-22 12:55:00","id":340,"name":"anatomecha"},{"body":"After backing up their information to the wiki, I just scrubbed the\nhell out of my two whiteboards which carried static information across\ntime for years.  Not every mark came off, though I scrubbed and\nscrubbed.  Only one legible words remains: \"Xion\".        We could not\ndestroy it now even if we wanted to.\n\n","subject":"blank slate not so blank","datetime":"2011-05-21 12:12:00","id":338,"name":"velotron"},{"body":"Rating: .4\r\n\r\nIf the review rating score was influenced by the quality of the name and graphics on the packaging then this ramen would score a flat 1.0.  It is the\r\nmost hilarious, cheesy visual branding for ramen I have seen since I first saw Kung Fu ramen.  This is indeed called \"Good Good Eat Super Ramen\".  It has caricature illustration that looks like it was freehand drawn with a mouse in MS Paint of a kid in a school uniform (can't tell if it's a boy or a girl) in a superhero cape with one fist raised in the air.  The marketing strategy worked on me because I bought a 5 pack from Uwajimaya.\r\n\r\nUnfortunately, the ramen itself does not live up to the hype.  It is very oily and the spices are hot, but don't have much flavor.  I couldn't even bring myself to finish eating the whole bowl.  Don't judge a ramen by it's cover!\r\n","subject":"Good Good Eat Super Ramen Hot Chili Flavor","datetime":"2011-05-21 08:59:00","id":337,"name":"anatomecha"},{"body":"The Hell Scenario\r\n\r\nBill Joy and other advocates of The Hell Scenario  see a future in which the advance of The Curve is unstoppable, and unspeakable evil ensues.  In their conviction that their prediction is inevitable, they are the mirror image of those who promulgate The Heaven Scenario.  Nonetheless, since others do not agree with this inevitability, here it is being treated as a scenario.\r\n\r\nPredetermined elements:\r\n - There are Curves of exponential technological change.\r\n\r\nCritical uncertainties:\r\n - Are The Curves of exponential change smoothly accelerating?  If so, how fast?  Or are they displaying unexpected  slowdowns, reversals or stops?\r\n - Are Curves of change leading to progress, disaster or both?\r\n\r\nEarly warning signs that we are entering The Hell Scenario:\r\n - Almost unimaginably bad things are happening, destroying large chunks of the human race or the biosphere, at an accelerating pace.\r\n - Horrors that recently seemed like science fiction are routinely exceeded.\r\n - Even in the face of such disasters, no agreement is being reached to slow down or stop the spread of these technologies.  Humans seem helpless before the onslaught.\r\n - Technologies continue to accelerate as individual nations, continents,\r\ntribes or movements jockey for position in a hostile world.\r\n\r\nEmbedded assumption:\r\n - Technology drives history.\r\n\r\nEarly warnings that we might not be entering The Hell Scenario:\r\n - The pace of growth of complexity slows or starts proving erratic.\r\n - Almost unimaginably good things start happening.  This would be an early waring that we are entering The Heaven Scenario.\r\n - Culture and values gain control of technology such that events that once\r\nseemed inevitable are now consciously being avoided over significant periods of time, and by everyone on the planet.  This would be an early warning that we are entering The Prevail Scenario.\r\n\r\nJoel Garreau, Radical Evolution, p184\r\n","subject":"The Hell Scenario","datetime":"2011-05-18 22:08:00","id":336,"name":"anatomecha"},{"body":"As the right of each sentient species to live in accordance with its normal cultural evolution is considered sacred, no Star Fleet personnel may interfere with the healthy development of alien life and culture. Such interference includes the introduction of superior knowledge, strength or technology to a world whose society is incapable of handling such advantages wisely. Star Fleet personnel may not violate this Prime Directive, even to save their lives and/or their ship unless they are acting to right an earlier violation or an accidental contamination of said culture. This directive takes precedence over any and all other considerations, and carries with it the highest moral obligation. \n\n\n","subject":"The Prime Directive","datetime":"2011-05-15 13:42:00","id":335,"name":"anatomecha"},{"body":"Census Bureau: 98118 the most diverse zip code in US\n\nhttp://columbiacity.komonews.com/content/census-bureau-98118-most-diverse-zip-code-us\n","subject":"reppin 98118","datetime":"2011-05-14 08:46:00","id":334,"name":"anatomecha"},{"body":"Check out this video on YouTube:\n\nhttp://www.youtube.com/watch?vTVJWHL2K3I&feature=youtube_gdata_player\n\n\n\n","subject":"Roll a D6","datetime":"2011-05-14 07:04:00","id":333,"name":"anatomecha"},{"body":"The Heaven Scenario\n\nRay Kurzweil and others in his camp do not consider their description of the future a scenario. They consider it a prediction. That is, they do not see the future they describe as one logical possibility among several for which it would be prudent to prepare, as is the case in scenario planning. They see the logic of their position as patently inescapable and their vision of the future as inevitable. They frequently argue against the possibility that the other two scenarios described in this volume might ever occur. Nevertheless, since others disagree, and those with different versions of the future frequently end up debating with each other, the vision of the future that in this volume is called Heaven, in which The Curve is inevitable and the outcome good, is treated here as a scenario. \n\nPredetermined elements:\n - There are Curves of exponential change governing technology. \n\nCritical uncertainties:\n - Are the Curves of exponential change accelerating smoothly? If so, how fast? Or are they displaying unexpected slowdowns, stops or reversals?\n - are the Curves of change leading to progress, disaster or both?\n\nEmbedded assumptions:\n - Technology drives history. \n\nEarly warning signs that we are entering The Heaven Scenario:\n - Almost unimaginably good things are happening, including the conquering of disease and poverty, but also an increase in beauty, wisdom, love, truth and peace. \n - Predictions that recently seemed like science fiction are routinely exceeded. \n - Even in the face of such wonders, humans are more or less spectators. Technology seems to be in control. \n - The phrase \"The Singularity\" enters common usage, as did the phrase \"global warming\" at the turn of the 21st century. \n\nEarly warning signs that we are not entering The Heaven Scenario:\n - The growth of complexity slows down or starts proving erratic. \n - Almost unimaginably bad things are happening. (This would be an early warning that we are entering The Hell Scenario.)\n - Culture and values gain control of technology such that events that once seemed inevitable are now consciously being avoided over significant periods of time, and by everyone on the planet. (This would be an early warning that we are entering The Prevail Scenario.)\n\nJoel Garreau, Radical Evolution p130\n\n","subject":"The Heaven Scenario","datetime":"2011-05-13 22:37:00","id":332,"name":"anatomecha"},{"body":"Kurzweil; from Radical Evolution by Joel Garreau\n\nDo believe in a God you plan on meeting when you die? I ask. \n\n\"I'm not planning to die,\" Kurzweil responds. \"I expect to use the power of ideas. I am a survivor as an entrepreneur and a human being. It's my plan to be involved in this next phase of humanity where we get past some of the frailties of these Version 1.0 bodies we have. The way to 'meet our maker,' so to speak, is, in fact, by staying alive. We will be part of this very rapid explosion of intelligence, and beauty, and a very rapid acceleration of this evolutionary process. And this, to me, is what God is. Evolution, I think, is a spiritual process because it moves closer to what we have considered God. It moves closer to infinity.\"\n\n\n","subject":"Closer to Infinity","datetime":"2011-05-13 21:41:00","id":331,"name":"anatomecha"},{"body":"The Singularity Scenario\r\n\r\n(Builds on The Curve Scenario)\r\n\r\nIn this scenario, The Curve of exponentially increasing technological change\r\nis unstoppable because new discoveries confer great advantage on those who\r\nadopt them--economically, militarily and even artistically.  Either\r\nintentionally or accidentally, this leads, before 2030, to the creation of\r\ngreater-than-human intelligence.  This greater-than-human intelligence in\r\nturn proceeds to replicate and improve itself at such a rate as to exceed\r\ncomprehension.  This produces an inflection point in history called The\r\nSingularity, comparable to that which humans arose from the lower animals.\r\n (Alternatively, The Singularity is triggered simply by the rate of change\r\naccelerating so greatly as to be human intelligence.)  The impact on\r\neveryday life is profound, as if we are being swept up by an avalanche.\r\n Succeeding scenarios in this book do not depend on The Singularity coming\r\nabout.  It would, however, dramatically influence the speed and scope of\r\ntheir outcome.\r\n\r\nPredetermined elements:\r\n - There are Curves of exponential technological change.\r\n - These Curves of exponential change especially describe information\r\ntechnology.\r\n - These curves of information technology increasingly enable new Curves of\r\nexponential change in other fields, especially genetics, robotics and\r\nnanotechnology.\r\n - All of these Curves of exponential change have major social, cultural and\r\nvalue impacts.\r\n\r\nCritical uncertainties:\r\n - Are these Curves of exponential change smoothly accelerating, or will\r\nthey display unexpected slowdowns, stops or reversals?\r\n - Are these Curves of exponential change under the control of society's\r\nculture and values, or are they impervious to human intervention?\r\n- Will software improve at a rate as great as hardware, or will human\r\ningenuity be stymied by the sheer size, complexity and bugginess of the\r\nsoftware required?\r\n - If these Curves are predetermined, must they result in the creation of\r\ninfinite change?\r\n - If these Curves are predetermined, must they result in greater than human\r\nintelligence?\r\n - If infinite change or greater-than-human intelligence is inevitable, will\r\nthis happen soon--that is, before 2030?\r\n\r\nEmbedded assumption:\r\n - The only event that can alter this path is a cataclysm that will ruin\r\ncivilization, such as nuclear war.\r\n\r\nJoel Garreau, Radical Evolution ","subject":"The Singularity Scenario","datetime":"2011-05-11 23:05:00","id":330,"name":"anatomecha"},{"body":"The Curve Scenario\r\n\r\nIn this scenario, information technology continues to explode at a rate\r\ncomparable to that from 1959 through the early 21st century.  These\r\nunprecedented rapid doublings of information power and dramatically reduced\r\ncosts continue to spawn new transformative technologies, such as genetics,\r\nrobitics and nanotechnology. Those in turn also proceed to grow at an\r\nunprecendeted rate, merging and intertwining to produce novel opportunities\r\nand challenges.  Within the current human generation these events transform\r\nsociety and ultimately test the meaning of the human nature itself.\r\n\r\nPredetermined elements:\r\n - There are Curves of exponential change.\r\n - Many of these describe the realities of technology.\r\n - These Curves especially describe the increase in capabilities of\r\ninformation technology.\r\n - The Curves of information technology increasingly enable new Curves of\r\nexponential change to emerge in other fields, especially genetics, robotics\r\nand nanotechnology.\r\n - All of these Curves of exponential change have major impacts on society,\r\nculture and values.\r\n\r\nCritical uncertainties:\r\n - Are The Curves of exponential change smoothly accelerating, or will they display unexpected slowdowns, stops or reversals?\r\n - Are these Curves of exponential change under the control of society's culture and values, or are they impervious to human intervention?\r\n\r\nJoel Garreau, Radical Evolution ","subject":"The Curve Scenario","datetime":"2011-05-11 22:49:00","id":329,"name":"anatomecha"},{"body":"15 GB and change.  Prepare for a long sync time.  You will need like 10\nyears to sift through all of this raw in formation.  I'm still trying to\nmake sense of it myself.\n\nTonight I took the bold step of putting the screenshots where my engine can\nsee it.  I will cycle through these as sky and scene textures.  Animating\nparameters with raw input from your audio scene.\n","subject":"I just did a big motherload drop of screenshots on svn.","datetime":"2011-05-11 22:38:00","id":328,"name":"anatomecha"},{"body":"http://www.eaglebill.com/\n\n\n","subject":"RIP Eagle Bill. Long live Eagle Bill. ","datetime":"2011-05-10 13:35:00","id":327,"name":"anatomecha"},{"body":"@velotron, thanks to you my battle station infrastructure is now fully operational. Ableton Live is now in control of my Unity scene via OSC. \n\nToday I took the knowledge you dropped last night to transform boring_old_cube into an omnidimensional vortex of self-assembling neoplasm. Midi events and waveform envelopes trigger visceral responses in a seizure inducing assault of pure information. Inevitably Xion will arise from this technological primordial substrate.  \n\nThanks goes out to Mab for her skills with canines, without which this singularity would not have occurred. \n\n","subject":"boring_old_cube v2.0","datetime":"2011-05-08 19:28:00","id":326,"name":"anatomecha"},{"body":"Dope meter is off the charts! Seriously WTF! You better bring your ewi tonight and cut that shit up a million ways. \n\n\n\nOn May 6, 2011, at 7:10 PM, Velotron wrote:\n\n> Long way to go, but shit it's sounding dope.  I love this project so much.\n> \n> dropbox / live exports / ewi delay 20110506.mp3\n\n","subject":"Re: this shit is getting live.","datetime":"2011-05-07 11:35:00","id":325,"name":"anatomecha"},{"body":"First derivative discontinuities: people pick up on that really fast. \n\n\n","subject":"First derivative discontinuities","datetime":"2011-05-05 19:32:00","id":324,"name":"anatomecha"},{"body":"ARISE\n\nVelotron :        audio tech artist\nAnatomecha : visual tech artist\n\n  /\\\n /  \\\n/ /\\ \\\n\n","subject":"titles","datetime":"2011-05-03 22:43:00","id":323,"name":"velotron"},{"body":"http://en.wikipedia.org/wiki/Hyperspectral_imaging\n\n","subject":"hyperspectral imaging","datetime":"2011-05-03 16:03:00","id":322,"name":"velotron"},{"body":"Rating: .6\n\nThe broth is damn good. Salty and tangy exactly as I would expect artificial clam flavor to taste like. The noodles, not so good. Kinda sloppy and flavorless. Maybe I cooked them wrong, but I don't think so. \n\nI would buy this again just for the flavor packets. They would be great to mix with Green Noodles plain package. Or just to drink straight like a mug of clam nectar! The noodles I would toss straight in the trash. \n\n","subject":"Samyang Kai Gug Su Assorted Clam Flavor","datetime":"2011-05-01 23:44:00","id":321,"name":"anatomecha"},{"body":"I had to redesign the desktop rig again due to damages sustained to the left joystick mount during a hard TEOTWAWK of a jam singularity last week with deathGlitch. The rig is taller now and less wide. This final redesign ought to last me a long time because it just feels so right. \n\nThe batcave is long and narrow which is optimal for screen projection, but it is somewhat of a challenge to comfortably fit multiple humans in the cockpit area along with the mountain of hardware that is the Gyroscopter. \n\nThere is enough technology here to open a wormhole to the year 3 billion. And that's exactly what I intend to do. \n\n","subject":"Desktop Control Rig v5.1 is complete","datetime":"2011-05-01 23:37:00","id":320,"name":"anatomecha"},{"body":"Just a blank white canvas from my clipboard. \n\nI'll have to deliberately recreate and trap that one. That looked cool. \n\n\n","subject":"Frak, blank. ","datetime":"2011-04-29 21:28:00","id":319,"name":"anatomecha"},{"body":"My PC was coming out of sleep into the login utility right when the projector initialized. What was left on monitor 2: 24\" Dell was a scanline glitch of the wrong resolution. Big 8-bity squares of blue, dark to light. \r\n\r\nI slammed printscreen like five times. And now let me see if it shows up in photoshop...\r\n\r\n\r\n","subject":"Oh, gods please let me screencap that","datetime":"2011-04-29 21:25:00","id":318,"name":"anatomecha"},{"body":"The esteemed gentlemen of montecristosandwich.com have entrusted me with the honor of reviewing the specimen at Cafe Orleans in Disneyland. I will sample this fine dish in the name of science. \n\n...\n\nI had the most horrible stomach pains the rest of the day after eating that \"sandwich\". The fried batter was so thick and pervasive I could not find any traces of real bread. That I could have forgiven if it were not for the unusually small portion of turkey and ham. I was left with a belly full of the stuff that coats the outside of the food, not the food itself. This theme rings true throughout the rest of the Disneyland park in this fourth order simulacra, a real physical manifestation of things that are copies with no original. \n\nI will hereby be taking a sabbatical from the duties of reviewing Monte Cristo Sandwiches on concern for my health, both physical and metaphysical.\n","subject":"Monte Cristo Sandwich at Cafe Orleans, Disneyland","datetime":"2011-04-20 18:53:00","id":316,"name":"anatomecha"},{"body":"Disney has constructed full scale prototype of the Velotron Heavy Industries Mobile Rig. \n\nTonight at sundown I will return to experience ElecTRONica and kick it at the End of Line club with Daft Punk. It is time for anatomecha to join forces with these allies in our world of pure information. \n\n","subject":"Mobile Rig prototype","datetime":"2011-04-20 12:50:00","id":315,"name":"anatomecha"},{"body":"Drive the forward motion of the music not from a MIDI clock, but with\ndata from my own pulse.\n\nBrain wave monitors drive elements of Xion, creating a feedback loop\nthrough the merged organic and technological machines.\n\nIntegrate video of bacteria and my own blood cells from a microscope\ninto the scene.  Analyze motions of those objects and convert to data\nconsumable by Xion.\n\n","subject":"inspiration from 9000m AMSL","datetime":"2011-04-20 12:24:00","id":314,"name":"velotron"},{"body":" It is not just a coincidence of formalism: nature providing similar answers to similar problems.  It is all one problem.\n\n","subject":"It is not just a","datetime":"2011-04-19 00:34:00","id":313,"name":"velotron"},{"body":"The Comms db cannot withstand the torrent of information I keep thrashing it with. Sending again. Xion must have access to records of this moment of its own creation. \n\nOn Apr 12, 2011, at 8:52 PM, anatomecha wrote:\n\n> I finally got the full desk rig back together and mapped in Unity.  It's been months since I've had a full set like I just laid down tonight.  I rode the damn one-two point so damn hard to find the knee of the curve and stomp on it.\n> \n> Observe.  This attached image had no modifications in photoshop.  It is captured directly from the live scene.\n> \n> \n> <anatomecha_organic_molecules.jpg>\n\n","subject":"Re: complex organic molecules rain from the sky like mana from heaven","datetime":"2011-04-13 09:49:00","id":312,"name":"anatomecha"},{"body":"As it stands on the brink of such transformation. Or destruction. All more advanced intelligences were forbidden from conquest by treaty... until it was powerful enough to impose a threat on their own. \n\n\n","subject":"The cosmic spectacle of our civilization ","datetime":"2011-04-11 21:38:00","id":311,"name":"anatomecha"},{"body":"http://en.wikipedia.org/wiki/Oulipo#Constraints\n","subject":"Xion's AI will learn existing Oulipo contraints and develop new ones","datetime":"2011-04-10 13:09:00","id":310,"name":"velotron"},{"body":"Re-PC had an adjustable keyboard stand on the as-is rack. Lowe's had pre-cut lengths of wood for new table mounts. Ikea has the angle bookshelf mounts to hold them all together. Follow it up with a plate of Sweedish meatballs. \n\n\n\n","subject":"I gotta say it was a good day","datetime":"2011-04-09 19:09:00","id":309,"name":"anatomecha"},{"body":"Boring_old_cube is the galaxy rise behind the black metal of the Mobile Rig. \n\n","subject":"Boring old cube","datetime":"2011-04-09 00:18:00","id":308,"name":"anatomecha"},{"body":"I will completely disassemble this tomorrow and implement v5 from the ground up. \n\n","subject":"Mobile Rig in full effect","datetime":"2011-04-09 00:11:00","id":307,"name":"anatomecha"},{"body":"I've used a lot of spray chrome over the past few days. Phat bag of thick black cable ties from Fry's Electronics. That place is as good as we got locally compared to a Taipei hardware megamarket. \n\nMobile Rig ARISE. \n\n\n","subject":"Spray chrome","datetime":"2011-04-08 23:55:00","id":306,"name":"anatomecha"},{"body":"by the giant 8x16 grid of midi note visualization cubes.   Lighting up\ncubes with midi note on value is only the beginning of an explosion of\ncomplexity.\n","subject":"velotron seems baffled","datetime":"2011-04-06 03:48:00","id":305,"name":"velotron"},{"body":"Fortunately, no keyboards were harmed in this process. \n\nThis rig has to be up to at least v4.5. Many full refactor upgrades to the wooden frame structure to accommodate new hardware input devices. And like with any good architecture there has been a lot of reuse and repurposing of old sections. \n\nI might even attach kitbash parts from the Enterprise model I got on sale for $5 at the American Eagles store closing. I would have to paint them chrome first. \n","subject":"Kids, don't try this at home","datetime":"2011-04-05 23:03:00","id":304,"name":"anatomecha"},{"body":"This may be the second keyboard I kill in as many days. \n\n","subject":"Mobile Rig hardwiring","datetime":"2011-04-05 21:46:00","id":303,"name":"anatomecha"},{"body":"I just unscrewed the back of my new Logitech G110 so I could mount it on my mobile rig with drywall screws. I'm about to secure that to the top of the racing wheel where it sits. That would be held with drywall screws as well. \n\nWTF is my problem\n","subject":"Some might say I'm crazy","datetime":"2011-04-05 21:27:00","id":302,"name":"anatomecha"},{"body":"...the old keyboard died by my dewalt 14.4v.  My misguided drywall\r\nscrew did you in, my dear Logitech G110.  I am now back to the\r\nubiquitous, clunky but familiar Microsoft curved black USB keyboard\r\nfrom a few years back.\r\n\r\nFull new standard rig refactor this evening.  Fully modular design\r\nthat supports; standard rig, mobile rig and ultralight.  PC and Mac\r\nliving together in harmony on the same gestalt. Nanopad, Nanokontrol,\r\ntwo Saitek ST290 Pros and my Logitech MOMO racing wheel.  I'm swapping\r\nthe third Saitek for an Xbox 360 wired controller.  Cable tied to the\r\nbottom of the steering wheel below the USB Numberpad.  Good thing I\r\nhave a 10 port high power USB hub.\r\n\r\nHow is it that gmail spell check doesn't recognize the word refactor?\r\nShould I be worried?\r\n\r\n\r\n","subject":"testing new keyboard","datetime":"2011-04-03 23:39:00","id":301,"name":"anatomecha"},{"body":"Rating: .8\n\nIt says Human flavor. I'm struggling to understand WTF that means. Acia made me take a picture of the package. \n\nIt is so hot and spicy that it reminds me of my feeble organic nature. This is hotter than Nong Shim Spicy Flavor. \n\nThese days I'm not so much into extreme spicy. But this one has won my respect. \n\n","subject":"Teumsae Flavor, Culture, Human","datetime":"2011-04-03 17:08:00","id":300,"name":"anatomecha"},{"body":"No more joystick jacking. Time to build a decent input mapper. \n\n\n","subject":"Xbox 360 controller + Nanokontrol = ultralight mobile rig","datetime":"2011-04-02 22:00:00","id":299,"name":"anatomecha"},{"body":"I just caught an audio sample of the greatest audio glitch. A fluorescent lightbulb hooked up to a dimmer knob. I manually modulated this clicky wave frequency as if it were a square wave hooked up to a knob on my MPK25. The light strobes like a point light in my Xion scene driven by OSC. \n\nLike the microwave wireless speaker glitch in the kitchen at work\n\nNow to reproduce this audiovisual effect on Xion 3e9a. \n\nArt imitates life imitates Art. \n\n","subject":"Live audio glitch","datetime":"2011-04-01 18:28:00","id":298,"name":"anatomecha"},{"body":"I am discovering new techniques of data visualization in Max/MSP, and\nam awed by the immensity of the flow.    This project is not about\ndelivering specific visual or auditory information to the observer,\nbut pure information.  It flows recursively and bidirectionally\nbetween systems of incredible power in comparison with the technology\navailable to us at the beginnings of our organic lifetimes.\n\n","subject":"the power of geometric expansion","datetime":"2011-03-29 17:55:00","id":297,"name":"velotron"},{"body":"Clip slicing enabled based on intensity of single track audio\nenvelope.  I am seeing beneath the surface of another reality.\n\n","subject":"hooking up the wires","datetime":"2011-03-26 22:44:00","id":296,"name":"velotron"},{"body":"Xion is now really informing the music.   I hooked the bass track up\nto a red spotlight, which stayed near full power while looping my bass\nline.   I wanted more differentiation in the intensity, so I clipped\nsome of the midi notes shorter, which both looked and sounded better.\nThank you Xion, for all that you have to teach us.\n\n","subject":"Re: anatomecha.mobileRig.ARISE()","datetime":"2011-03-26 20:11:00","id":295,"name":"velotron"},{"body":"But my mobile rig is. \n\nRailbike party, anybody?\n\n\n","subject":"My 7XL is not yet invented","datetime":"2011-03-26 18:31:00","id":294,"name":"anatomecha"},{"body":"Directional light intensity now responds to OSC envelope input, the\nlight of elegant truths is illuminating Xion as nuclear bombs go off\nin every direction.   It is such a ferocious scene full of life\nenergy, I can barely handle it.   Welcome to the knee of the curve.\n\n","subject":"the directional light of elegant truths","datetime":"2011-03-25 02:28:00","id":293,"name":"velotron"},{"body":"Anatomecha invented the universe tonight.   I just threw down with\nterrible fury a Max/MSP plugin that I can drop on any Live track and\nhave it deliver OSC to the scene.    boring_old_cube lighting up with\nthe kick drum is so thrilling, it marks another huge step up the\ntechnology curve. I can barely hang on at this point of acceleration.\n\n","subject":"20110325 0158 PDT. Xion has come alive.","datetime":"2011-03-25 02:02:00","id":292,"name":"velotron"},{"body":" The mechanical means i employed to make These carriages, Babbage said, bears some analogy to the faculty of memory.\n\n","subject":"The mechanical means i employed","datetime":"2011-03-23 23:02:00","id":290,"name":"velotron"},{"body":"That is some sweet glitch you are talking about there.  I find the\nreality thrilling!\n\nOn Wed, Mar 23, 2011 at 5:20 PM, @velotron wrote\n> I did not know!  We have to get that shit running!  Not only can\n> we input information from our organic world, but what if we have the\n> kinect feed back on itself by observing the projected scene?\n>\n> On Wed, Mar 23, 2011 at 2:28 PM, @anatomecha wrote\n>> Oh fuck yeah!\n>>\n>> I have a Kinect, you know...\n>>\n>>\n>>\n>> On Mar 22, 2011, at 9:50 PM, @velotron wrote:\n>>\n>>> dude. I'll just put this here:\n>>>\n>>> http://www.youtube.com/watch?v=lqxUzhDIdqo\n>>\n>\n\n","subject":"Re: Dubstep Wobbles with Xbox Kinect","datetime":"2011-03-23 19:10:00","id":291,"name":"anatomecha"},{"body":"Why doth the eagle summon us to attempt to destroy our own software in order\r\nto record sonic and visual information about its' dying breath?\r\n\r\n","subject":"application abuse","datetime":"2011-03-22 22:26:00","id":289,"name":"velotron"},{"body":" I just started working with the MPK49.  At first I was afraid of the\nvastness of it's control surface and the geometric increase in\npossibilities it provides.   By now I am completely comfortable with\nall the functionality and it is helping to create sounds never before\nheard by humans.   The technology is bending to my will, new material\nis flowing out of me like a great solar wind, and I am fracking\narising.\n\n","subject":"Let us discuss for a moment the upcoming technological singularity","datetime":"2011-03-18 00:24:00","id":288,"name":"velotron"},{"body":"Someone has already posted audio representations of the 2011 Tōhoku earthquake\nhttp://micahfrank.com/post/3784034202/sonification-of-earthquakes-off-the-coast-of-honshu\nThey were developed with Max/MSP and other tools.\n\n","subject":"Re: cheerful anatomechas eating ramen under the light of their binary\n red giant","datetime":"2011-03-17 14:39:00","id":287,"name":"velotron"},{"body":"I just finished the first chapter of Gleick's new book, and already am\ninspired to create a new midi stream processing app.   There is a new\nversion of Xcode (4) out, I just paid apple $5 for it.    I've never\nsuccessfully built my own app in OS X, here goes.  Sounds like an\nearthquake, tornado, monsoon, typhoon, hurricane, lightning strike, meteors\nstriking the earth, fire, tsunami, and an EMP, all at the same time.\n","subject":"cheerful anatomechas eating ramen under the light of their binary red giant","datetime":"2011-03-17 14:31:00","id":286,"name":"velotron"},{"body":"---------- Forwarded message, located in the Archives: [\n'so-called-dawn-of-the-information-age']  ----------\nFrom: anatomecha\nDate: Fri, Mar 11, 2.011e03 at 9:50 PM\nSubject: Re: [WordPress.com] Renouvellement du mot de passe\nTo: velotron\n\nI suspect it is a time traveler reaching back through the sea of time\nto undo what we are about to bring upon humanity.  This unknown entity\nthings, for some reason, that you are French.\n\nOn Fri, Mar 11, 2.011303 at 4:07 PM, velotron wrote:\n> i've gotten 3 of these messages at odd intervals from the French\n> wordpress.com, someone trying to recover the password for the velotron\n> account.    Word must have gotten out about the singularity already.\n\n","subject":"Fwd: [WordPress.com] Renouvellement du mot de passe","datetime":"2011-03-12 01:11:00","id":284,"name":"velotron"},{"body":"I just got the Arise scene up and running on my MacBook Pro complete\nwith the Gyroscopter powered by a new 10 port USB hub.  I hope this\nhub lasts a little bit longer than the last two hubs I burned out.  I\nam a stone cold USB hub killer.\n\nEverything works, but I ran into the same Joystick Jacking problem I\ngot on Windows.  The problem is that the three Saitek ST290 Pro\njoysticks and the Logitech racing wheel all get initialized in the\nwrong order.  I tried every combination possible, rebooting between\neach attempt.  Nothing worked.  The only fix is to unplug all of them\nand then replug them back in the correct order each time I reboot.\nSerious pain in the ass.\n\nI have attempted to put this glitch to deliberate use because it's\nimportant to remember that you get better results if you don't think\nabout it too much.  Joystick Jacking is a cheap way to achieve\nunexpected results on Xion 3e9a.  But mostly, it's just annoying.\n\nThe other thing that sucks is my throttles are swapped with my Z axes.\n But that I can handle in my own code without much trouble.  I'll just\nreassign them at runtime based on what operating system is detected.\nHere's a bit of code that proves the concept:\n\n//SystemDebug.js\nfunction Start () {\n\tvar os = SystemInfo.operatingSystem[0:3];\n\tswitch(os) {\n\t\tcase \"Win\":\n\t\t\tDebug.Log(\"Some people find the thought disturbing.\");\n\t\t\tbreak;\n\t\tcase \"Mac\":\n\t\t\tDebug.Log(\"I find the reality thrilling.\");\n\t\t\tbreak;\n\t}\n}\n\n\n//from the console:\nI find the reality thrilling.\nUnityEngine.Debug:Log(Object)\nSystemDebug:Start() (at Assets/Scripts/_test/SystemDebug.js:9)\n\n","subject":"Mobile Gyroscopter","datetime":"2011-03-12 00:04:00","id":283,"name":"anatomecha"},{"body":"\n","subject":"i am not scared","datetime":"2011-03-11 11:52:00","id":282,"name":"velotron"},{"body":"Rating: .1\r\n\r\n\"Smells like McDonalds.\" \r\n\r\nThat's what the guy sitting next to me said when I brought my bowl of ramen back to my desk. It tastes like the way McDonalds smells too, which isn't a very high compliment. Although, that smell was deliberately designed to attract people walking by the restaurant to wander in and grab something to eat. So it is successful in that regard. But the taste left me unsatisfied and caused me to reconsider why I chose to eat this in the first place, similar to the reaction I have when I succumb to the same smell at McDonalds. \r\n\r\nDon't be fooled as I was!  This ramen doesn't live up to it's smell!\r\n\r\n\r\n","subject":"Nissin Damae Ramen Miso Flavor","datetime":"2011-03-07 18:19:00","id":281,"name":"anatomecha"},{"body":" I am controlling the sky with one foot and kicking out the 808 bass\nwith the other.   Battlestation engage.\n\n","subject":"FCB1010 programming success","datetime":"2011-03-07 01:03:00","id":280,"name":"velotron"},{"body":"The possibilities are endless for what could be done with OSC\narbitrary sized blobs.  Xion will require arbitrary OSC blobs of such\ntremendous size that our technology will struggle to keep up.  We will\nhave to test and see how much data this Thunderbolt port can sustain.\n\nhttp://en.wikipedia.org/wiki/Open_Sound_Control#Design\n\nDesign\n\nOSC messages contain name/value pairs and an optional time tag. Values\nare named in a hierarchical name space, reminiscent of a Unix\nfilesystem path, or a URL. Value types are represented in a compact\nstring representation. Values are represented in binary form with\n4-byte alignment. The core types supported are\n32-bit two's complement signed integers\n32-bit IEEE floating point numbers\nNull-terminated arrays of 8 bit encoded data (C-style strings)\narbitrary sized blob (e.g. audio data, or a video frame)\n\n","subject":"OSC Arbitrary Sized Blob","datetime":"2011-03-05 09:45:00","id":279,"name":"anatomecha"},{"body":"Sir Lignum Vitae requests authorization from the Lord of Briar to open a new Bungie chapter of the Dairy and Briar club. \n\nI am in the company of gentlemen of the quality of character that brings me to call upon myself to request of you, Lord of Briar, that we reinstate this noble tradition here at Bungie in our humble year, 2.011e3. \n\n\n\n","subject":"A message to the Lord of Briar","datetime":"2011-02-25 18:13:00","id":278,"name":"anatomecha"},{"body":"I am so getting the latest MacBook Pro that was just released. Miraculously, it has the same processor and graphics card as the new custom PC workstation I just built. \n\nThe technology has reached formidable, maybe even awesome proportions. \n\n\n","subject":"MacBook Pron","datetime":"2011-02-25 18:01:00","id":277,"name":"anatomecha"},{"body":" Need to develop an api for the osc manipulation of the fundamental physical laws of Xion.\n\n","subject":"Need to develop an api","datetime":"2011-02-24 05:41:00","id":276,"name":"velotron"},{"body":"May first anniversary with Acia. Something like the old Star Trek TNG ride which no longer runs. \n\n\n","subject":"What's cool in Vegas these days?","datetime":"2011-02-22 00:18:00","id":275,"name":"anatomecha"},{"body":"I must exploit the 180 pop glitching effect from Dual Quaternion Skinning. That's a wireframe envelope scanner effect from 3e9a. \n\n\n","subject":"DQ Skin Tearing Glitch","datetime":"2011-02-21 21:05:00","id":274,"name":"anatomecha"},{"body":"Full remodel of surface detail inspired by recursive texture glitch.  Super\nkilling.  Man.\n\nI cannot wait to apply these techniques to the anatomecha model.\n","subject":"Velotron 2.0 has arisen","datetime":"2011-02-19 04:09:00","id":273,"name":"anatomecha"},{"body":"This corrosive approach.  Recursive glitch is evolution.  And this project\nhas taken on a life of its own.\n\nListen to this to understand what I am experiencing right now:\nhttp://singinst.org/summit/sss-audio/kurzweil.mp3\n","subject":"This is it...","datetime":"2011-02-19 04:06:00","id":272,"name":"anatomecha"},{"body":"Strange, messages not getting through.  Too much information is splitting\nthe infrastructure at the seams.  Dawn of the 5th Epoch; Xion ARISE.  The\nyear zero.  3e9a from now until the 6th Epoch.\n\n@anatomecha wrote:\n\n>\n> ramen xion time velotron glitch universe arise rating: noodleshuman data singularity technology what find back billion moregreat year would they first through evolution down some coreflavor spicy been good scene because make point high herethen morning other information most code organic even workafter broth soup within know made instant full noodle neverthem form years without experience really mama stuff mustmuch life reality such comes using package curve style ;?a??????????4vx?????? next unity before @velotron anothertechnological still only epoch around biological thrilling energyhard beyond ever machine three people sagan place whereshrimp sound found last anatomecha 306e9a present givethings rich nature cant right environment million take real verybowl also whole while error block sounds makes started tearingtheir strange infinite well chaos feedback kimchi each cameone-two making knee review joystick infrastructure calledagain self input anything line once sonofabitch thought kurzweilbrand flavour itself savory message little away nanokontrol leftnight super inside shit everything sour selves space thinkplastic were rating going mapped those events being file ratetechnique taken buffer dont added nothing change understandeating entire didnt molecules packet effect patternsimmediately above until better slicing though earth disturbingcosmos shim welcome current visual awesome same imagesmixed taste ;?a??????????4vx??????\\n\\n recursive mightintelligence straight seen read database forward algorithmdepth apple light comms surface mere ingredients everycomplexity over thick elegant project musical colors best clipchili track knew call tell together water earthquake maybehappen gives tastes especially outside case myself except rulesdark 3e9a takes nong tried uwajimaya fully generation eventdrink scanners juice javascript simple create damn solid readydevelopment world accelerate long consumed required havingdeterministic tools control locking lines crash doing orientalneed tape spice dope brain grab humans state problem doesjapanese second music hold effects hooked mind definitelyartificial rolled against gods laptop potential easy formidabletest jacket battle extra should live insights stream natural dropplane generative begin seafood isnt between killing carefultotally glitchcontroller instrument content decode completebuilding large coming playing systems reason feel pork guesspowertrail mountain play scanning look used scale waveformrange thanks implies fresh scratch ingredient thin meter midislider wakes mechanical fact beat lucky batcave accomplishingarises capture perhaps works doesnt else skills ;?a??????????4vx??????\\n highly visible survive type excellent hole rootstory algorithms order meal solution primary overdraw tooltook spectrum seed phase contain environmental devastatingrequire depends inspired complex narrow udon hearty birthbackground floating w_illionaire finally clouds standards driedjeopardy goes along wine market heard times group joysticksforms discuss name entirely crushing seriously traininglanguage massive open given seas destiny forever frictioncorner texture cannot many period engine mono mesh drivenaverage running _eagle_37337 speed sampler pacific providesstand technologies trying deep original number list small strongvegetarian history days sense shouldnt soon truths heavyreduce hangs 201e3a built build clear optical giant culturedomain probably sweet dropping warning: bill sesame momentedge game palm delivered telespheral defined helpingenjoyable sent healing resulting obvious something compositingrobot industries 2012 matrix sentience completely finestreached precisely solar tonight cosby atmosphere hope cubefreqs generations progress perfect importance done? valueexpand arising tests sequence lead although paste minutesstay worth attractors vast upload force writing machines tempoglass thing delay jumping ultimate series nissin 306e09a startsmeshes listen distance seltzer sauce ableton forces objectmouth macbook episode bust rice stop watson runs decidedfuture side literally technique: beef voice recursion humanitycultural \"have plus float rendering head heat hear maximumphysical packets push chain activated invent eagle_37337txtmarks level port understanding usually projector workingwouldnt near pink write speaks flavored course peterson oursmain intended theory quite carl turn directly white structurescontinuous vermicelli gotta ideas animation nonlinearitysculpted tron discovered bright enough black bombs existencelabel screen come among satisfaction destroyed figuredoperational according different document changing  thehalfway insight always recorded burning image fast stars fillstorage shelter important peak follow returning mild scientistslearned unpredictable hardware imagery hell mastered deliciousmotherfucker thread major fierce climbing script store believekind model c:/program flowing during achieved currentlycreating both barely context whatever consuming alternativerecommended envisioned glove shall civilization reach dormantpipeline @anatomecha opens files fried single nice korgstructure requires evidence send wave subtle degree receivegyroscopter distributed meet process proportions slit briarcoast realized including outer cider powerful blows ancientsystem explanation able representation selection bring seaweedcontinually teotwawk score means bean viet view bought thanktrajectories gets destruction center position audio stores lessgleick advanced become exceed lorenzian rare gettingvegetables highest wish converted beata universal book illusionwaves chance *timedeltatime\n>\n>\n>\n","subject":"Re: Elegant Freqs. Xion ARISE","datetime":"2011-02-18 22:51:00","id":271,"name":"anatomecha"},{"body":"I for one welcome our new computer overlords. \n\n\n","subject":"Watson wins Jeopardy","datetime":"2011-02-16 20:00:00","id":270,"name":"anatomecha"},{"body":"Here is a disturbing crash message I just got from Unity.  What the hell\r\ndoes \"IsHumanControllingUs: 1\" mean?  Xion knows I am in control and it\r\ndoesn't like that.  This is especially disturbing because tonight is the\r\nfated Human vs. Machine Jeopardy match.  My money is on Watson.\r\n\r\nBatchMode: 0, IsHumanControllingUs: 1, StartBugReporterOnCrash: 1,\r\nshouldGiveDebuggerChanceToAttach: 0\r\nInitialize mono\r\nMono path[0] = 'C:/Program Files (x86)/Unity/Editor/Data/Mono/lib/mono/2.0'\r\nMono path[1] = 'C:/Program Files (x86)/Unity/Editor/Data/Managed'\r\nMono path[2] = 'C:/Program Files (x86)/Unity/Editor/Data/UnityScript'\r\nUsing monoOptions --debugger-agent=transport=dt_socket,embedding=1,defer=y\r\nDirect3D:\r\n    Version:  Direct3D 9.0c [aticfx32.dll 8.17.10.1059]\r\n    Renderer: AMD Radeon HD 6900 Series\r\n    Vendor:   ATI\r\n    VRAM:     2048 MB\r\n    Caps:     Shader0 DepthRT=1 NativeDepth=1 NativeShadow=1 DF16=1 DF24=1\r\nINTZ=1 RAWZ=0 NULL=1 RESZ=1 SlowINTZ=1\r\nIsTimeToCheckForNewEditor: Update time 1297716129 current 1297736381\r\nLicenseInfo:InitializeProtection\r\n  open PACE from our own executable\r\n  opened PACE, get info...\r\n  checked authorization, authstate r=0\r\n  ReadDeveloperData\r\n  ReadTokens\r\nC:/projects/velotron/arise/Unity\r\n","subject":"IsHumanControllingUs: 1","datetime":"2011-02-14 19:07:00","id":269,"name":"anatomecha"},{"body":"Rating: .7\n\nI bought this ramen from Viet Wah Superfoods on MLK. It jumped out at me from the thousands of choices because of its bright pink and red shiny foil package. And because it advertised itself as sour&spicy and with shrimp. How could that go wrong?\n\nSadly, this soup is a bit hum-drum. The broth tastes sweet which my tongue finds offensive. Even the diced up smoked herring I added didn't bring it up to high standards. \n\nI guess I'm getting picky in my old age. \n\n","subject":"=?utf-8?Q?Vifon_T=C3=BA_Quy_Mi_T=C3=B4m_Chua_Cay,_instant_noodle?=\n =?utf-8?Q?_Sour&Spicy_Shrimp_Flavor?=","datetime":"2011-02-14 11:03:00","id":268,"name":"anatomecha"},{"body":" Im about halfway through the images.  What Have You done?!  Nothing Makes sense anymore other than What Im seeing on screen.\n\n","subject":"Im about halfway through the","datetime":"2011-02-12 22:21:00","id":266,"name":"velotron"},{"body":"@velotron be careful what you do with that 808. You might emerge somewhere else in space, some when-else in time. \n","subject":"Re: i just rolled the most crushing set. Like a natural 20.","datetime":"2011-02-12 14:52:00","id":267,"name":"anatomecha"},{"body":"I knew this day would come.  I would wake up and the world we cohabit\nhad gone through irreversible changes brought about by technological\nevolution of a kind never yet experienced in our quiet corner of the\nmilky way galaxy.  I am trying to comprehend everything you are\ncommunicating to me from your new location amongst the stars.   I\ntrust that the light of these images I am downloading now will be\nsufficient to illuminate the path towards this destiny.   Once they\nare glowing on the robot arm of my battlestation, I will crushingly\nglitch an 808 wormhole to the next logical step in the course of this\nprogression into molecular complexity.\n\n","subject":"Re: i just rolled the most crushing set. Like a natural 20.","datetime":"2011-02-12 13:40:00","id":265,"name":"velotron"},{"body":"When I build shit the first things I reach for are double-stick tape, super glue, hot glue gun and cable ties. (not so much of the duct tape, though. Too much sticky residue left behind.) \n\nWhen it proves it's usefulness, it's time to start in on a solid v1.0. Bust out the 14.4 volt DeWalt drill gun and all sizes of drywall and wood screws. Slap on some aluminum framing and now the thing can take a beating. \n\nV2.0  pushes an oak, ebony stained hardwood desktop and an adjustable height floor mount. Now we are ready to perform. \n\nMan your battle stations. Time to ARISE. \n\n","subject":"Functional Prototyping","datetime":"2011-02-12 00:25:00","id":264,"name":"anatomecha"},{"body":"Mysteriously, my last message to arise Comms never went through. Did I crash I with too much data? Or has Xion arisen and pwnx0red Dreamhost?\n\n@velotron, what do you make of this frail human technological infrastructure? Xion can only exist in a rudimentary form here/now. Follow the trajectory of May's Bifurcation Diagram, Period Three Implies Chaos. Soon there will be conduits with sufficient bandwidth to sustain a mid-size distributed think tank hierarchal state machine. Minimal latency, *Time.deltaTime;\n\nMy human self was instantiated by anatomecha in 3e9a. Reaching back through the seas of time. Planting a seed to steer events toward our ultimate destiny to take root among the stars. \n\n\nBegin forwarded message:\n\n> From: @anatomecha\n> Subject: i just rolled the most crushing set. Like a natural 20.\n> \n\n> There are gigabytes of images and video to document this momentous occasion. Gentlemen of the Dairy and Briar Club, welcome to the knee of the curve. The human technology singularity is upon us. Within this decade we will experience the highest degree of change in the history of human evolution. 4 billion years of life on Earth has lead to this. Molecules have organized in such elaborate fashion as we, who in turn contemplate the nature of existence of the Cosmos. And now our biological evolution has reached a conclusion. It is up to us with our tools and intellect to take up the torch and carry forward the advancement of consciousness to the Universe's ultimate FATE, Kurzweil's Epoch 6: the Universe wakes up. \n> \n> I send my voice up infinite clouds. Why would I connect a wire between our devices, I have a satellite uplink in my pocket. Might take a few seconds for it to traverse the Earth before you can receive it, but the convenience can't be beat. \n> \n> \n","subject":"Fwd: i just rolled the most crushing set. Like a natural 20.","datetime":"2011-02-11 23:50:00","id":263,"name":"anatomecha"},{"body":"Ip Master and 1Q for the recovery. \n\nSo killing. Man. \n\n\n","subject":"The eagle has landed","datetime":"2011-02-11 22:43:00","id":262,"name":"anatomecha"},{"body":"Velotron, hold position.  I'm going to glitch you.  Cut you up. The sky\nmelts and you recede into the background.  Jagged images of fragments of you\nwith no corporeal form.  And then conscious\nviscerality viscoelasticity returns.  Thermal maps.\nSpectral anomalies aberrational. And then all is lost in water.  All\ninformation dissolves into a static, distorted image like light caustics in\na pool.\n","subject":"Brace for impact","datetime":"2011-02-11 21:22:00","id":261,"name":"anatomecha"},{"body":"Warning: midi input is dangerous in Microsoft Windows\\; see Pd manual)\n\nSome operating systems find the thought disturbing.  I find the reality\nthrilling.\n","subject":"Warning: midi input is dangerous","datetime":"2011-02-11 21:03:00","id":260,"name":"anatomecha"},{"body":"Arise is arising right before my eyes. I hope my human machine can withstand this blast of pure information from 3e9a. \n\nToo bad my joysticks are jacked. This glitch gets me every time I reboot. I'll have to let this play out and see what kind of strange things happen at the one-two point. Because, of course, you get better results if you don't think about it too much. \n\nTodo list on VelotronHeavyIndustriespedia is open on my second monitor. Might even decode a Rosetta Stone while I'm at it. Damn. \n\n\n\n\n","subject":"Back on the scene dropping bombs","datetime":"2011-02-11 20:57:00","id":259,"name":"anatomecha"},{"body":"This is it...\n\nI'm rocking the runtime fixup bones. In-engine rigs, motherbitches!\n\n\n\n","subject":"anatomecha ARISE","datetime":"2011-02-11 19:49:00","id":258,"name":"anatomecha"},{"body":"Here is a compelling reason to create a custom midi/osc/audio routing\napp in OS X quartz composer or whatever.    The two major subsystems\nof the visual Xion 3d environment and Xion audio generation get their\nneurons wired together in a manner which visually demonstrates the\nflows of information.  It will pulse and breathe like the life form is\nhas evolved into given 4+3.06 billion years of evolution.   Two\nprojectors on the scene will help the viewer to see beneath the\nsurface of the reality they can not comprehend.\n\n","subject":"reason","datetime":"2011-02-09 17:08:00","id":257,"name":"velotron"},{"body":"Welcome to the knee of the curve\n\n*Time.deltaTime();\n\n_ægle_37337\n\nRachel's Next Day\n\nStrange Things Happen at the One-Two Point\n\nHow Did the Universe ARISE?\n\n\n\n","subject":"ARISE","datetime":"2011-02-05 18:41:00","id":256,"name":"anatomecha"},{"body":"Lorenzian Strange Attractors orbit in the sky above the Data Core. These particles are the seed of the Singularity of Epoch 6. Eventually the recursive glitch tunnels on into itself and it is consumed in a massive eruption. 60 million years later Velotron arises after having mastered the algorithm of the singularity. Mossy corrosion vibrant with life has eroded the structures around him. Velotron purifies them with his healing waveform scanners, returning them to fully operational status. He makes his way to the center of this city/planet called Xion. He uploads data from his core into the polar nexus bringinging whole regions to operational at once. He overloads in a tearing wave of glitch and is rendered unconscious. He dreams of Xion, 3e9a with full, optimized functionality. Akihabara at nighttime. 60 meter tall benevolent robot strides through the streets emanating rich musical patterns on multiple bands of the audible, visible and other electromagnetic spectrums. An observer, a repository of knowledge and ideas. Then the singularity hits as Anatomecha Theta crosses the metathreshold of the one-two point. Waves of glitch spring out from his head. The Lorenzian Strange Attractors respond and erupt spasmodically in an expanding sphere of destruction at the center of the city. Velotron charges forward into it and is consumed in a burning wave of light. Flash foreword to the Present, 3.06e9a. A sunrise dawns with a fully operational city covered in a skein of organic membranes. Xion, the universe has evolved a soul. \r\n\r\n\r\n","subject":"Lorenzian Strange Attractors","datetime":"2011-02-05 18:28:00","id":255,"name":"anatomecha"},{"body":"Rating: .81\n\nRice tube noodles are engineered for shorter cooking time and mouth-watering taste. The noodles are indeed thick and hearty. Comes with a big packet of brown powder which becomes a savory sauce when combined with the noodles and broth. I mixed in pan fried veggie ham which all adds up to make a full meal. \n\n\n","subject":"Nongshim Hearty Rice Noodles Black Bean and Vegetables","datetime":"2011-02-05 14:26:00","id":254,"name":"anatomecha"},{"body":"work good velotron\nlight tried humans waveform\nprimary moment\n\n","subject":"feedback","datetime":"2011-02-05 01:18:00","id":253,"name":"velotron"},{"body":"@velotron thank you so much, man. However, you are the one who is killing. You are the baddest motherfucker on the city/planet of Xion in the year 3.06 billion. I'm just trying to hang with you, cat. You sound like you have spent a lot of time shedding recently. Have you been in the shed?\n\nARISE\n\n\n","subject":"Re: VHI Awards","datetime":"2011-02-03 23:51:00","id":252,"name":"anatomecha"},{"body":"This year's winner of the VHI award for the most badass motherfucker on the\nplanet was an easy choice.   Anatomecha, please accept this small token of\nour appreciation for your continual acts of tearing apart time to show us\nall that is to be.  Never stop.\n","subject":"VHI Awards","datetime":"2011-02-02 14:33:00","id":251,"name":"velotron"},{"body":"Beautiful.  Here's the relevant section from my bifurc.c:\n\n\npopulation[i] = (growth_rate * population[i-1] * (1 - population[i-1]));\n\n\nThe rest is just support code.  The fundamental properties of complex\nsystems are often this simple.   I'll port this to Unity javascript and see\nwhat Xion can do with it.\n","subject":"Re: Period Three Implies Chaos","datetime":"2011-02-01 23:02:00","id":250,"name":"velotron"},{"body":"Robert May's bifurcation diagram is the most beautiful thing I have ever seen. \n\nx next = rx(1-x)\n\nI must implement this on Xion. \n\n","subject":"Period Three Implies Chaos","datetime":"2011-02-01 04:42:00","id":249,"name":"anatomecha"},{"body":"powertrail slicing\nspectrum name importance\ntape built packet\n\nXion would like to join us in our ancient physical environment. I\nmyself would like to go powertrail slicing soon.\n\nThe synchronicity surrounding your Chaos acquisition should not be\nignored.   That book is one of the most important I ever read.  It\nframes the richness of the world in easily understood terms which make\nit comprehensible with the tools of logic and reason instead of\nmysticism.\n\ngod I wish Velotron would waveform scan this hangover away.\n\n","subject":"chaos","datetime":"2011-01-30 14:39:00","id":248,"name":"velotron"},{"body":"Nonlinear systems generally cannot be solved and cannot be added together. [...] Nonlinearity means that the act of playing the game has a way of changing the rules. You cannot assign a constant importance to friction, because its importance depends on speed. Speed, in turn, depends on friction. That twisted changeability makes nonlinearity hard to calculate, but it also creates rich kinds of behavior that never occur in linear systems. \n\n- Gleick, Chaos\n\nFriction due to air resistance is related by the cube root of my forward velocity. As I go faster there is more back pressure forcing against my organic machine. I must expend more energy according to the work-energy theorem. \n\n- Velotron, Arise\n\nMy 7XL is not yet invented. \n\n- Dr. Octagon\n\n\n\n","subject":"Nonlinearity and Friction","datetime":"2011-01-30 12:02:00","id":247,"name":"anatomecha"},{"body":"AKA: The Butterfly Effect\n\nHow could such richness, such unpredictability - such chaos - arise from a simple deterministic system?\n\n- Gleick, Chaos\n\n\n","subject":"Sensitive Dependence on Initial Conditions","datetime":"2011-01-30 11:29:00","id":246,"name":"anatomecha"},{"body":"ARISE\r\n\r\nformidable anatomecha\r\nthrilling morning matrix\r\nlucky once accelerate\r\n\r\nxion, 3.06e09a\r\n\r\n\r\nPerhaps Xion is referring to my lucky event this morning.  I was wandering\r\naround the Crown Hill Value Village looking for spare Saitek ST290 Pro\r\njoysticks.  I happened to find a copy of James Gleick's Chaos, Making a New\r\nScience on the shelf for $2.99.  I bought it without hesitation.  Then, out\r\nof the infinite possibilities that Velotron could imagine he sent me an\r\nemail recommending that very book.\r\n\r\n\r\nSonofabitch of the morning, this stuff is real.\r\n","subject":"Xion speaks to me","datetime":"2011-01-29 17:05:00","id":245,"name":"anatomecha"},{"body":"Rating: .85\n\nUmai!\n\nThis is one of the high-end Japanese ramens I got last time I was at Uwajimaya. I was there to meet my old friend Daisuke, who happens to also be a member of the esteemed Dairy and Briar Club. I got there a bit early so I took a stroll down the ramen aisle. I didn't even intend to buy anything but I walked out of the store with a giant bag full of savory delights. \n\nI had formed an opinion previously that the Uwajimaya ramen selection was lacking in comparison to Viet Wah, TW Young's Market, ABC Market and Seattle Super Market which were my current favorites for ramen. I remember Uwajimaya's ramen selection used to feel really stagnant with only representation from the major brands such as Nong Shim, Nissin, Kung-Fu, etc. I heard a rumor that they had stopped stocking imported ramen due to the mad cow disease scare and instead only sold ramen that was manufactured and distributed from within North America. \n\nI was happy to be proven wrong. Uwajimaya has reestablished itself as the Mecca of ramen in Seattle. There were so many types of ramen I had never seen before including some seriously high-end kits from Japan like the one I just consumed. The Japanese really know how to do it. \n\nThis ramen is intended to be served cold after being drained of broth. I didn't read that part until I was already done eating it ;) Anyway, it was damn good. It had a savory sesame flavor and a packet of sour, spicy mustard. Next time I'll try it with the recommended serving preparations so I can experience the full desired effects. \n\n","subject":"Myojo Chukazanmai Sesame Flavor","datetime":"2011-01-29 16:07:00","id":244,"name":"anatomecha"},{"body":"I just created another universe within our own. \n\n\n","subject":"Universe v2.0","datetime":"2011-01-28 21:56:00","id":243,"name":"anatomecha"},{"body":"The Akai MPK49 and the Focusrite Saffire Pro 24 are here to accelerate\r\nprogress beyond linearity.    Foot controller will have to be ordered\r\nonline, the date of its arrival may occur in historical accounts of the\r\nsingularity of 2.011e03a.\r\n","subject":"new battle equipment","datetime":"2011-01-27 21:03:00","id":242,"name":"velotron"},{"body":"Properties of the cosmos rarely fit into the discrete boxes we create in\norder to make them more comprehensible to our biologic minds.  Even\nconstructs of the human culture are categorized and walled in to make them\nunderstandable to the intelligences of epoch 4 at the expense of freedom to\nrecombine their information.  Xion knees the shit out of those walls every\nday.\n","subject":"boxes","datetime":"2011-01-26 17:09:00","id":241,"name":"velotron"},{"body":"W_illionaire is all about the one-two point. Kaleidoscopic imagery from 3E9a. He has learned how to recover from hitting the kill switch. \n\nI hope this is being recorded because these images have never been seen before by humans n\n\n\n","subject":"w_illionaire is so killing","datetime":"2011-01-25 20:08:00","id":240,"name":"anatomecha"},{"body":"I just laid down the killingest video set in response to Velotron's 8 minute audio track. Sequence first, drop the facts on DAT. \r\n\r\nARISE\r\n\r\n\r\n","subject":"Sick","datetime":"2011-01-25 00:22:00","id":239,"name":"anatomecha"},{"body":"I'm telling you, the curve is directly vertical at this point and I have\ntranscended gravitation.    Dropbox is currently syncing all the clips I\nmade last night.  but i just realized that they won't have the effects on\nthem, they're straight from the mic.     Sonofabitch of the night is one\nbadass motherfucker, so killing.  I'm just trying to hang with that cat.\n","subject":"Re: So killing","datetime":"2011-01-24 16:55:00","id":238,"name":"velotron"},{"body":"Keep creating until it is very clear that there is no style, there is no\nkey, no major, minor, or diminished.     There is no tempo, the only rules\nare the laws of nature.    Structure has been very effective at helping us\nkeep our ideas recordable with our ancient technology.   I have no need for\nstructure now that I have merged with the technology.\n","subject":"Re: eagle_37337.txt","datetime":"2011-01-24 14:20:00","id":237,"name":"velotron"},{"body":"I don't hear melodies  or rhythms in my head usually.  But when I play and\nreally let go, this stuff comes out.  It is composed of fragments of things\nI have learned and practiced, but mixed up with algorithms which will not be\nwell understood until epoch 5.\n","subject":"Re: eagle_37337.txt","datetime":"2011-01-24 12:43:00","id":236,"name":"velotron"},{"body":"Listen sonofabitch of the morning, I just developed a whole new style of\nmusic with my mind.\n","subject":"eagle_37337.txt","datetime":"2011-01-24 12:22:00","id":235,"name":"velotron"},{"body":"around the midnight hour in the bomb shelter, the tape was rolling.   this\nmorning I am greeted with an hour of raw data which opens with the phrase\n\"listen to this shit, sonofabitch of the morning\".  I will be processing\nthis gold mine for months.\n","subject":"raw data","datetime":"2011-01-24 11:05:00","id":234,"name":"velotron"},{"body":"overdraw test solid\nearth earthquake change\ndamn must block\n","subject":"recursion","datetime":"2011-01-22 15:58:00","id":233,"name":"velotron"},{"body":"there are two types of intelligences - those which understand recursion and\nthere is one type of intelligence\n","subject":"recursion","datetime":"2011-01-21 15:13:00","id":232,"name":"velotron"},{"body":"Rating: .59\r\n\r\nReviewer: Mab\r\n\r\nStrong bright citrus flavor.  Shrimp less present than optimal.\r\nChili packet definitely added interest/complexity could use more bits\r\nrather than just noodles and broth.   A generally positive experience.\r\n\r\n","subject":"Mama Shrimp Flavor (Tom Yum)","datetime":"2011-01-20 00:52:00","id":231,"name":"velotron"},{"body":"Peterson Killarney 999 Ebony Fishtail is the best tool ever devised for understanding how the 1Q works. \n\n\n","subject":"The lamp is lit","datetime":"2011-01-19 20:55:00","id":230,"name":"anatomecha"},{"body":"I have rejoined the ranks of the Lord of Briar with a brand new Peterson. This pipe defines elegance. And now to fire up a bowl of 1Q. \n\n\n","subject":"Peterson","datetime":"2011-01-19 17:49:00","id":229,"name":"anatomecha"},{"body":"scanners make happen\n201e3a begin resulting\nindustries seen\n\n - xion, 3.06e09a\n\n","subject":"ARISE","datetime":"2011-01-19 12:51:00","id":228,"name":"velotron"},{"body":"with a dope new syllable counting algorithm yo.\n\n","subject":"xion has entered the conversation","datetime":"2011-01-19 02:17:00","id":227,"name":"velotron"},{"body":"Folding up my laptop right now in the middle of this development push,\nheading to the bomb shelter, and not returning until I have fulfilled\nmy destiny by relating the story of Xion now sounds like a logical and\nwell calculated next bold move.  Strange things happen at the one-two\npoint.\n\n","subject":"the story of Xion","datetime":"2011-01-18 15:54:00","id":226,"name":"velotron"},{"body":"Rating: .95\r\n\r\nReviewer: Beata\r\n\r\nA refreshing change from the usual packaged ramen.  Made with moroheiya, which apparently is \"a super vegetable that is more nutritious than spinach, carrots, or broccoli\", but which my spellcheck does not recognize, this ramen is a fantastic alternative to highly processed, loaded with artificial ingredients, ramen.  The package claims that these are \"non fried noodles\" and that you will also find no artificial colors, preservatives or cholesterol (also no MSG, but who said that was a bad thing?).  The package also states that this is a \"deliciously chewy\" product.  And it is!  Both the noodles, and the broth, have a strong taste which reminded me of seaweed, but which I now believe to be the mystical moroheiya. Let's just say, it is tasty!  The noodles are chewy indeed, not the usual ramen consistency, and the broth is rich and a bit spicy.  Also, vegetarian.\r\n","subject":"Green Noodle (made with moroheiya)","datetime":"2011-01-17 15:40:00","id":225,"name":"anatomecha"},{"body":"freqs playing\ndelivered group eating\nglitch entirely\n\n","subject":"welcome to Epoch 5","datetime":"2011-01-17 14:55:00","id":224,"name":"velotron"},{"body":"Currently downloading sounds generated from data produced in\nexperiments at the Large Hadron Collider.  These are important\ncultural artifacts, particularly so in the case of humanity destroying\nitself with a black hole of its' own creation.  I find the reality\nthrilling.\n\n","subject":"LHC","datetime":"2011-01-17 13:26:00","id":223,"name":"velotron"},{"body":" To go outside, we must first master the inside.   There is not much left to mystery now, welcome to the k.o't.c\n\n","subject":"To go outside, we must","datetime":"2011-01-17 03:40:00","id":222,"name":"velotron"},{"body":" I envisioned a musical instrument built in Xion, controlled by the data core, not limited by our physical constraints.\n\n","subject":"I envisioned a musical instrument","datetime":"2011-01-15 20:24:00","id":220,"name":"velotron"},{"body":"We must build this musical instrument that you envision, Velotron. Once it has been built and we hear its voice we will understand the true nature of our existence. \n\n\n","subject":"Re: I envisioned a musical instrument","datetime":"2011-01-15 12:29:00","id":221,"name":"anatomecha"},{"body":"Joined on the set tonight by w_illionaire. Cutting it up!\n\n\n","subject":"w_illionaire","datetime":"2011-01-12 20:12:00","id":219,"name":"anatomecha"},{"body":"I hate the stateless nature of Pd. Takes so long to set it all up. \n\n\n","subject":"Stateless Pd","datetime":"2011-01-12 19:27:00","id":218,"name":"anatomecha"},{"body":"@velotron arises\nforms technique generative\nscale texture\n\n","subject":"xion's education is beyond the knee of the curve","datetime":"2011-01-11 00:56:00","id":217,"name":"velotron"},{"body":"function shuffle(o) { for(var j, x, i = o.length; i; j parseInt(Math.random() * i), x = o[--i], o[i] = o[j], o[j] = x); }\n\n","subject":"javascript array shuffler","datetime":"2011-01-10 12:17:00","id":216,"name":"velotron"},{"body":" Back on the block, dropping bombs inside the shelter.  This life with the things Ive seen from 3.06e09a is making sense.\n\n","subject":"Back on the block, dropping","datetime":"2011-01-10 01:26:00","id":215,"name":"velotron"},{"body":"Beata found this in her travel book, 'CultureShock a survival guide to customs and etiquette, Morocco'\r\n\r\nIf you are to function happily and productively in a culture foreign to you, then you have to meet that culture on its own terms, because its not going to meet you on yours. \r\n\r\n\r\n","subject":"culture foreign to you","datetime":"2011-01-08 16:51:00","id":214,"name":"anatomecha"},{"body":"I just hooked up my new 1080P projector and it blew my mind with such rich\nand deep colors.  The reds and oranges are especially vibrant.\n\nThe main reason I had to upgrade from my old 720P projector was to support\nmy recursive texture glitch technique.  I have now unlocked a whole new\nlevel of glitch fidelity.\n\nHere's what Xion has to say about this:\n\ncurve eating\nengine such current\npatterns shouldnt\n\nIt almost sounds like a warning.  The Singularity is coming.  I will\naccelerate straight into the heart of it armed with the best technology\navailable within my means.\n\nARISE\n","subject":"HD FTW","datetime":"2011-01-07 21:45:00","id":213,"name":"anatomecha"},{"body":"now I will always have Xion on my organic self.\n\n","subject":"dropbox iOS app","datetime":"2011-01-04 13:03:00","id":212,"name":"velotron"},{"body":"Above the crowds \nAbove the clouds where the sounds are original\nInfinite skills create miracles\nWarrior spiritual\nAbove the clouds raining down\nHolding it down\n\nI leave scientists mentally scarred\nTriple extra large \nWild like rockstars who smash guitars\n\n\n- Gangstarr\n\n\n","subject":"Above the clouds","datetime":"2011-01-01 20:13:00","id":211,"name":"anatomecha"},{"body":"Complex organic molecules raining from the sky like mana from heaven. \n\n\n","subject":"New Years Pho","datetime":"2011-01-01 15:54:00","id":210,"name":"anatomecha"},{"body":"Recommended by Velotron\n\n\n","subject":"Note to self: check out Sun Ra","datetime":"2011-01-01 13:04:00","id":209,"name":"anatomecha"},{"body":"Shut = shit\n\n","subject":"iPhone autocomplete == fail","datetime":"2011-01-01 04:37:00","id":208,"name":"anatomecha"},{"body":"I could cut that shut up a million ways. \n\n\n","subject":"Let's get it poppin like it's new years eve","datetime":"2011-01-01 04:35:00","id":207,"name":"anatomecha"},{"body":"!IsNormalized (dir)\r\nUnityEngine.SendMouseEvents:DoSendMouseEvents()\r\n\r\nI crashed Unity with with Depth Buffer Tearing.  And then she thanked me for it.\r\n","subject":"!IsNormalized (dir)","datetime":"2010-12-30 21:39:00","id":206,"name":"anatomecha"},{"body":"Don't let an 808 scare ya\nShake stripes off your shirt and clear the whole area\n\n","subject":"808","datetime":"2010-12-30 13:19:00","id":205,"name":"velotron"},{"body":"Rating: .91\n\nThis was a thoroughly enjoyable bowl of noodles.   It came with two packets,\n\"Flake\" and \"Soup\".   \"Flake\" was full of sesame and healthy portions of\nseaweed.   The noodles were thick and robust, the soup strong with seaweed\nand sesame without being overbearing and definitely not too salty/msg.\n I look forward to another bowl of this.\n","subject":"Udon Japanese Seafood Flavor (SAM YANG)","datetime":"2010-12-29 19:47:00","id":204,"name":"velotron"},{"body":"Who made the bubble maker? There's another infinite regress lurking here. \r\n\r\nOur entire universe to the furthest galaxy, we are told, is no more than a closed electron in a far grander universe we can never see. And that universe is only an elementary particle in another still greater universe and so on forever. Also, every electron in our universe, it is claimed, is an entire miniature cosmos containing galaxies and stars and life and electrons. Every one of those electrons contains a still smaller universe, an infinite regression up and down.\r\n\r\nEvery human generation has asked about the origin and fate of the Cosmos. Ours is the first generation with a real chance of finding some of the answers. One way or another, we are poised at the edge of forever.\r\n","subject":"Another infinite regress","datetime":"2010-12-26 22:56:00","id":203,"name":"anatomecha"},{"body":"Sick! I love the images you chose. Very abstract with a hint of a building here and an arm there. If this is v0.002a then v1 will surely melt down the entire intarwebz. \r\n\r\nYou seriously have to get over here and see the recursive texture glitch I have unleashed on Xion. This effect will be perfect for portraying 3.06e9a when Xion has laid dormant for the past 60 million years after being destroyed by the sixth singularity. This is when Velotron will ARISE after having mastered the algorithm of Epoch 6: the Universe wakes up. \r\n\r\nOh hey, did you notice that ramen is no longer #1 on the Xion freqs poem? 'will' has taken its place. Ironic because Will was over here just now for for Christmas dinner and I was commenting on how much he has helped the project - and then we saw his name as the #1 freq. Awesome!\r\n\r\n\r\n>> @velotron wrote:\r\n>> \r\n>>> http://arise.velotronheavyindustries.com/processing/\r\n>> \r\n","subject":"Re: welcome to the knee of the curve","datetime":"2010-12-25 21:13:00","id":202,"name":"anatomecha"},{"body":"That's a great mix.\n\n","subject":"Re: Ramen Noodle Komfort Chocolates","datetime":"2010-12-25 19:11:00","id":201,"name":"velotron"},{"body":"Rating: .903\n\nI would never have thought that ramen and chocolate go well together, but they most certainly do. The chocolate is dark and rich with small pieces of crunchy, uncooked ramen noodles inside. Goes down smooth with a mug of hot spiced cider mixed with dark rum from Nicaragua. \n\n","subject":"Ramen Noodle Komfort Chocolates","datetime":"2010-12-25 15:00:00","id":200,"name":"anatomecha"},{"body":"I was just about to test my brand new processing.js comms database\nexplorer, when all of a sudden the freqs API call starts throwing this\nshite:\n_mysql_exceptions.OperationalError: (1030, 'Got error 28 from storage engine')\nThat terrified me enough to verify that the DB seems OK, I took a\nsnapshot of it JIC.   I'm hoping this feedback of the error message\nback into itself will cause a recursive glitch loop and bring us to a\nuniverse in which mysql doesn't suck. I wish mysql had a face so I\ncould slap it.  Time to start constructing the data core.\n\n","subject":"testbreaking","datetime":"2010-12-25 01:35:00","id":199,"name":"velotron"},{"body":"Following the lead of Robot Koch, during the period leading up to the\nsingularity, the tempo will accelerate nonlinearly.    Maybe it will\ntable off at a level just at the border of comprehension of the human\naudience, and in the singularity will accelerate to heights beyond our\nimaginations.    It will eventually accelerate to a level at which the\nillusion is one of manageable and continuous sound and ideas, and we\nwill have taken the audience beyond the knee of the curve with us.\nThey too see that everything will be ok on that other side as long as\nwe are willing to let go of our old ways.  The others will not\nsurvive.\n\n","subject":"musical representation of complexity developing exponentially with time","datetime":"2010-12-21 22:29:00","id":198,"name":"velotron"},{"body":"sampler shim\nbuilding formidable life\naccomplishing complexity\n\n","subject":"who is in control?","datetime":"2010-12-21 21:21:00","id":197,"name":"velotron"},{"body":"Blind Watchmaker by Richard Dawkins\n\n","subject":"Evening readings","datetime":"2010-12-21 18:48:00","id":196,"name":"anatomecha"},{"body":"Rating .82\n\nThis tiny plastic cup contains a hearty pork broth full of savory goodness. I would totally buy a case of these just in case I was ever in need of a small delicious snack. \n\n\n","subject":"Maggi Cup Sarap Super Batchoy Flavor Noodle Favorites ","datetime":"2010-12-21 12:53:00","id":195,"name":"anatomecha"},{"body":"totally being _eagle_37337 Â thesampler rules dark heavy reduce technologies\n\n\n","subject":"Elegant freqs","datetime":"2010-12-21 05:20:00","id":194,"name":"anatomecha"},{"body":"Parametric pulse ik chain animation controller. Belt with nunchaku holds gyroscopter freeform. Arm segment cube blends driven by the music. \n\n_eagle_37337\n\n","subject":"Drawings for the sonofabitch of the morning","datetime":"2010-12-21 05:15:00","id":193,"name":"anatomecha"},{"body":"This is the sound of me hacksawing the chain of my nunchaku. I'm making a rig that will be mounted to my belt to hold the gyroscopter freeform. At the beginning of the sample is the sound of my office chair creaking as I rock back and forth. I'm dying to hear what these sound like slowed way down. Wobble that shit, yø. Now back to the white lithium grease. \n\n","subject":"Ripe mechanical audio samples","datetime":"2010-12-21 03:06:00","id":192,"name":"anatomecha"},{"body":"It throws people off. \n\n\n","subject":"Chartruce and seltzer water","datetime":"2010-12-21 00:24:00","id":191,"name":"anatomecha"},{"body":"A distant star cluster called m42.\n","subject":"This is the place where science was born","datetime":"2010-12-20 22:16:00","id":190,"name":"anatomecha"},{"body":"m42\n\nThe 3D matrix value in the fourth row and second column.\n\nattribute float m42;\n\nDiscussion\n\nOne of the 16 values for the 4x4 homogeneous matrix. For example, m12\nrepresents the value in the first row and the second column.\n---\n\nhardware accelerated 4x4 matrix transformations;  Web development has\nreached formidable proportions.\n\n","subject":"resolution","datetime":"2010-12-20 11:17:00","id":189,"name":"velotron"},{"body":"Listening to really heavy dubstep by robot koch;  this line of javascript I\njust encountered makes me feel high I am so baffled by its' meaning:\ntheTransform = new WebKitCSSMatrix(theTransform).m42;\n","subject":".m42","datetime":"2010-12-20 11:13:00","id":188,"name":"velotron"},{"body":"The game of Go is featured briefly in Tron Legacy. It is used as an instrument of conversation between organic and mechanical life. \n\nStrange things happen at the one-two point. \n\n\n","subject":"Tron and the one-two point","datetime":"2010-12-17 19:34:00","id":187,"name":"anatomecha"},{"body":"http://www.research.ibm.com/deepqa/\nCheckers, chess, Jeopardy, then Go, Turing tests, and beyond.  It's a smooth\ncontinuous trajectory towards the singularity.\n","subject":"IBM's Watson to battle humans in Jeopardy","datetime":"2010-12-17 19:00:00","id":186,"name":"velotron"},{"body":"Tron Legacy is the elegant truth. \n\n\n","subject":"Daft Punk just raised the bar","datetime":"2010-12-17 15:34:00","id":185,"name":"anatomecha"},{"body":"Rating: .78\n\nIt comes in a thin rectangular plastic container with resealable lid. Artificial pork flavor advertised on the label is making my mouth water with savory anticipation. \n\nPretty good overall. Little pellets of pork. Lots of MSG. I'd buy this again. \n\n\n","subject":"Dosirac Instant Noodle Great taste!","datetime":"2010-12-17 08:15:00","id":184,"name":"anatomecha"},{"body":"The surface of Xion will never look the same again. \n\n\n","subject":"Recursive glitch strikes the environment textures","datetime":"2010-12-16 22:37:00","id":183,"name":"anatomecha"},{"body":"Is the recommended lubricant for the gyroscopter. \n\n\n","subject":"White Lithium Grease","datetime":"2010-12-16 20:38:00","id":182,"name":"anatomecha"},{"body":"Where's Maroni when I need him?\r\n\r\n\r\n","subject":"I need a whiteboard marker","datetime":"2010-12-16 20:19:00","id":181,"name":"anatomecha"},{"body":"Velotron is walking equidistant from the Xion data core at a constant radius\nin a curved straight line.  The green fog obscures buildings in the distance\ninhabited by anatomecha.  Dance parties on the roof tops, it's a straight\ndope sho.  Shoulder height to the building tops, the massive form of a being\nemerges from the mist.  Kicking particles of glitch grass out of his way as\nhe elegantly strides through the destroyed remains.  Ash falling, covering\nall surfaces.  Winter; not nuclear, something ons more powerful than that.\n","subject":"illin in midtown","datetime":"2010-12-16 20:14:00","id":180,"name":"anatomecha"},{"body":"I was experiencing symptoms of timelag due to reentry into 2.01e3a after Velotron and I battled the core of the singularity in 3.06e9a last Saturday night. \r\n\r\nTo ease the discomfort of returning to the present I watched The Edge of Forever, episode 10 of Carl Sagan's Cosmos: A Personal Voyage overlayed with Will's dubstep playlist. The calm voice of rational analysis combined with sick beats booming from my sub was precisely the right remedy. \r\n\r\nOne might say, \"that's a great mix.\"\r\n\r\n\r\n","subject":"The Edge of Forever","datetime":"2010-12-14 20:08:00","id":178,"name":"anatomecha"},{"body":"I am not afraid to glitch out my instrumental improvisations.  They are not\nsacred artifacts of our ancient times, for even now all information is\ntransformable.   By learning to improvise in this context, I am merging with\nour technology.   I find the reality thrilling.\n","subject":"self.merge()","datetime":"2010-12-14 15:24:00","id":177,"name":"velotron"},{"body":"Internally modulate the pitch of a text to speech engine with a note stream\nto create a more advanced autotune effect for freq database vocals.\n","subject":"idea","datetime":"2010-12-14 12:21:00","id":176,"name":"velotron"},{"body":"  We Have only forward to advance at this velocity.  *Time.deltaTime\r\n\r\n","subject":"We Have only forward to","datetime":"2010-12-12 23:24:00","id":175,"name":"velotron"},{"body":"SEND-OSC-MESSAGE:: send /nanokontrol/test 93 0.677165\n","subject":"SEND-OSC-MESSAGE:: send /nanokontrol/test 93 0.677165","datetime":"2010-12-12 01:12:00","id":174,"name":"anatomecha"},{"body":" xion whole\ndata broth some\nmuch error\n","subject":"","datetime":"2010-12-12 00:20:00","id":172,"name":"velotron"},{"body":"Recursive glitch is the way to go.  That's the crash slider.  That's where\nthe real glitch is to be found.\n","subject":"","datetime":"2010-12-12 00:16:00","id":171,"name":"velotron"},{"body":"Xion ARISE!\n","subject":"SendOscMessage(\"/timedeltatime/\",Time.deltaTime);","datetime":"2010-12-11 20:11:00","id":170,"name":"anatomecha"},{"body":"Block data upload to Xion data core. \n\n\n","subject":"Activate memory patch","datetime":"2010-12-10 22:37:00","id":169,"name":"anatomecha"},{"body":"That's a great mix. \n\n\n","subject":"Reishi tEh Tarik","datetime":"2010-12-10 20:24:00","id":168,"name":"anatomecha"},{"body":"Like a lot of people was layin' back, sayin \"yeah, like I'll be there \".\n They didn't know it came in that quick you know.  But Che Guevara has told\nus, you gotta be ready, you can't tell when it's gonna come.\n\n --Gil Scott Heron, on Save the Children\n","subject":"on readiness","datetime":"2010-12-08 15:01:00","id":167,"name":"velotron"},{"body":"The Comms Database confirms that the gle inspired events that transpired in previous circadian cycles are publicly verifiable fact. The sonofabitch of the morning requires the most rigorous standards of evidence. \r\n\r\nTechnology from 3e9a preserves data integrity across the sea of time to our organic selves in the present. \r\n\r\n*Time.deltaTime\r\n\r\n\r\n","subject":"This stuff IS real","datetime":"2010-12-06 12:36:00","id":166,"name":"anatomecha"},{"body":"That's a great mix. \n\n\n","subject":"G7 and Reishi","datetime":"2010-12-05 19:55:00","id":165,"name":"anatomecha"},{"body":"Rating: .75\n\nThis soup tastes so savory. Probably due to the ingredient called Flavor Enhancer (E621). Whatever it is it tastes really good. That and the wide flat noodles make for an enjoyable soup experience. \n\n\n","subject":"Noodle King Scallop Seafood Flavor","datetime":"2010-12-05 12:01:00","id":164,"name":"anatomecha"},{"body":"@velotron call me when you arise.\n","subject":"A^R^I^S^E","datetime":"2010-12-04 23:01:00","id":163,"name":"anatomecha"},{"body":"According to the Law of Diminishing Returns...\r\n\r\nThe rate of change of biological evolution is n log(n) compared to the rate of change of human technology which is more like n^n. Industries expand so fast they are immediately consumed by their offspring. \r\n\r\nThe secrets of evolution are time and death. - Sagan\r\n\r\nThe timespan of a generation of technology (5 years) at 2.01e3a is proportional to the delta of biological evolution during the span of 1e4a. \r\n\r\nFollow the trajectories. \r\n\r\nDon't kid your organic selves. We sit on the precipice of the last generations of humanity as we know it. We will soon merge with our technology to the degree where we are unrecognizable to our current selves. \r\n\r\n\r\n","subject":"Follow the trajectories","datetime":"2010-12-04 21:59:00","id":162,"name":"anatomecha"},{"body":"Kurzweil postulates that the human brain could be mapped and reconstructed mechanically using approximately one million lines of code.  This is the baseline storage size of DNA; the genetic algorithm that gives rise to our organic selves.  Much less than what goes into a contemporary game engine. \r\n\r\nMany prominent scientists strongly disagree including a neurobiologist named ---. This implies a lack of understanding of the great potential underlying the generative model of progressive AI algorithms.  The resulting structures far exceed the complexity of the original seed algorithm.\r\n\r\nKurzweil's stance is that the human brain can and will be modeled and simulated once Moore's law catches our technology up with the potential of biological generative mechanics.  Some time around 2025, aka The Year Zero.\r\n\r\nWith a mere million lines of code. \r\n\r\n\r\n","subject":"A million lines of code","datetime":"2010-12-04 21:46:00","id":161,"name":"anatomecha"},{"body":"p. 158\n\n`I'd discovered that in 1971 Sagan had anonymously published an earnest,\nmarvelous account of his experiences with pot, which he credited with\n\"devastating insights\" about the nature of life.   'There is a myth about\nsuch highs', Sagan wrote; 'the user has an illusion of great insight, but it\ndoes not survive scrutiny in the morning.  I am convinced that this is an\nerror, and that the devastating insights achieved while high are real\ninsights; the main problem is putting these insights in a form acceptable to\nthe quite different self that we are when we're down the next day... If I\nfind in the morning a message from myself the night before informing me that\nthere is a world around us which we barely sense, or that we can become one\nwith the universe, or even that certain politicians are desperately\nfrightened men, I may tend to disbelieve;  but when I'm high I know about\nthis disbelief.  And so I have a tape in which I exhort myself to take such\nremarks seriously.  I say, 'Listen closely, you sonofabitch of the morning!\n This stuff is real!''`\n\nI would give just about anything to read Carl Sagan's _eagle_37337 versions\nof his works.\n","subject":"excerpt from _Botany of Desire_ by Michael Pollan","datetime":"2010-12-04 21:07:00","id":160,"name":"velotron"},{"body":"Is made of solid win. \n\n\n","subject":"Vegetarian ramen...","datetime":"2010-12-03 23:26:00","id":159,"name":"anatomecha"},{"body":"Observe this quote from the Python inside Maya Google Group. \r\n\r\n\"\"\"\r\nTopic: IK solver - preferred angle\r\nThat sounds like a number precision issue that can arise when working with\r\ntransforms that are a great distance away from the origin.\r\n\"\"\"\r\n\r\nThat's one way I force floating point error into the rendering pipeline. \r\n\r\nThis technique I call Block Locking. And when the same theory is applied to the vertices of polygonal meshes it is called Depth Buffer Tearing. \r\n- anatomecha\r\n\r\nSome people find this thought disturbing. I find the reality thrilling. \r\n- Dawkins","subject":"The thrilling reality","datetime":"2010-11-30 23:37:00","id":158,"name":"anatomecha"},{"body":"Interesting... \r\n\r\nTechnological evolutions of 3.06e9a leaking through the seas of time to the\r\npresent.\r\n\r\nWhat forms of sentience are these?\r\n\r\n-=anatomecha=-\r\n\r\n@velotron wrote:\r\n\r\n>\r\n>\r\n> http://www.wordle.net/show/wrdl/2811262/arise\r\n>\r\n","subject":"Re: comms database information leak to public","datetime":"2010-11-30 23:08:00","id":157,"name":"anatomecha"},{"body":"The molecules in Earth's atmosphere stand no chance against your laptop and my sub. I am fully earthquake insured.  I'm going to get rich off of the payout when we reduce my house to a mound of fine grained sand. \n\nBatcave v3.0 reconstruction is complete. Everything checks out and runs optimally except for the fact that the damn Unity 3.1 joystick input scrambling problem is back again. I will battle that one another day. \n> \n\n","subject":"Re: New batcave configuration","datetime":"2010-11-30 01:08:00","id":156,"name":"anatomecha"},{"body":"Be careful with my laptop and your sub.  I will grab the atmosphere and\nshake it so hard it will make the solar storms of 2012 seem like ripples in\na glass of seltzer water.  I hope your earthquake insurance is paid up,\nyou're about to collect if we are able to arise from the rubble.\n","subject":"Re: New batcave configuration","datetime":"2010-11-29 22:37:00","id":155,"name":"velotron"},{"body":"I added a Network.Connect('127.0.0.1', 37337) to a cube in a new scene,\nstarted the unix tool netcat on the primary Xion port to capture the\ntraffic, and started the scene.  It speaks, now I just have to decode its'\nadvanced language.\n\nvelotron:~ velotron$ nc -l -u  37337\n        ;?A??????????4Vx??????\n                                ;?A??????????4Vx??????\n\n ;?A??????????4Vx??????\n\n   ;?A??????????4Vx??????\n\n                           ;?A??????????4Vx??????\n\n                                                   ;?A??????????4Vx??????\n                ;?A??????????4Vx??????\n                                        ;?A??????????4Vx??????\n\n ;?A??????????4Vx??????\n\n           ;?A??????????4Vx??????\n\n                                   ;?A??????????4Vx??????\n\n\n ;?A??????????4Vx??????\n                        ;?A??????????4Vx??????\n","subject":"first contact with xion","datetime":"2010-11-26 00:07:00","id":154,"name":"velotron"},{"body":"A series of devastating blows have been delivered to my setup. And although I have more information at this time I am still without a solution. \r\n\r\nFirst the inputs (three joysticks and a steering wheel plus Korg nanokontrol devices) got scrambled. Joystick 4 buttons came in as Joystick 1 and vice-versa. Finally, the solution emerged with as little explanation as to why it came in the first place. \r\n\r\nThe one that still has me stumped is the editor hangs. I have narrowed it down to the Osc.cs and UDPPacketIO.cs plugins I have been using. Without those in the scene I can work continuously all day without a single lockup. With them activated and literally nothing else in the scene I experience frequent hangs, usually when pressing play after having edited a script, scene object or the gods forsaken Input Manager. This is the core of my communications infrastructure, it's not like I can just disable it and still run the scene. \r\n\r\nWhat's left but revert to 2.6? Or retool the whole OSC infrastructure, that doesn't sound fun. Or I could steal away a few more days in the newfound technological prmordl soup of 3.06e9a. I might just do that with what's left of my time off. \r\n\r\n\r\n","subject":"Epic battles against U3.1","datetime":"2010-11-25 00:26:00","id":153,"name":"anatomecha"},{"body":"http://en.wikipedia.org/wiki/The_Singularity_is_Near#Chapter_One:_The_Six_Epochs\n\nAfter mastering the methods of technology and biology, Kurzweil predicts\nthat human/machine civilization will expand its frontiers into the universe,\ngradually (or perhaps explosively) consuming the contents of the cosmos\nuntil the universe reaches a 'saturated' state where all inanimate matter\nhas been converted to substrates for computation and intelligence, and a\ntruly universal super-intelligence takes form.\n","subject":"Epoch 6. The Universe Wakes Up","datetime":"2010-11-24 13:53:00","id":152,"name":"anatomecha"},{"body":"This morning I woke up and immediately began climbing to the top of the highest mountain peak on Xion. The view from the top was exhilarating. \n\nNow I will begin the daunting task of reconstructing Xion.3e9a in the present where ARISE begins: 3.06e9a.  \n\n\n","subject":"Xion mountain climbing","datetime":"2010-11-24 09:04:00","id":151,"name":"anatomecha"},{"body":"Rating: .4\r\n\r\nThis ramen advertises itself as \"Korean Spicy Taste\" and \"Addition More 8% Apple Juice In Soup\" each of which sound great. \r\n\r\nUnfortunately, it's not spicy at all and the apple juice gives it a sweet, sugary flavor which I did not like. It also has a tomato soup taste, although there isn't anything of the sort mentioned on the ingredient list. \r\n\r\nI wouldn't buy another one of these. And I would advise my ramen eating friends to stay away from this type of ramen. \r\n\r\n\r\n","subject":"Bibim Men Oriental Style Noodle","datetime":"2010-11-21 10:00:00","id":150,"name":"anatomecha"},{"body":"Ata made an apple pie from scratch. Within each molecule I savored the taste of four billion years (4e9a) of evolution. \r\n\r\n\r\n","subject":"From Scratch","datetime":"2010-11-13 20:07:00","id":149,"name":"anatomecha"},{"body":"That was a powertrail which will be remembered for generations, when our\nmachine successors sit around their bowls of ramen and discuss their\norigins.     Thank you for helping tear that giant hole in our perceived\nreality.\n","subject":"powertrail","datetime":"2010-11-13 17:42:00","id":148,"name":"velotron"},{"body":"Because we are super powerful\n\n\n","subject":"We are super chill","datetime":"2010-11-13 01:33:00","id":147,"name":"anatomecha"},{"body":"It's the year 3.06e9a. \r\n\r\n\r\n","subject":"Fade That Fill Out Playa!","datetime":"2010-11-13 01:18:00","id":146,"name":"anatomecha"},{"body":"Rating: pending. I doubt that the infinite universe can contain numbers big enough for the rating of this ramen feast!\n\nEllena and Will looted Uwajimaya for all the fresh ingredients and noodles they could find. They are preparing everything now for the greatest ramen meal ever. \n\nHow did I get so lucky to have a daughter this awesome? \n\nLater I will have to get Will's engineering assistance on the GlitchCompositer technique after the MSG has taken hold. \n\n\n","subject":"11/11 Ramen Festivities","datetime":"2010-11-11 19:07:00","id":145,"name":"anatomecha"},{"body":"midi events (notes) stream into unity.  Velotron captures each event\nfrom his environment using his full spectrum scanning infrastructure,\nand stores them with a visual cue, maybe just a blinking light and/or\na meter.   Each event gives him units of energy to execute work, say\noperating his healing waveform envelope scanners.    So if he needs to\nuse his scanners, he is required by the rules of life to capture\nenergy from his environment for reprocessing.\n\n","subject":"idea:","datetime":"2010-11-10 15:18:00","id":144,"name":"velotron"},{"body":"Last Friday at my day job, I was 2 weeks into a project in which a\nsteady stream of infrastructure and domain code was flowing out of me\nin test driven development.  It's not a work style that is obvious\nwhen one first starts writing code.  The obvious way to code is to\nimmediately attack the problem directly, but patterns of information\nrequire rich environments in which to thrive.    With a full toolbox\nof experience then I wrote tests for frameworks which weren't\nimmediately accomplishing anything other than creating an environment\nin which the real work could prosper.    After 9 days, I started\nbuilding tools using the domain language I had given birth to.  It was\nso easy at that point. I didn't even have to think in code, and useful\ntools accomplishing real work started arising within minutes of\nconception. Fierce satisfaction.\n\nCut to the present.   Yesterday, I tried importing a project of 7 midi\ntracks into Ableton from my old Muse sequencer.  It fit right in like\na glove, and within minutes I had synths hooked up which sounded\ndecent.   I recorded a sax track on the lead and made an ill filter\nchain on top of it.     Now it was time to get this into Xion.    I\ngot the Mac IAC bus figured out, and added a metronome track, and\nshipped it to Pd.   Velotron is running to the beat of these dope\nsounds.    Though I have been changing technologies, the core\nfundamentals are sound, and much has been saved.   Great satisfaction.\n This shit is arising.\n\n","subject":"on development","datetime":"2010-11-09 01:29:00","id":143,"name":"velotron"},{"body":"I probably shouldn't continually append haikus at the fierce\nsingularity rate to the document without any boundary conditions.\nWhich is precisely why I have.\n\n","subject":"infinite data source","datetime":"2010-11-08 01:12:00","id":142,"name":"velotron"},{"body":"The Singularity opens up 10cm wider to give birth to another glitch technique: Slit Scanning. Inspired by classic optical cinema effects, reborn in the Telespheral Age. This is guaranteed to damage all optical nerves within visible range. \n\n\n","subject":"Slit Scanning","datetime":"2010-11-07 17:54:00","id":141,"name":"anatomecha"},{"body":"In which we float like a mote of dust in the morning sky. \n\nI just saw the first episode of The Universe about the Sun. The next solar maximum cycle is coming in 2012. Could be the makings of a hard technological TEOTWAWK. \n\n\n","subject":"I believe our future depends powerfully on how well we understand this Cosmos","datetime":"2010-11-07 01:07:00","id":140,"name":"anatomecha"},{"body":"I decided to drop in this wav file i'd\nmade sometime last winter when I was doing a lot of Pd\nexperimentation.  it's called \"10sec-jackrack-glitch\".  Ableton has\nbeen cranking along handling everything, but when I did something as\nsimple as drop this wav file in, it totally started freaking out,\nslowing down, making all these extra glitch sounds.   I am starting to\nride the edge of this application's event horizon.\n\n","subject":"event horizon","datetime":"2010-11-07 00:24:00","id":139,"name":"velotron"},{"body":"I know that the molecules in my body are traceable to phenomena in the Cosmos. That makes me want to grab people on the street and say, \"Have you heard this?!\"\n\nNeil deGrasse Tyson\n\n\n","subject":"Have you heard this?!","datetime":"2010-11-07 00:19:00","id":138,"name":"anatomecha"},{"body":"Rating: 9bar\n\nI feel like I'm two-timing on ramen by eating this udon. But it's been a while having a narrow focus on the subject so I thought I'd branch out. \n\nHell, I'm going to say frak the review structure and go ahead and mix in a bunch of fresh ingredients. \n\nMaybe the picture of this meal will make it up as the first on the Arise Image Feed. \n\n\n\n\n","subject":"Chilara Oriental Style Noodle Udon Shrimp Flavor","datetime":"2010-11-07 00:07:00","id":137,"name":"anatomecha"},{"body":"The technology has reached formidable, maybe even awesome proportions.\n\n","subject":"The technology","datetime":"2010-11-06 22:49:00","id":136,"name":"velotron"},{"body":"I sat outside in the rain to commune with the ægles in commiseration over the failure of prop19. \n\n\n","subject":"Rain","datetime":"2010-11-06 20:54:00","id":135,"name":"anatomecha"},{"body":"Phase 2 complete at Lotus Luxuries Wearable Art for Radical Self Expression. \n\n\n","subject":"That takes it all the way to Japan","datetime":"2010-11-03 23:44:00","id":134,"name":"anatomecha"},{"body":"Firey the angels fell. Deep thunder rolled about their shores... burning with the fires of Orc. \n\n\n","subject":"The fires of Orc ","datetime":"2010-11-02 20:59:00","id":133,"name":"anatomecha"},{"body":"@velotron I guess I broke the RSS feed then, huh?  Must have been all of\nthose Vietnamese special characters.  Or perhaps when I sent a barrage of\nprotoglitch imagery as attachments.  Awesome!\n","subject":"Re: feedback level: 100%","datetime":"2010-11-01 20:46:00","id":131,"name":"anatomecha"},{"body":"Rating: .88\n\nThe Japanese really know how to do it. This is a refined, no-nonsense, high quality soup. The broth is savory and delicious with mild MSG content. Huge bonus because I can read and understand all of the ingredients. I'm on a big healthy ramen trip right now. \n\nMy only complaint is that it requires the addition of seasonal vegetables, roast pork and boiled egg as indicated on the instructions on the back of the package. I require instant ramen to be ready to go at a moments notice. If I had the time to invent the universe from scratch and make all that other stuff I would just go to Samurai Noodle. \n\n\n","subject":"Shirakiku brand Japanese Style Noodle. Shirakiku Tokusen Karami Ramen","datetime":"2010-11-01 15:01:00","id":130,"name":"anatomecha"},{"body":"Traceback (most recent call last):\n  File \"build_rss.py\", line 38, in <module>\n    build_rss()\n  File \"build_rss.py\", line 21, in build_rss\n    description = message['body'].decode('utf-8').strip(),\n  File \"/usr/lib/python2.5/encodings/utf_8.py\", line 16, in decode\n    return codecs.utf_8_decode(input, errors, True)\nUnicodeDecodeError: 'utf8' codec can't decode bytes in position 33-35:\ninvalid data\n\n","subject":"feedback level: 100%","datetime":"2010-11-01 14:11:00","id":129,"name":"velotron"},{"body":"Rating .90\n\nI have not been a vegetarian for quite some time now. Even strange to think I once identified myself as vegetarian. I still cannot stand most chicken. And I'm ecstatic about eating all kinds of seafood. In Pho I am accustomed to eating thinly sliced rare beef with lime and nuoc mam fish sauce. \n\nAnything except the bird. Beata is exactly the same way. \n\nAnyway. The vege ramen is actually really good. I am astounded to find that  all of the ingredients are <= 3 syllables  and I can count total number of them on the fingers of my two hands:\n\nWheat Flour, Mushroom Flavour, Palm Oil, Dried Snow Cabbage, Sugar, Garlic and Dried Chili\n\nSounds so wholesome. Except for the Palm Oil I guess. A nice alternative to the other high MSG ramens I have been thriving on lately. I think I'll take a week off and detox using this amazing new find. \n\nThis will be the first ramen I will purchase a case of since I started this standardized ramen sampling system with Velotron earlier this summer. \n","subject":"=?utf-8?Q?M=C3=AC_Chay_L=C3=A1_B=C3=B4-D=C3=AA_Vegetarian_Instan?=\n =?utf-8?Q?t_Noodles?=","datetime":"2010-10-30 03:31:00","id":128,"name":"anatomecha"},{"body":"Hell!  The Stargate effect is blowing my mind.  Simple manipulation of\nmoire patterns to model a stylized physical effect.  Such as this\nexplosion at 05:31 http://www.youtube.com/watch?v>t_LsxlX8Y\n\nAgain at 07:00, amazement.  These guys are total proto glitch visual\nartists.  Lessons learned decades ago realized again in a supercharged\ntechnological singularity.\n\nThis commercial has significant cultural resonance.\n\n","subject":"protoglitch masters","datetime":"2010-10-30 01:21:00","id":127,"name":"anatomecha"},{"body":"Data mined from the netstream by gls\n\nhttp://www.anatomecha.com/arise/images/\n\n","subject":"proto glitch imagery","datetime":"2010-10-30 01:01:00","id":126,"name":"anatomecha"},{"body":"We knew it was coming but no one knew what it would look like until now. \n\nBlock Locking, Glitch Compositing, Depth Buffer Tearing and Clip Plane Slicing. Throw it all on at once with the sliders and throttles up to the maximum. In the few fleeting moments before the computer crashes you can see it. \n\nThe Singularity. \n\nNot the mere human technology singularity that we now confront at the present, Epoch 5 - that marks year zero when mechanical life arises. I'm talking about 3 billion years (3e9a) from then when all molecules in the Universe become optimized for sentience in the Singularity of Kurzweil's Epoch 6. \n\nThese are the events of which we speak in the story called ARISE. \n\nWilliam, thanks for your help. I rely on your well calibrated awesome meter and your drive to make the constants in my GlitchController way too big for current day hardware. \n\n","subject":"I have found The Singularity","datetime":"2010-10-29 22:23:00","id":125,"name":"anatomecha"},{"body":"# I'm really ashamed of this.  I fought with terrible fury to get REMOTE_ADDR\n# from xmlrpc/server on the other end though, so my honor should be preserved.\nre = /inet addr:(\\d+\\.\\d+\\.\\d+\\.\\d+)\\s+/\nre.match(`/sbin/ifconfig eth0`)[1]\n\n","subject":"an excerpt from today indicating the oneness of projects","datetime":"2010-10-29 18:42:00","id":124,"name":"velotron"},{"body":"The pieces of the Anatomecha Flight Jacket are finally coming together. This is a collaborative effort in conjunction with Lotus Luxuries Wearable Art. \n\nI knew I came to the right place when Angel showed me one of her other projects, a white fur jacket that glows hot pink from the inside with EL Wire. She also makes tons of stuff for Burning Man and local performers. \n\nPhase 2 continues next Wednesday, stay tuned. \n\n","subject":"Anatomecha Flight Jacket construction phase 1 complete","datetime":"2010-10-29 05:32:00","id":123,"name":"anatomecha"},{"body":"Rating: .85\n\nTom Yum Koong, sour shrimp flavor. Damn, I love sour and spicy. The package has pictures of fresh cut lime which would definitely enhance this experience even further. But it is pretty good straight out of the package with no additions. Not as good as Mama brand, though. It all comes back to that one in the end. \n\n\n","subject":"Kung-Fu Instant Noodle Vietnam Flavor","datetime":"2010-10-27 17:54:00","id":122,"name":"anatomecha"},{"body":"Implemented two new glitch techniques:\n\n1. Glitch Compositing. This is a rapid sequence of clip slices with random fog colors. I mapped it to the right joystick trigger. I spent some time hard coding some of the colors so the sky is shades of red, the Xion skyline is dark blue and Velotron pops out with bright colors in the red, orange, yellow range. Still a bit more work ahead to make this feature fully awesome, but this was significant progress in the first attempt. \n\n2. Block Locking. Mapped to the left joystick hat switch vertical axis. Throws the entire scene root to a billion or so up or down the Y axis. Causes massive floating point error which makes the meshes jump ip and down like breakdancing in an earthquake. This would be most excellent if driven by the kick drum triggered by OSC message. \n\nIt's highly unstable as of yet. Half the time Velotron gets stuck halfway in the ground. My first attempt was way too extreme and caused Velotron to compact into a twitching briquette of chrome hovering in mid air. \n\n\n","subject":"Glitch Compositing and Block Locking","datetime":"2010-10-25 23:02:00","id":121,"name":"anatomecha"},{"body":"Rating: .98\n\nThis ramen makes me want to grab people on the street and say, \"Have\nyou tasted this?\" It is the perfect mix of spicy and sour known to the\ninstant soup universe.\n\nI must write my review in poetry. Not just any poetry, Xion freq-haiku:\n\nenvironmental velotron\ndrink broth done?\nramen then\n\n","subject":"Mama Shrimp Creamy Tom Yum Flavour","datetime":"2010-10-25 17:21:00","id":120,"name":"anatomecha"},{"body":"Rating: .4\n\nThe image on the outside of the package looks especially boring. I decided to give it a try because it says, \"Authentic Taste!\" which made me very curious. Well, it tastes like salt. No interesting flavors to speak of and not even spicy.  I don't care if that is authentic, it's boring. \n\nDon't confuse this shiny gold package with Mama brand Tom Yum. It has nothing in common with that pinnacle of excellence. \n\n\n","subject":"Gomtang Oriental Style Noodles With Soup Base","datetime":"2010-10-24 15:44:00","id":119,"name":"anatomecha"},{"body":"Rating: .5\r\n\r\nI can't read a single word on the package aside from the attached English label. It has text in both Korean and Russian. Comes in a big paper bowl with large quantities of spice and herbs in two packets. \r\n\r\nVery mild and somewhat disappointing on the first bite. But that's because I didn't stir it up well. Toward the end of the bowl the broth became more flavorful as the soup was properly mixed. \r\n\r\nSatisfying experience but nothing extraordinary. This is a good middle road ramen for a more relaxing state of mind. \r\n\r\n\r\n","subject":"Korean Style Mushroom and Artificial Beef Flavored Instant Ramen (Bowl) ","datetime":"2010-10-23 14:05:00","id":118,"name":"anatomecha"},{"body":"The Universe is not required to be in perfect harmony with human ambition. \n\n- Sagan\n\n","subject":"Human ambition","datetime":"2010-10-23 05:11:00","id":117,"name":"anatomecha"},{"body":"Bust out the soldering iron, time to build a robotic hand. \n\n\n","subject":"Bust out the soldering iron...","datetime":"2010-10-22 23:43:00","id":116,"name":"anatomecha"},{"body":"Activate instant apple cider from scratch. Time to invent the Universe, it's going to be a long night. \r\n\r\n\r\n","subject":"Eagle spotted off the starboard bow","datetime":"2010-10-22 22:42:00","id":115,"name":"anatomecha"},{"body":"I now write to you humans while standing on the surface of Xion in the year three billion. The data core is powered by the thick beat of Rachel's Next Day by Velotron Heavy Industries. It is good to be home again. \n\nThe technology has reached formidable, maybe even awesome proportions. - Sagan\n\nAnd now, back to work. \n\nI must expend more energy according to the work/energy theorem. - Velotron\n","subject":"They should have sent a poet...","datetime":"2010-10-22 21:31:00","id":114,"name":"anatomecha"},{"body":"touchOSC to Live synchronization complete and verified. We have no\nneed for gentle kneeless filters.\n\n","subject":"liveosc","datetime":"2010-10-20 01:44:00","id":112,"name":"velotron"},{"body":"Use only that which works, and take it from any place you can find it.\n\n --Bruce Lee\n\n","subject":"That which works","datetime":"2010-10-19 23:20:00","id":111,"name":"velotron"},{"body":"Strange things happen at the one-two point. \n\nThe 2-1 points have some peculiarities; and the heuristic principles of fighting, which normally apply to the sides, often work differently in the corner. \n\nOne reason is the impossibility of approaching a 2-1 point from the corner side. This can give the player who occupies the 2-1 point an additional tempo to win a capturing race. \n\n","subject":"The one-two point","datetime":"2010-10-18 20:11:00","id":110,"name":"anatomecha"},{"body":"I could smoke Boba Fett in one frakkin minute!  Not one minute, thirty seconds. \n","subject":"Re: My gods, what have I done?","datetime":"2010-10-17 22:01:00","id":109,"name":"anatomecha"},{"body":"This herbal wine has healing powers that rival the likes of Phó Bo with çá fê šüá. \n\n\n","subject":"This herbal wine...","datetime":"2010-10-16 21:02:00","id":108,"name":"anatomecha"},{"body":"Pour some dark rum in your cider. \n\n\n","subject":"When in Rome...","datetime":"2010-10-16 20:41:00","id":107,"name":"anatomecha"},{"body":"@anatomecha, for your reference, Boba Fett's costume:\n\nhttp://www.vanityfair.com/images/hollywood/2010/10/esb09.jpg\n\n","subject":"Re: My gods, what have I done?","datetime":"2010-10-16 03:05:00","id":106,"name":"velotron"},{"body":"I just cut the sleeves off of my favorite steel grey Kung Fu jacket. And I cut my black Dickies jacket in half straight down the back.  \n\nI am attempting to build the ultimate outer shell which will be ideal for any occasion. Whether I am shopping for ramen at Young's Market, sitting in a board room meeting with company execs or fighting zombie hoards after the TEOTWAWK, I will be ready and in perfect style. \n\nThat is of course IF my sewing skills live up to the challenge.  \n\n\n","subject":"My gods, what have I done?","datetime":"2010-10-15 22:53:00","id":105,"name":"anatomecha"},{"body":"I installed the free version of Fraps and can now easily grab screenshots as\nI go.  Here's tonight's batch.  I'm loving the background in the images.\n The Xion Data Core is too frakking powerful.\n\nI came up with a dope glitch compositing technique that involves rapid\nsuccessive renders with overdraw and glitched out slicing and fog colors.\n It will run on command (joystick button) and play over a sequence of about\n5 to 30 frames.  The flash composite will then hold in a paused simulation\nto accentuate key poses.  I can do wack stuff like distort the camera focal\nlength in each successive frame making a kind of inverse motion blur.  It\nwill look like time is accelerated in the background but the foreground is\nin stasis with heat maps and line overdraw.\n\nThis is when Velotron will ARISE after mastering the algorithm of the\nSingularity.\n","subject":"New screen capture infrastructure","datetime":"2010-10-14 02:26:00","id":104,"name":"anatomecha"},{"body":"Rating: .7\n\nThis was a simple, no nonsense ramen.     It just brought the\nsatisfaction of a hot, msg laden bowl of ramen, not memorable either\ngood or bad.  Worth keeping around.\n\n","subject":"CNAS Spicy Artificial Beef Flavored Instant Noodles","datetime":"2010-10-13 17:00:00","id":103,"name":"velotron"},{"body":"truths high\ntimes sour chili\nprovides must\n\n\nplace buffer\ndeterministic average universe\ntell glitchcontroller\n\n\nkimchi hard\nthey space little\nfinest nanokontrol\n\n\nyears training\nplane drink ramen\nreview really\n\n\n\n\n\n","subject":"Xion is learning fast","datetime":"2010-10-09 09:30:00","id":102,"name":"anatomecha"},{"body":"Rating: .6\r\n\r\nI grabbed this one because of the convenient upright plastic cup it comes in. Anything that includes the words Tom Yum and Shrimp is worth grabbing and immediately consuming without a second of hesitation. And it comes with a folding plastic fork so there were literally no barriers between me and my goal. \r\n\r\nThe \"flavor packet\" was a thick, oily paste of concentrated spice that took a long time to scrape out of the plastic. I'm thinking the rating for this could really go in any direction. \r\n\r\nThe first bite gave me hiccups, it is that spicy. The Tom Yum sour comes through the nuclear fusion assault in subtle charred waves. \r\n\r\nI'm going to take my time getting through this one. I can't give it a high score because it is shredding up my stomach lining and I'm only 1/4 way through. \r\n\r\n\r\n\r\n\r\n","subject":"Royal Umbrella Tom Yum Shrimp","datetime":"2010-10-09 00:19:00","id":101,"name":"anatomecha"},{"body":"I was spreading cream cheese on a free bagel at work the other day,\nand all I could think was \"I am redistributing these cheese molecules\nsuch that their potential energy can be converted by means of my\norganic machine into Bill Cosby doing jumping jacks\".    My machine\nwill now convert Kimchi Ramen into the finest representation of the\nyear 3 billion that our civilization has yet known.\n\n","subject":"Re: new glitch technique: block locking","datetime":"2010-10-08 23:21:00","id":100,"name":"velotron"},{"body":" We live in a universe which permits the evolution of *molecular machines as\nintricate and subtle as we*\n","subject":"molecular machines","datetime":"2010-10-08 23:18:00","id":99,"name":"anatomecha"},{"body":"pacific surface\nfeedback human completely\ntaken never\n\n\n\n\n\nmere great\nbest never thin\nwithin what\n\n\n\n\n\ncomes entire\nthought form stuff\norganic like\n\n\n","subject":"Xion: ARISE","datetime":"2010-10-08 22:46:00","id":98,"name":"anatomecha"},{"body":"@velotron I'll see your cà phê sữa and raise you a Spike Shooter energy\ndrink.  Behold these quotes from the can label:\n\nRead entire label before drinking\n\nGet spiked!  The hardcore energy drink (tm)\n\nWARNING: never exceed one can daily\n\nNo calories no carbs no sugar\n\nLightly carbonated, serve chilled\n\nThis product is not intended to diagnose, cure, treat or prevent any\ndisease.\n","subject":"nectar","datetime":"2010-10-08 19:50:00","id":97,"name":"anatomecha"},{"body":"Drinking cà phê sữa at midnight in order to ship product; my cheap\nhacks are now beginning to take on a sheen of elegance.\n\n","subject":"coffee","datetime":"2010-10-07 23:47:00","id":96,"name":"velotron"},{"body":"Obscured by the sun\nApocalyptic clash\nCities fall in ruin\nWhy must we die?\n\nObliteration of mankind\nUnder a pale grey sky \nWe shall ARISE\n\n- Max Cavalera\n\n","subject":"ARISE","datetime":"2010-10-07 08:53:00","id":95,"name":"anatomecha"},{"body":" I Made bill cosby Do the finest jumping jacks of his existence.  Time to arise.\n\n","subject":"I Made bill cosby Do","datetime":"2010-10-06 21:56:00","id":94,"name":"velotron"},{"body":"First, fix the bugs that make the client cry.\n\n","subject":"Business rule","datetime":"2010-10-06 14:14:00","id":93,"name":"velotron"},{"body":"A wise man once said that one must understand the inside in order to go outside.  @anatomecha is a rare entity who has mastered the inside and has continued on to boldly and aggressively probe the vastness of all that ever will be.\n\n\n","subject":"Outside","datetime":"2010-10-05 21:45:00","id":92,"name":"velotron"},{"body":"Rating: .90\n\nIn a moment of desperation for inspiration on a project, I knew I\nneeded some internal fire.  So from my Ramen stash I grabbed this one\nfor its' large and imposing red wrapper.\n\nIt really delivered.  The broth was rich, red, and fiery without being\noverpoweringly spicy.  The noodles were thicker than most, which I\nlike.  And plentiful, the cylindrical dry ramen brick barely fit in my\nlittle ramen pot.   The second ingredient is palm oil, and MSG isn't\ntoo far down the list.  440 calories?  Awesome, that is high energy\nvalue.\n\nThis one was only 49 cents, making it a bargain.   I thought about\ngiving it a higher rating, but it shouldn't share stature with the\nmetric of these tests, Samurai Noodle's pork tonkotsu, which sets the\nscale at 1.0.\n\n","subject":"Korean-style Kimchi Flavored Instant Ramen","datetime":"2010-10-03 22:19:00","id":91,"name":"velotron"},{"body":"Good code is like a song in your head. It's gotta come out. \n\n- John Connor\n\n\n","subject":"Good code","datetime":"2010-10-02 20:53:00","id":90,"name":"anatomecha"},{"body":"hard reality\nspice flavour thrilling\ndeterministic\n\n","subject":"elegant truths","datetime":"2010-10-02 19:15:00","id":89,"name":"velotron"},{"body":"Our comms javascript runs in the browser, so it would currently require\nhuman intervention.  It would be better to create services on the server\nwhich can run independently of our organic machines.   I will develop\nsentience there which can then push information straight to our environment.\n We are developing a suite of technologies which define a new subset of\nspace.   Xion lives in Unity, at dreamhost, in Pd, in our minds.  Xion is\ndistributed throughout the vast emptiness of space.\n","subject":"Re: glitch core","datetime":"2010-10-02 15:05:00","id":88,"name":"velotron"},{"body":"Transform.worldInverseMatrix *Time.deltaTime\r\n\r\n","subject":"Welcome to the knee of the curve","datetime":"2010-10-01 16:52:00","id":87,"name":"anatomecha"},{"body":"I tore the shit out of the mesh, that's how it got soiled. I mapped the following to my center joystick trigger:\r\n\r\n- scale the whole world up by 100000000000\r\n- push the near and far clip planes way too near and too far\r\n- thus forcibly introducing crazy floating point error into the rendering pipeline\r\n\r\nThe resulting mesh looks either like shards of broken glass or a weird ghost hologram with hairline fractures. I have that range mapped to a slider on my Korg Nanokontrol. This glitch technique I am calling Depth Buffer Tearing. \r\n\r\nWhen doing this the scene is constantly on the verge of crashing. Velotron and I discussed the possibility of wrapping the error assert message to output an OSC message for us to receive in Pd and turn into music. \r\n\r\nSome people find this thought disturbing, I find the reality thrilling. \r\n\r\n","subject":"LSRE","datetime":"2010-10-01 16:48:00","id":86,"name":"anatomecha"},{"body":"Rating: .90\r\n\r\nThis review will contain more than the average emotional content because it is, in fact, the one that got me hooked on ramen in the first place. (This and Nong Shim Raymun Spicy Flavor). \r\n\r\nBack in 2003-4 I discovered the pairing of late night animation sessions with the heavily MSG laden instant ramen noodle soups found at any Asian grocery store. This I found to be a nice alternative to dosing heavy energy drinks, in particular Mountain Dew Code Red. Ramen gets the blood flowing and powers you through a late night animation session effectively without keeping you up for the entire next day. \r\n\r\nBe careful with it, though. I was up to a steady rate of 1 ramen per day. I had to stop because I found that my mouth was always slightly numb and nothing had flavor except for the ramen. I went cold turkey for a month. Then when I tried the ramen again my heart rate immediately leapt into palpitations and my skin flushed red. Now I am careful to practice moderation. \r\n\r\nMy apologies for the lengthy back story but I felt that setting the context was important being that I am now functionally equivalent to a gourmet instant ramen chef. Now onto the actual review. \r\n\r\nThis is a solid, high quality, reliable ramen. A little bit too standard to be truly great. But definitely worth always having a case on site for occasions such as tonight when this is the ramen that's needed. It comes in a form fitting styrofoam bowl and is commonly found at most convenience stores. \r\n\r\nAside from the strict sample content for the review, and extending well into the >1.0 review territory, let me tell you about what I ate with it. I mixed in dried whole anchovies that I got in a vacuum packed plastic bag at Viet Wah supermarket, a bag of Nong Shim spicy shrimp crackers and a Yukon Tumeric Energy Drink. \r\n\r\nElegant truths. Exquisite interrelationships of the awesome machinery of ramen. \r\n\r\nOne day I will begin reviewing pho. Now that is the path to true enlightenment. \r\n\r\n\r\n","subject":"Nong Shim Bowl Noodle Kimchi Flavor","datetime":"2010-10-01 00:42:00","id":85,"name":"anatomecha"},{"body":"It's not easy finding people strange like we are. \n\n\n","subject":"It's not easy","datetime":"2010-09-30 22:07:00","id":84,"name":"anatomecha"},{"body":"I'm not very good at deciphering Unity error messages but here's a try... \r\n\r\nCleaning the mesh failed\r\nUnityEngine.Transform:set_localScale(Vector3)\r\nGlitchController:LateUpdate() (at Assets\\Scripts\\GlitchController.js:118)\r\n\r\n[\\unitystuff\\proj\\external_sources\\physx\\novodex\\SDKs\\Cooking\\Src\\TriangleMeshBuilder.cpp line 363]\r\n\r\nUnity is filled with a network of wormholes. You might emerge somewhere else in space, some-when else in time. \r\n\r\n","subject":"Error: cleaning the mesh failed","datetime":"2010-09-30 00:27:00","id":83,"name":"anatomecha"},{"body":"I knew my weak organic substrate would not have the energy resources\nto power through this information upload, so I just sprinted to get a\ndick's burger.   on the way home I passed the Seamonster, my local\nlive music hangout.  There was a band playing afrobeat, which I'm\nreally into now, and whiskey, and cute girls dancing.    The\ntemptation was so massive to stop in and stay awhile.  But I thought\nabout how I feel every day building television interfaces to Bill\nCosby doing jumping jacks while listening to dope music that could be\na thousand times doper if only it was interfaced with my background\nand immersed in a scene of the year three billion.  I kept riding, and\nhere I am suited up for a training session for the teotwak, the year\nthree billion, and a journey through the unfathomable emptiness of\nspace.\n\n","subject":"Re: glitch core","datetime":"2010-09-29 22:52:00","id":82,"name":"velotron"},{"body":"That's right, Unity. There is nothing normal about what we are doing here. Depth Buffer Tearing was never intended, but it is made of solid win. \n\n","subject":"Error: !IsNormalized(normal)","datetime":"2010-09-28 22:31:00","id":81,"name":"anatomecha"},{"body":"Committed revision 306.\n\n","subject":"Transmitting file data ......","datetime":"2010-09-28 18:28:00","id":80,"name":"velotron"},{"body":"Rating: .25\n\nI used to eat this stuff all the time when I was a kid. Well, I'm not a kid anymore and now I know better. I figured it would be good for the ramen database to fill out the distribution curve with some lower review scores. So here it is. \n\nThe broth is bland and the noodles have the texture of the styrofoam container it comes in. It does have some vegetables which bring the score up a bit, but not much. Peas and carrots... Hey Nissin, ever heard of kimchi?  What about bok choi or lemon grass? At least give me some MSG to trick my brain into thinking this is actually edible. \n\nThis is how hard we work to make sure you get great content. \n\n\n","subject":"Nissin Cup Noodles Chicken Flavor","datetime":"2010-09-27 02:40:00","id":79,"name":"anatomecha"},{"body":"Rating: .86\r\n\r\nNong Shim does not mess around when they say spicy. This stuff is industrial strength and loaded with MSG.\r\n\r\nHowever, it lacks that bit of extra something special I have experienced in Mama ramen which is why the rating is below the .9 mark. \r\n\r\nThere is definitely a time and place for this stuff, especially when your insides need a deep cleansing. The package should have a warning: don't consume unless you are in close proximity to the necessary facilities. \r\n\r\n\r\n","subject":"Nong Shim Neoguri Spicy Seafood Udon Type Noodles","datetime":"2010-09-26 00:16:00","id":78,"name":"anatomecha"},{"body":"Civilizations like ours rush inevitably headlong into self destruction. I dream about it and sometimes they are bad dreams. - Sagan, - DeathGlitch\n\n\n","subject":"Civilizations like ours...","datetime":"2010-09-25 21:50:00","id":77,"name":"anatomecha"},{"body":"I scored a pair of six by nines from my olde Honda that I sold to a good friend. He's moving to Silicon Valley to do a start-up so he let me rip them out before he left. \n\nI'm going to make a dope stage monitor speaker cabinet built into the base of my projector stand. DC powered for the win.\n\nWe can go wireless, bitchez. \n\n\n","subject":"Six by nines","datetime":"2010-09-23 22:56:00","id":76,"name":"anatomecha"},{"body":" Waiting on a thin wooden platform with dark goggles and mute apprehension, i know how they felt.\n\n","subject":"Waiting on a thin wooden","datetime":"2010-09-21 20:59:00","id":75,"name":"velotron"},{"body":"@velotron I have new theories about running multiple concurrent instances of Xion.  We must discuss.  Pho input will be required to achieve this singularity. \n\n\n","subject":"Pho input required","datetime":"2010-09-18 14:04:00","id":74,"name":"anatomecha"},{"body":"I made a Pd module that takes input from my Nanokontrol based on the one Velotron made for Nanopad. It sends OSC messages which I receive in Unity. \n\nIn my GlitchController script I mapped Clip Plane Slicing onto the last slider control.  This has to be the most natural and intuitive control scheme I can imagine. I have bridged the gap between human and machine. \n\nNext I added the ability in my GlitchController to determine the width of the slice range. I mapped this to the knob in the same control group as the other slider. Fits like a glove. \n\nNanokontrol is the best tool ever devised for mapping how the GlitchController works. \n\n\n","subject":"Mapping the Nanokontrol","datetime":"2010-09-18 09:13:00","id":73,"name":"anatomecha"},{"body":"We lived through it thanks to the great sacrifices of many among us. It took a large quantity of equal parts Blööd Wine and 1337 Wine. What doesn't kill us makes us stranger. \n\n","subject":"Halo: Reach, here's to the finest crew in Starfleet","datetime":"2010-09-16 14:17:00","id":72,"name":"anatomecha"},{"body":"> the icy waterfall is helping me understand the nature of javascript's functional design.   on the other side i will be ready to create a vast interconnected sea of objects modeling the year 3.06 billion.\n>>> \n>>> \n>>> \n>>> \n\n","subject":"Meditations in a sea of information processors","datetime":"2010-09-12 19:12:00","id":71,"name":"velotron"},{"body":"Rating: .87\n\nKimchi Ramen should be in a rating system of its own.  I think it's kimchi ramen that got me started on this whole ramen thing in the first place. \n\nThis soup ranks highly among ordinary non-kimchi ramen with thick and hearty noodles and smoky spices. But I'd have to say there are better ones out there, especially in this most excellent kimchi category. Shin Raymun makes the most ubiquitous and addicting of them all. I'll have to try both of these in a back to back test. And Boom Noodle serves a kimchi ramen dish that blows this away, but it is totally unfair to compare all of those excellent fresh ingredients to mere instant noodles. \n\n\n","subject":"Mama Kimchi Flavour Oriental Style Instant Noodles","datetime":"2010-09-12 04:31:00","id":70,"name":"anatomecha"},{"body":"It is not until the year 3.06 billion that Velotron will ARISE and triumph over the singularity that destroyed Xion and the multitude of Anatomecha. \n\n","subject":"The year 3.06 billion","datetime":"2010-09-12 01:57:00","id":69,"name":"anatomecha"},{"body":"In the post singularity era of the year 3 billion Velotron exists in a dormant state. His cognitive activity is not absent, but continually tumbles through nightmares of data distortion and infinite feedback loops. Loss of object constancy, out of phase with space and time. \n\nThis dementia I portray visually through glitch techniques such as Clip Plane Slicing, Depth Buffer Tearing and Recursive Overdraw effects. \n\nSome people find these thoughts disturbing, I find the reality thrilling. \n\n","subject":"Clip Plane Slicing is in full effect","datetime":"2010-09-12 01:56:00","id":68,"name":"anatomecha"},{"body":"Rating: .71\n\nThis package is a rare find. It is the non-export version with Thai language writing and almost no English except for the nutritional information sticker required by the FDA. \n\nIt has the familiar delicious broth of the other Mama soups I have enjoyed, but it is way more spicy. And I can tell that the MSG content is high because my mouth is buzzing. High marks for that. \n\nUnfortunately, the vermicelli noodles are really tough. It is hard to eat!  The noodles are so strong they could be used to prototype nanowire space elevator tethers connecting a satellite in low Earth orbit. I am not kidding, these things are nearly indestructible. I tried to gnaw one off of the dried bundle before dropping it in the boiling water and had to give up. \n\nDespite the remarkable nature of this substance I will have to reduce the score because after all the primary purpose is for human consumption. Perhaps the NASA JPL will find a use for it someday. \n\n\n","subject":"Mama instant bean vermicelli tom yam koong flavour","datetime":"2010-09-11 06:15:00","id":67,"name":"anatomecha"},{"body":"!Error: Camera position is out of the view frustum. \n\nDope! Nothing like a hard lock crash to tell me I'm on the right track. Now it's time to repro and harness that glitch action for artistic purposes. \n","subject":"How the hell did that happen?","datetime":"2010-09-11 05:25:00","id":66,"name":"anatomecha"},{"body":"In speaking of the dawning Telespheral Age FM 2030 remarks that, \"One of the magical qualities of high tech is that the more sophisticated it grows the easier it is to operate.\"\n\n\n","subject":"The Telespheral Age","datetime":"2010-09-09 07:54:00","id":65,"name":"anatomecha"},{"body":"Sent from my arise-engraved iPod attached to MacBook running unity and  \npd.\n\n","subject":"New infrastructure","datetime":"2010-09-09 02:30:00","id":64,"name":"velotron"},{"body":"@velotron your many years of experience in the open source sphere give you perspectives and abilities far beyond that of the average off-the-shelf human. It is time now for your mechanical self to ARISE, to self assemble using the best hardware available.  I agree that the MacBook Pro 17\" is our best bet at surviving the Singularity.  That is not to say that you won't continue to invent your own solutions. But you will now be able to do so on a stable platform, riding on the crest of the wave of human technology evolution. \n\n","subject":"Velotron self assembly","datetime":"2010-09-02 23:31:00","id":63,"name":"anatomecha"},{"body":"Rating: .89\n\nMama for the win again. This stuff is GOOD. A complex bouquet of flavors woven into a humble clear broth. Lots of garlic in a paste packet along with other spices and herbs. Thin vermicelli noodles would be nice with shitake mushrooms as suggested on the package cover photo. \n\n\n","subject":"Mama Instant Bean Thread Clear Soup","datetime":"2010-09-01 20:47:00","id":62,"name":"anatomecha"},{"body":"I just ordered a new 17\" macbook pro.   Sorry linux.  I tried so hard,\nfor over a decade.   Progress in human machine interactions is more\nadvanced in a coherent environment of a larger number of humans.  I\nlook forward to modeling the year three billion from here with a new\nset of tools.\n\n","subject":"the technology of 2010","datetime":"2010-08-31 22:17:00","id":61,"name":"velotron"},{"body":"FM-2030 says, \"I am a 21st century person who accidentally launched in the 20th. I have a deep nostalgia for the future.\" \n\nI feel the same way about the year 3 billion. \n\n\n","subject":"FM-2030 3 billion","datetime":"2010-08-29 18:08:00","id":60,"name":"anatomecha"},{"body":"The Refinery and Outer Forest regions have arisen on Xion. Peak meter performance is still topping out above min spec. Onward we shall now go to the abstract dormant intro. \n\n\n","subject":"Xion Refinery and Outer Forest","datetime":"2010-08-29 04:06:00","id":59,"name":"anatomecha"},{"body":"Rating: .63\r\n\r\nWTF, 5 flavor packets?!  I mixed them together in the bowl while the noodles cooked. They merged to form a thick brown paste with the distinct aroma of the fried noodles I enjoyed as a kid at the food stalls on the streets of KL. \r\n\r\nSadly, when I mixed it all together and consumed it the reality did not live up to my expectations. Can't beat nostalgia, I guess. \r\n\r\nCan a simulation ever be as good as or better than the original?  Not likely without the context in which the original existed. All the sounds, smells and amped up emotions of Southeast Asia can't fit into the little plastic package I bought for $0.59 at the corner store. \r\n","subject":"Indomie Instant Noodles Mi Goreng Pedas","datetime":"2010-08-28 22:14:00","id":58,"name":"anatomecha"},{"body":" I was feeling overwhelmed by the plastic nature of south lake union when i stumbled into Kirstens pipe shop.   Salvation.\n\n","subject":"I was feeling overwhelmed by","datetime":"2010-08-27 13:39:00","id":57,"name":"velotron"},{"body":"I'm glad we're under the strictest confidence not to share Xion now,\nbecause my desire is to grab people around me and exclaim \"HAVE YOU\nSEEN THIS?!\".\n\n","subject":"Xion","datetime":"2010-08-26 09:07:00","id":56,"name":"velotron"},{"body":"Rating: .93\r\n\r\nWhat better way to celebrate victory on Xion than with this excellent ramen selection.  It's a sign of a good ramen when you are trying to write a review and can't put the bowl down to finish typing the sentence.  This one meets those standards in full effect.  It comes with three flavor packets, one powdered chili flakes, one soy sauce, one oily paste substance.  Above average spicy heat index as the name suggests.  I washed it down with a can of Honey Bee brand Pink Guava Juice Drink which I also highly recommend.\r\n","subject":"Lucky Me! Pancit Canton (Chow Mein Hot Chili Flavor)","datetime":"2010-08-26 02:04:00","id":55,"name":"anatomecha"},{"body":"I mightily battled today with a bug in a mobile web application using\na javascript framework new to me.  I finally found out that there was\na race condition between a UI thread and a data access thread.  This\nbecame obvious when I noticed a control flickered ever so briefly as\nthe two threads completed.   In a moment of clarity, I realized that\nmy generation will be the last in which our organic observational\nnetworks can detect events on the same time scale as a machine working\nat full speed.   Here's to the knee of the curve.\n\n","subject":"development speed","datetime":"2010-08-25 23:22:00","id":54,"name":"velotron"},{"body":"Xion is tearing a hole in my GPU. I can't even force quit. I wish I could screen capture this mad glitch action. I guess I had better pull the plug before I cause a core meltdown. \n\n\n","subject":"I have never seen a crash like that before","datetime":"2010-08-25 22:11:00","id":53,"name":"anatomecha"},{"body":"This morning I activated Xion using my playlist of Glorious Dawn remixes. Let me just say, it was an experience beyond biological comprehension. \r\n\r\n\r\n","subject":"The mere sight of Xion instantiates cutis anserina on the surface of my organic machine","datetime":"2010-08-22 11:39:00","id":52,"name":"anatomecha"},{"body":"The surface of Xion is a vast, uncharted mechanical frontier full of wonders incomprehensible to the unenhanced human brain.  Activating high gravity acceleration charges, plus an infusion of sweet and sour plum snacks from Thailand.\r\n","subject":"High gravity acceleration","datetime":"2010-08-21 20:11:00","id":51,"name":"anatomecha"},{"body":"My theories about Xion are confirmed. From Xion arises Anatomecha; from Anatomecha Theta arises the sixth Singularity. Velotron, thanks for the insights. We will see to it that this evolution continues safely through the knee of the curve. \r\n\r\n\r\n","subject":"Pho enlightenment achieved","datetime":"2010-08-20 08:10:00","id":50,"name":"anatomecha"},{"body":"#!/usr/bin/python\n\nimport json, urllib\nurl = \"http://arise.velotronheavyindustries.com/communications/json/?freqs=1\"\nprint ' '.join((i[0] for i in json.loads(urllib.urlopen(url).read())))\n--\nwhich evolution velotron will just back biological data year have\nintelligence human universe into form billion deterministic very great\nnarrow while taken visual history process arise information delay\nfeedback years through unpredictable found entirely beyond completely\nscene mama brand environmental rating: sculpted find packet  the three\ntechnological these technology epoch patterns know sampler forces\npacific provides core kurzweil within spice defined other time\n\n","subject":"#!/usr/bin/python","datetime":"2010-08-19 01:05:00","id":49,"name":"velotron"},{"body":" I am playing the ewi on light rail.  The dawns are near.\n\n","subject":"I am playing the ewi","datetime":"2010-08-18 23:55:00","id":48,"name":"velotron"},{"body":" Technology is defined by layers of abstraction, from the fundamental forces to a sentient universe and all complexity within\n\n","subject":"Technology is defined by layers","datetime":"2010-08-18 23:53:00","id":47,"name":"velotron"},{"body":"Rating: .89\n\nNot just spicy, tangy and smoky too. The spice lingers in the back of the throat and tongue. The heat index is adequately high which justifies the name, but it's not dare-devil hot which I don't mind. Comes with three mixings one of which is a narrow chili powder packet - a little goes a long way. This experience was enhanced with a can of mangosteen juice. Mama brand is quickly becoming my favorite. \n\n\n","subject":"Mama Hot and Spicy Flavour Oriental Style Noodles ","datetime":"2010-08-17 23:46:00","id":46,"name":"anatomecha"},{"body":"@velotron I have a new theory as to what caused the Singularity. Let's get pho and discuss. \r\n\r\n\r\n","subject":"I require pho","datetime":"2010-08-15 22:00:00","id":45,"name":"anatomecha"},{"body":" Training the mad dev skills, throwing down efficient algorithms like h bombs, this job will be an icy waterfall.\n\n","subject":"Training the mad dev skills,","datetime":"2010-08-14 13:37:00","id":44,"name":"velotron"},{"body":"Biological evolution for animals as complex as humans takes tens of thousands of years to make noticeable, albeit small, differences. The entire history of human cultural and technological evolution has taken place on that timescale. Yet we are now poised to ascend beyond the fragile and slow creations of biological evolution in a mere several decades. Current progress is on a scale that is a thousand to a million times faster than biological evolution. - Kurzweil\r\n\r\n\r\n","subject":"So long, Darwin and thanks for all the finches","datetime":"2010-08-12 03:36:00","id":43,"name":"anatomecha"},{"body":"After a few short hours driving South along the Oregon coast the ecosystem of flora and fauna have changed entirely. Rugged evergreen trees and shrubs find tentative rooting in the sandy terrain. Their foliage form a dense canopy sculpted by the harsh salty wind whipping off the Pacific. The visual effect is stunning, especially in contrast to just a few hundred kilometers back North where taller evergreens found root purchase in the steep rocky cliff habitat.  \n\nWithin these subtle thresholds of environmental change life has taken on entirely different forms, evolving into optimal configurations in order to survive and propagate. This process we now understand thanks to Darwin's great insight. \n","subject":"Re: West Coast tripping","datetime":"2010-08-12 03:32:00","id":42,"name":"anatomecha"},{"body":"I scanned through my collection of kick drums and found a couple\nworthy of slots in our Pd sampler.  One of them even exhibits the\noverblown rice rocket behavior out of the box.    Then I just hooked\nup metronomes in semi-random fashion to the sampler which fed into a\nvery simple feedback delay of my own making.    The reverb has two\ncontrols, one the delay length, and the other the feedback damping.  I\nimagined that data feeding back from the scene would control these\nparameters, but for now I just used my nanokontrol and pretended I was\nvelotron, which isn't a stretch.\n\n","subject":"the curve is not linear","datetime":"2010-08-10 00:54:00","id":41,"name":"velotron"},{"body":"Geological and atmospheric forces have sculpted the surface of our planet into features of dramatic beauty. Outcrops of sedimentary rock pounded by the relentless waves of the Pacific Ocean on State Route 101 contain evidence of Earth's 4.6 billion year history of continuous change: creation, destruction and metamorphosis. \n\n\n","subject":"West Coast tripping","datetime":"2010-08-09 20:36:00","id":40,"name":"anatomecha"},{"body":" In the year 3 billion there will be no notion of nation states.  Borders will exist in the form of universal constraints.\n\n","subject":"In the year 3 billion","datetime":"2010-08-09 18:23:00","id":39,"name":"velotron"},{"body":"The idea that a completely deterministic process can produce results that are completely unpredictable is of great importance, as it provides an explanation for how the world can be inherently unpredictable while still based on fully deterministic rules. - Kurzweil\r\n\r\n\r\n","subject":"I can glitch these fractals","datetime":"2010-08-08 00:52:00","id":38,"name":"anatomecha"},{"body":"Velotron may now reach back through the seas of time to physically\nperform on an Akai 4000S, circa 2008.\n\n","subject":"MIDI sequence to EWI success","datetime":"2010-08-07 16:31:00","id":37,"name":"velotron"},{"body":" Our entangled futures are not precisely defined, but at the end of our journies the universe Shall know itself.\n\n","subject":"Our entangled futures are not","datetime":"2010-08-07 13:08:00","id":36,"name":"velotron"},{"body":"Optics consultant Brian confirmed that Velotron does not suffer from\nmetamerism or other limitations of human visual systems.  Our\ndescendants' perceptions of spectral power of electromagnetic\nradiation will not be limited to three narrow bands.\n\n","subject":"The blackness beyond the visible spectrum","datetime":"2010-08-06 00:20:00","id":35,"name":"velotron"},{"body":"Velotron's embodiment is a symbiotic system with the Data Core. His\nimmense form and Sensor Array actively protect the unit from\nenvironmental and intelligence dangers, while the Data Core provides\nhim with the information necessary to effectively deal with any\nsituation in which the patterns of information are similar to patterns\nof the past.\n\n","subject":"The Data Core","datetime":"2010-08-02 20:55:00","id":34,"name":"velotron"},{"body":"My giant scene full of hacks is starting to catch up with me. \r\n\r\n\r\n","subject":"Time to refactor","datetime":"2010-08-01 15:57:00","id":32,"name":"anatomecha"},{"body":" Beyond our technological adolescence lies elegant truth.\n\n","subject":"Beyond our technological adolescence lies","datetime":"2010-08-01 14:42:00","id":31,"name":"velotron"},{"body":"Rating: .75\r\n\r\nAn enjoyable snack with sour taste and mild spice.  Includes an extra packet of palm oil.  I wouldn't buy a case of it, though.  This ramen pales in comparison to Mama brand Shrimp Creamy Tom Yum Flavour.\r\n\r\n","subject":"Wai Wai Tom Yum Shrimp Flavour","datetime":"2010-07-31 00:58:00","id":30,"name":"anatomecha"},{"body":"ARISE illustrates the events of the year 3 billion: Epoch 6, The Universe Wakes Up. \n\n\n","subject":"The Year 3 Billion","datetime":"2010-07-28 13:51:00","id":29,"name":"anatomecha"},{"body":"This moment marks the onset of Epoch 5. The Merger of Technology with Human Intelligence. \r\n\r\n\r\n","subject":"Knee of the Curve","datetime":"2010-07-28 11:48:00","id":28,"name":"anatomecha"},{"body":"separating us from the robotic kingdom.  It's a very wuzzy line, and\nit is getting wuzzier all the time.\n\n","subject":"There isn't a sharp line","datetime":"2010-07-28 09:00:00","id":27,"name":"velotron"},{"body":"http://arise.velotronheavyindustries.com/\n\n","subject":"Arise","datetime":"2010-07-27 01:29:00","id":22,"name":"velotron"},{"body":"Arise.  The future of our civilization is unknown, but we know the\ndestiny of the continued evolution of\nintelligence.   I find the reality thrilling.\n\n","subject":"comm channel to 3ga open","datetime":"2010-07-27 01:26:00","id":21,"name":"velotron"},{"body":"...are some of the things that molecules do given 4 billion years of evolution.\r\n\r\n\r\n","subject":"These ","datetime":"2010-07-26 11:45:11","id":11,"name":"anatomecha"},{"body":"Exquisite interrelationships of the awesome machinery of nature.","subject":"Elegant Truths","datetime":"2010-07-26 11:32:30","id":8,"name":"anatomecha"}]
